chipKIT32/chipKIT-core/pic32/cores/pic32/harmony/framework/peripheral/usb/plib_usb.h
/*DOM-IGNORE-BEGIN*/

#include "peripheral/usb/processor/usb_processor.h"

/*DOM-IGNORE-END*/


// *****************************************************************************
// *****************************************************************************
// Section: Helper Macros
// *****************************************************************************
// *****************************************************************************


// *****************************************************************************
// *****************************************************************************
// Section: USB Peripheral Library Interface Functions: USB Setup
// *****************************************************************************
// *****************************************************************************

// *****************************************************************************
/* Function:
    uint8_t PLIB_USB_DeviceAddressGet ( USB_MODULE_ID index )

  Summary:
    Returns the address of the USB module in Device mode.

  Description:
    This function returns the address of the USB module in Device mode.

  Precondition:
    None.

  Parameters:
    index          - Identifier for the device instance of interest

  Returns:
    Device Address

  Example:
  <code>
    myUSBAddress = PLIB_USB_DeviceAddressGet(MY_USB_INSTANCE);
  </code>

  Remarks:
    Note: This feature may not be available on all devices. Please refer to the specific 
	device data sheet to determine availability or use PLIB_USB_ExistsDeviceAddressin your 
	application to determine whether this feature is available.
*/

uint8_t PLIB_USB_DeviceAddressGet( USB_MODULE_ID index );


// *****************************************************************************
/* Function:
    void PLIB_USB_DeviceAddressSet ( USB_MODULE_ID index, uint8_t address )

  Summary:
    Sets the USB Device's address.

  Description:
    This function sets the USB Device's address as part of enumeration.

  Precondition:
    USB module must be in Host mode.

  Parameters:
    index          - Identifier for the device instance of interest
    address        - USB address

  Returns:
    None.

  Example:
  <code>
    uint8_t myUSBAddress = ....;
    PLIB_USB_DeviceAddressSet(MY_USB_INSTANCE, myUSBAddress);
  </code>

  Remarks:
    Not applicable for PIC18 devices, since USB Host functionality is not available 
    on PIC18 devices.
	
    Note: This feature may not be available on all devices. Please refer to the specific 
	device data sheet to determine availability or use PLIB_USB_ExistsDeviceAddressin your 
	application to determine whether this feature is available.	
*/

void PLIB_USB_DeviceAddressSet ( USB_MODULE_ID index, uint8_t address );


// *****************************************************************************
/* Function:
    void PLIB_USB_Disable ( USB_MODULE_ID index )

  Summary:
    Disables (powers down) the USB module.

  Description:
    This function disables (powers down) the USB module.

  Precondition:
    None.

  Parameters:
    index          - Identifier for the device instance of interest

  Returns:
    None.

  Example:
  <code>
#if ( defined(__PIC24E__) || defined(__dsPIC33E__) || defined(__PIC32MX__) )
    // Disable Host, Device, or OTG before powering down
    PLIB_USB_OperatingModeSelect( MY_USB_INSTANCE, USB_OPMODE_NONE );
#endif
    // Turn off USB
    PLIB_USB_Disable(MY_USB_INSTANCE);
#ifdef (__PIC32MX__)
    // For PIC32, wait until module is no longer busy before trying to
    // access any USB module registers.
    while ( PLIB_USB_ModuleIsBusy (MY_USB_INSTANCE) )
    {
        //wait
    }
#endif
    // Can now read or modify USB module status
  </code>

  Remarks:
    For PIC24/dsPIC33 and PIC32 devices, the USB module must be in Device mode
    before the USB module is powered down.

    For PIC32 devices, all reads or writes to module registers after powering down
    the module will be invalid until PLIB_USB_ModuleIsBusy (MY_USB_INSTANCE) == false.
	
    This feature may not be available on all devices. Please refer to the specific 
	device data sheet to determine availability or use PLIB_USB_ExistsModulePower in your 
	application to determine whether this feature is available.	
*/

void PLIB_USB_Disable ( USB_MODULE_ID index );


// *****************************************************************************
/* Function:
      void PLIB_USB_Enable ( USB_MODULE_ID index )

  Summary:
    Enables (powers up) the USB module.

  Description:
    This function enables (powers up) the USB module.

  Conditions:
    None.

  Input:
    index -  Identifier for the device instance of interest

  Return:
    None.

  Example:
    <code>
      // Complete Needed setup for the module
      PLIB_USB_Enable(MY_USB_INSTANCE);
    </code>

  Remarks:
    Not valid on PIC18 devices until a valid clock source is provided to the 
    USB module.

    See also PLIB_USB_ModuleIsBusy.
	
    This feature may not be available on all devices. Please refer to the specific 
	device data sheet to determine availability or use PLIB_USB_ExistsModulePoweryour 
	application to determine whether this feature is available.	
*/

void PLIB_USB_Enable ( USB_MODULE_ID index );


// *****************************************************************************
/* Function:
    void PLIB_USB_FullSpeedDisable ( USB_MODULE_ID index )

  Summary:
    Forces the USB module to operate at low speed.

  Description:
    This function forces the USB module to operate at low speed.

  Precondition:
    None.

  Parameters:
    index          - Identifier for the device instance of interest

  Returns:
    None.

  Example:
  <code>
    PLIB_USB_FullSpeedDisable(MY_USB_INSTANCE);
  </code>

  Remarks:
    For PIC18 devices, use only before the USB module is enabled to select 
    low speed. In addition, an input clock of 6 MHz instead of 48 MHz is required.

    For all others devices: Host mode only.
	
    This feature may not be available on all devices. Please refer to the specific 
	device data sheet to determine availability or use PLIB_USB_ExistsSpeedControl in your 
	application to determine whether this feature is available.	
*/

void PLIB_USB_FullSpeedDisable ( USB_MODULE_ID index );


// *****************************************************************************
/* Function:
    void PLIB_USB_FullSpeedEnable ( USB_MODULE_ID index )

  Summary:
    Enables the USB to operate at full speed.

  Description:
    This function enables the USB to operate at full speed.

  Precondition:
    Use only before the USB module is enabled by calling PLIB_USB_Enable.

  Parameters:
    index          - Identifier for the device instance of interest

  Returns:
    None.

  Example:
  <code>
    PLIB_USB_FullSpeedEnable(MY_USB_INSTANCE);
  </code>

