chipKIT32/chipKIT-core/pic32/cores/pic32/harmony/framework/peripheral/usb/plib_usb.h
  Remarks:
    For PIC18 devices, use only before the USB module is enabled to select
    low speed. In addition, an input clock of 6 MHz instead of 48 MHz is required.

    For all others devices: Host mode only.
	
    This feature may not be available on all devices. Please refer to the specific 
	device data sheet to determine availability or use PLIB_USB_ExistsSpeedControl in your 
	application to determine whether this feature is available.		
*/

void PLIB_USB_FullSpeedEnable ( USB_MODULE_ID index );


// *****************************************************************************
/* Function:
    bool PLIB_USB_ModuleIsBusy ( USB_MODULE_ID index )

  Summary:
    Indicates if the USB module is not ready to be enabled.

  Description:
    This function indicates if the USB module is not ready to be enabled.

  Precondition:
    None.

  Parameters:
    index          - Identifier for the device instance of interest

  Returns:
    - true  - USB module is active or disabled, but not ready to be enabled
    - false - USB module is not active and is ready to be enabled

  Example:
  <code>
#ifdef (__PIC32MX__)
    while ( PLIB_USB_ModuleIsBusy(MY_USB_INSTANCE) )
    {
        // wait
    }
#endif
    PLIB_USB_Disable(MY_USB_INSTANCE);
  </code>

  Remarks:
    This feature is not available on PIC18, PIC24, and dsPIC33 devices.

    If PLIB_USB_ModuleIsBusy(MY_USB_INSTANCE) == true and the USB module is
    disabled, and all status returned for the module, all enables/disables for
    the module will produce undefined results.
	
	This feature may not be available on all devices. Please refer to the specific 
	device data sheet to determine availability or use PLIB_USB_ExistsModuleBusyin your 
	application to determine whether this feature is available.	
*/

bool PLIB_USB_ModuleIsBusy ( USB_MODULE_ID index );


// *****************************************************************************
/* Function:
    void PLIB_USB_OnChipPullUpDisable ( USB_MODULE_ID index )

  Summary:
    Disables on-chip pull-ups.

  Description:
    This function disables on-chip pull-ups.

  Precondition:
    None.

  Parameters:
    index          - Identifier for the device instance of interest

  Returns:
    None.

  Example:
  <code>
    PLIB_USB_OnChipPullUpDisable(MY_USB_INSTANCE);
  </code>

  Remarks:
    PIC18 devices only.
	
    This feature may not be available on all devices. Please refer to the specific 
	device data sheet to determine availability or use PLIB_USB_ExistsOnChipPullup in your 
	application to determine whether this feature is available.	
*/

void PLIB_USB_OnChipPullUpDisable ( USB_MODULE_ID index );


// *****************************************************************************
/* Function:
    void PLIB_USB_OnChipPullUpEnable ( USB_MODULE_ID index )

  Summary:
    Enables on-chip pull-ups.

  Description:
    This function enables on-chip pull-ups. Pull-up on D+ in Full-Speed mode.
    Pull-up on D- in Low-Speed mode.

  Precondition:
    Use only before the USB module is enabled by calling PLIB_USB_Enable.

  Parameters:
    index          - Identifier for the device instance of interest

  Returns:
    None.

  Example:
  <code>
    PLIB_USB_OnChipPullUpEnable(MY_USB_INSTANCE);
  </code>

  Remarks:
    PIC18 devices only.
	
    This feature may not be available on all devices. Please refer to the specific 
	device data sheet to determine availability or use PLIB_USB_ExistsOnChipPullup in your 
	application to determine whether this feature is available.		
*/

void PLIB_USB_OnChipPullUpEnable ( USB_MODULE_ID index );


// *****************************************************************************
/* Function:
    void PLIB_USB_OperatingModeSelect( USB_MODULE_ID index, USB_OPMODES opMode )

  Summary:
    Selects the operating mode of the USB module.

  Description:
    This function selects the operating mode of the USB module, either Host, 
    Device, or OTG.

  Precondition:
    None.

  Parameters:
    index     - Identifier for the device instance of interest
    opMode    - Selected operating mode: USB_OPMODE_DEVICE, USB_OPMODE_HOST,
                or USB_OPMODE_OTG

  Returns:
    None.

  Example:
  <code>
    PLIB_USB_OperatingModeSelect( MY_USB_INSTANCE, USB_OPMODE_DEVICE );
  </code>

  Remarks:
    Not needed on PIC18 devices, since only UPB_OPMODE_DEVICE is supported 
    and there are no other operating modes. Use USB_OPMODE_NONE to disable 
    all possible functions.
	
    This feature may not be available on all devices. Please refer to the specific 
	device data sheet to determine availability or use PLIB_USB_ExistsOpModeSelect in your 
	application to determine whether this feature is available.	
*/

void PLIB_USB_OperatingModeSelect( USB_MODULE_ID index, USB_OPMODES opMode );


// *****************************************************************************
/* Function:
    void PLIB_USB_PingPongFreeze ( USB_MODULE_ID index )

  Summary:
    Resets all Ping-Pong buffer pointers to even buffers.

  Description:
    This function resets all Ping-Pong buffer pointers to even buffers.

  Precondition:
    None.

  Parameters:
    index          - Identifier for the device instance of interest

  Returns:
    None.

  Example:
  <code>
    // Reset all ping-pong buffers to "Even"
    PLIB_USB_PingPongFreeze(MY_USB_INSTANCE);
    PLIB_USB_PingPongUnfreeze(MY_USB_INSTANCE);
  </code>

  Remarks:
    Buffers remain "frozen" at "Even" until they are unfrozen using
    PLIB_USB_PingPongUnfreeze.
	
    This feature may not be available on all devices. Please refer to the specific 
	device data sheet to determine availability or use PLIB_USB_ExistsBufferFreeze in your 
	application to determine whether this feature is available.	
*/

void PLIB_USB_PingPongFreeze ( USB_MODULE_ID index );


// *****************************************************************************
/* Function:
    void PLIB_USB_PingPongUnfreeze ( USB_MODULE_ID index )

  Summary:
    Enables Ping-Pong buffering.

  Description:
    This function enables Ping-Pong buffering.

  Precondition:
    None.

  Parameters:
    index          - Identifier for the device instance of interest

  Returns:
    None.

  Example:
  <code>
    // Reset all Ping-Pong buffers to "Even"
    PLIB_USB_PingPongFreeze(MY_USB_INSTANCE);
    PLIB_USB_PingPongUnfreeze(MY_USB_INSTANCE);
  </code>

