chipKIT32/chipKIT-core/pic32/cores/pic32/harmony/framework/peripheral/usb/plib_usb.h
  Remarks:
    See PLIB_USB_PingPongFreeze.
    This feature may not be available on all devices. Please refer to the specific 
	device data sheet to determine availability or use PLIB_USB_ExistsBufferFreeze in your 
	application to determine whether this feature is available.		
*/

void PLIB_USB_PingPongUnfreeze ( USB_MODULE_ID index );


// *****************************************************************************
/* Function:
    USB_PING_PONG_MODE PLIB_USB_PingPongModeGet ( USB_MODULE_ID index )

  Summary:
    Returns the Ping-Pong Configuration setting.

  Description:
    This function returns the Ping-Pong Configuration setting.

  Precondition:
    None.

  Parameters:
    index          - Identifier for the device instance of interest

  Returns:
    Ping-Pong Mode - One of USB_PING_PONG__ALL_BUT_EP0,  USB_PING_PONG__FULL_PING_PONG,
                            USB_PING_PONG__EP0_OUT_ONLY, USB_PING_PONG__NO_PING_PONG

  Example:
  <code>
    ppConfig = PLIB_USB_PingPongModeGet(MY_USB_INSTANCE);
  </code>

  Remarks:
    For PIC18F and PIC24F devices only.
	
	This feature may not be available on all devices. Please refer to the specific 
	device data sheet to determine availability or use PLIB_USB_ExistsPingPongMode in your 
	application to determine whether this feature is available.	
*/

USB_PING_PONG_MODE PLIB_USB_PingPongModeGet ( USB_MODULE_ID index ) ;


// *****************************************************************************
/* Function:
    void PLIB_USB_PingPongModeSelect ( USB_MODULE_ID index, USB_PING_PONG_MODE ppConfig)

  Summary:
    Selects the Ping-Pong Configuration setting.

  Description:
    This function selects the Ping-Pong Configuration setting.

  Precondition:
    None.

  Parameters:
    index          - Identifier for the device instance of interest
    ppConfig       - Ping-Pong configuration selection. One of
                     USB_PING_PONG__ALL_BUT_EP0,  USB_PING_PONG__FULL_PING_PONG,
                     USB_PING_PONG__EP0_OUT_ONLY, USB_PING_PONG__NO_PING_PONG

  Returns:
    None.

  Example:
  <code>
    PLIB_USB_PingPongModeSelect(MY_USB_INSTANCE,USB_PING_PONG__ALL_BUT_EP0);
  </code>

  Remarks:
    For PIC18F and PIC24F devices only.
	This feature may not be available on all devices. Please refer to the specific 
	device data sheet to determine availability or use PLIB_USB_ExistsPingPongMode in your 
	application to determine whether this feature is available.		

*/

void PLIB_USB_PingPongModeSelect ( USB_MODULE_ID index, USB_PING_PONG_MODE ppConfig );


// *****************************************************************************
/* Function:
    void PLIB_USB_SleepGuardDisable ( USB_MODULE_ID index )

  Summary.
    Disables Sleep Guard. Entry into Sleep mode is immediate.

  Description:
    This function disables Sleep Guard. Entry into Sleep mode is immediate.

  Precondition:
    None.

  Parameters:
    index          - Identifier for the device instance of interest

  Returns:
    None.

  Example:
  <code>
    PLIB_USB_SleepGuardDisable(MY_USB_INSTANCE);
  </code>

  Remarks:
    Not available on PIC18, dsPIC or PIC24 devices.
    Not available on all PIC32 devices.  Refer to the specific device data sheet 
    for details.
	
    This feature may not be available on all devices. Please refer to the specific 
	device data sheet to determine availability or use PLIB_USB_ExistsSleepEntryGuard in your 
	application to determine whether this feature is available.	
*/

void PLIB_USB_SleepGuardDisable ( USB_MODULE_ID index );


// *****************************************************************************
/* Function:
    void PLIB_USB_SleepGuardEnable ( USB_MODULE_ID index )

  Summary:
    Entry into Sleep mode is blocked if bus activity is detected or if an 
    interrupt is pending.

  Description:
    This function block entry into Sleep mode if bus activity is detected or if 
    an interrupt is pending.

  Precondition:
    None.

  Parameters:
    index          - Identifier for the device instance of interest

  Returns:
    None.

  Example:
  <code>
    PLIB_USB_SleepGuardEnable(MY_USB_INSTANCE);
  </code>

  Remarks:
    Not available on PIC18, dsPIC, or PIC24 devices.
    Not available on all PIC32 devices.  Refer to the specific device data sheet 
    for details.
    This feature may not be available on all devices. Please refer to the specific 
	device data sheet to determine availability or use PLIB_USB_ExistsSleepEntryGuard in your 
	application to determine whether this feature is available.		
*/

void PLIB_USB_SleepGuardEnable ( USB_MODULE_ID index );


// *****************************************************************************
/* Function:
    void PLIB_USB_StopInIdleDisable ( USB_MODULE_ID index )

  Summary:
    Allows the USB module to continue operation when the device enters Idle mode.

  Description:
    This function allows the USB module to continue operation when the device 
    enters Idle mode.

  Precondition:
    None.

  Parameters:
    index          - Identifier for the device instance of interest

  Returns:
    None.

  Example:
  <code>
    PLIB_USB_StopInIdleDisable(MY_USB_INSTANCE);
  </code>

  Remarks:
    Not available on PIC18 devices.
    This feature may not be available on all devices. Please refer to the specific 
	device data sheet to determine availability or use PLIB_USB_ExistsStopInIdle in your 
	application to determine whether this feature is available.		
*/

void PLIB_USB_StopInIdleDisable ( USB_MODULE_ID index );


// *****************************************************************************
/*  Function:
    void PLIB_USB_StopInIdleEnable ( USB_MODULE_ID index )

  Summary:
    Enables USB module operation to stop when the device enters Idle mode.

  Description:
    This function enables USB module operation to stop when the device enters 
    Idle mode.

  Precondition:
    None.

  Parameters:
    index          - Identifier for the device instance of interest

  Returns:
    None.

  Example:
  <code>
    PLIB_USB_StopInIdleEnable(MY_USB_INSTANCE);
  </code>

