chipKIT32/chipKIT-core/pic32/cores/pic32/harmony/framework/peripheral/usb/plib_usb.h
  Remarks:
    Not available on PIC18 devices.
    This feature may not be available on all devices. Please refer to the specific 
	device data sheet to determine availability or use PLIB_USB_ExistsStopInIdle in your 
	application to determine whether this feature is available.		
*/

void PLIB_USB_StopInIdleEnable ( USB_MODULE_ID index );


// *****************************************************************************
/* Function:
    void PLIB_USB_SuspendDisable ( USB_MODULE_ID index )

  Summary:
    Disables USB OTG Suspend mode.

  Description:
    This function disables USB OTG Suspend mode.  The USB OTG module will operate 
    normally.

  Precondition:
    None.

  Parameters:
    index          - Identifier for the device instance of interest

  Returns:
    None.

  Example:
  <code>
    PLIB_USB_SuspendDisable(MY_USB_INSTANCE);
  </code>

  Remarks:
    Not available on PIC18 devices.
	
    This feature may not be available on all devices. Please refer to the specific 
	device data sheet to determine availability or use PLIB_USB_ExistsSuspend in your 
	application to determine whether this feature is available.		
*/

void PLIB_USB_SuspendDisable ( USB_MODULE_ID index );


// *****************************************************************************
/* Function:
    void PLIB_USB_SuspendEnable ( USB_MODULE_ID index )

  Summary:
    Enables USB Suspend mode.

  Description:
    This function enables USB Suspend mode. The 48 MHz USB clock will be gated off. 
    The transceiver is placed in a low-power state.

  Precondition:
    None.

  Parameters:
    index          - Identifier for the device instance of interest

  Returns:
    None.

  Example:
  <code>
    PLIB_USB_SuspendEnable(MY_USB_INSTANCE);
  </code>

  Remarks:
    Not available on PIC18 devices.
	
    This feature may not be available on all devices. Please refer to the specific 
	device data sheet to determine availability or use PLIB_USB_ExistsSuspend in your 
	application to determine whether this feature is available.		
*/

void PLIB_USB_SuspendEnable ( USB_MODULE_ID index );


// *****************************************************************************
/* Function:
    void PLIB_USB_AutoSuspendDisable ( USB_MODULE_ID index )

  Summary:
    Disables USB OTG Auto-suspend mode.

  Description:
    This function disables USB OTG Auto-suspend mode. The USB OTG module will
    operate normally and does not automatically suspend upon entry to Sleep mode. 
    Software must use PLIB_USB_SuspendEnable to suspend the module, including the 
    USB 48 MHz clock

  Precondition:
    None.

  Parameters:
    index          - Identifier for the device instance of interest

  Returns:
    None.

  Example:
  <code>
    PLIB_USB_AutoSuspendDisable(MY_USB_INSTANCE);
  </code>

  Remarks:
    Not available on PIC18 devices.
	
    This feature may not be available on all devices. Please refer to the specific 
	device data sheet to determine availability or use PLIB_USB_ExistsAutomaticSuspend in your 
	application to determine whether this feature is available.		
*/

void PLIB_USB_AutoSuspendDisable ( USB_MODULE_ID index );


// *****************************************************************************
/* Function:
    void PLIB_USB_AutoSuspendEnable ( USB_MODULE_ID index )

  Summary:
    Enables USB Auto-suspend mode.

  Description:
    This function enables USB Auto-suspend mode. The USB module automatically 
    suspends upon entry to Sleep mode.

  Precondition:
    None.

  Parameters:
    index          - Identifier for the device instance of interest

  Returns:
    None.

  Example:
  <code>
    PLIB_USB_AutoSuspendEnable(MY_USB_INSTANCE);
  </code>

  Remarks:
    Not available on PIC18 devices.
	
    This feature may not be available on all devices. Please refer to the specific 
	device data sheet to determine availability or use PLIB_USB_ExistsAutomaticSuspend in your 
	application to determine whether this feature is available.		
*/

void PLIB_USB_AutoSuspendEnable ( USB_MODULE_ID index );


// *****************************************************************************
// *****************************************************************************
// Section: USB Peripheral Library Interface Functions: Buffer Descriptor Table
// *****************************************************************************
// *****************************************************************************

// *****************************************************************************
/* Function:
    void * PLIB_USB_BDTBaseAddressGet ( USB_MODULE_ID index )

  Summary:
    Returns the base address of the Buffer Descriptor Table.

  Description:
    This function returns the base address of the Buffer Descriptor Table.

  Precondition:
    None.

  Parameters:
    index          - Identifier for the device instance of interest

  Returns:
    None.

  Example:
  <code>
    void * pMyBDT;
    pMyBDT = PLIB_USB_BDTBaseAddressGet(MY_USB_INSTANCE);
  </code>

  Remarks:
    Always set to 0x400 for PIC18 devices. Must be set for dsPIC33E/PIC24E,
    PIC24F, and PIC32 devices using PLIB_USB_BDTBaseAddressSet.
	
    This feature may not be available on all devices. Please refer to the specific 
	device data sheet to determine availability or use PLIB_USB_ExistsBDTBaseAddress in your 
	application to determine whether this feature is available.		
*/

void* PLIB_USB_BDTBaseAddressGet ( USB_MODULE_ID index );


// *****************************************************************************
/* Function:
    void PLIB_USB_BDTBaseAddressSet ( USB_MODULE_ID index, void * address )

  Summary:
    Sets the base address for the Buffer Descriptor Table for PIC24 and PIC32 
    devices.

  Description:
    This function sets the base address for the Buffer Descriptor Table. This 
    function is only available on PIC24 and PIC32 devices.

  Precondition:
    None.

  Parameters:
    index          - Identifier for the device instance of interest
    address        - Physical memory address in RAM of Buffer Descriptor Table

  Returns:
    None.

  Example:
  <code>
#if defined(__PIC32MX__)
    // For PIC32
    PLIB_USB_BDTBaseAddressSet(MY_USB_INSTANCE, (void *)((uint32_t)KVA_TO_PA(&myBDT)) );
#else
    // Everybody else
    PLIB_USB_BDTBaseAddressSet(MY_USB_INSTANCE, (void *)(&myBDT) );
#endif
  </code>

