chipKIT32/chipKIT-core/pic32/cores/pic32/harmony/framework/peripheral/usb/plib_usb.h
  Remarks:
    Available on dsPIC33E/PIC24E, PIC24F, and PIC32. For PIC18 devices the address 
    is fixed at 0x400. The address of the Buffer Descriptor Table must be 
    512 byte-aligned.
    This feature may not be available on all devices. Please refer to the specific 
	device data sheet to determine availability or use PLIB_USB_ExistsBDTBaseAddress in your 
	application to determine whether this feature is available.		
*/

void PLIB_USB_BDTBaseAddressSet ( USB_MODULE_ID index, void* address );


// *****************************************************************************
/* Function:
    uint8_t  PLIB_USB_BufferIndexGet ( USB_MODULE_ID index,
                                       USB_PING_PONG_MODE ppMode,
                                       uint8_t epValue,
                                       USB_BUFFER_DIRECTION bufferDirection,
                                       USB_BUFFER_PING_PONG  bufferPingPong )

  Summary:
    Gets the Buffer Descriptor Table index for a buffer.

  Description:
    This function gets the Buffer Descriptor Table index for a buffer.

  Precondition:
    None.

  Parameters:
    index    - Dummy argument, identifier for the device instance of interest
    ppMode   - Ping-Pong buffering mode
    epValue  - Endpoint value, 0 <= epValue <= Module Maximum Endpoint
    bufferDirection - USB_BUFFER_RX or USB_BUFFER_TX
    bufferPingPong - USB_BUFFER_EVEN or USB_BUFFER_ODD

  Returns:
    Buffer index into the Buffer Descriptor Table.

  Example:
  <code>
  </code>

  Remarks:
    This feature may not be available on all devices. Please refer to the specific 
	device data sheet to determine availability or use PLIB_USB_ExistsBDTFunctions in your 
	application to determine whether this feature is available.	
*/

uint8_t  PLIB_USB_BufferIndexGet ( USB_MODULE_ID index,
                                   USB_PING_PONG_MODE ppMode,
                                   uint8_t epValue,
                                   USB_BUFFER_DIRECTION bufferDirection,
                                   USB_BUFFER_PING_PONG  bufferPingPong );


// *****************************************************************************
/* Function:
    void * PLIB_USB_BufferAddressGet ( USB_MODULE_ID index,
                                       void * pBDT,
                                       USB_PING_PONG_MODE ppMode,
                                       uint8_t epValue,
                                       USB_BUFFER_DIRECTION bufferDirection,
                                       USB_BUFFER_PING_PONG  bufferPingPong )

  Summary:
    Gets the memory address of an endpoint buffer.

  Description:
    This function gets the memory address of an endpoint buffer.

  Precondition:
    None.

  Parameters:
    index    - Dummy argument, identifier for the device instance of interest
    pBDT     - Pointer to start of Buffer Descriptor Table
    ppMode   - Ping-Pong buffering mode
    epValue  - Endpoint Value, 0 <= epValue <= Module Maximum Endpoint
    bufferDirection - USB_BUFFER_RX or USB_BUFFER_TX
    bufferPingPong - USB_BUFFER_EVEN or USB_BUFFER_ODD

  Returns:
    Buffer address in memory.

  Example:
  <code>
  </code>

  Remarks:
    This feature may not be available on all devices. Please refer to the specific 
	device data sheet to determine availability or use PLIB_USB_ExistsBDTFunctions in your 
	application to determine whether this feature is available.	
*/

void* PLIB_USB_BufferAddressGet ( USB_MODULE_ID index,
                                  void* pBDT,
                                  USB_PING_PONG_MODE ppMode,
                                  uint8_t epValue,
                                  USB_BUFFER_DIRECTION bufferDirection,
                                  USB_BUFFER_PING_PONG  bufferPingPong );


// *****************************************************************************
/* Function:
    void PLIB_USB_BufferAddressSet ( USB_MODULE_ID index,
                                     void * pBDT,
                                     USB_PING_PONG_MODE ppMode,
                                     uint8_t epValue,
                                     USB_BUFFER_DIRECTION bufferDirection,
                                     USB_BUFFER_PING_PONG  bufferPingPong,
                                     void * bufferAddress )
  Summary:
    Sets the endpoint buffer address.

  Description:
    This function sets the endpoint buffer address.

  Precondition:
    None.

  Parameters:
    index    - Dummy argument, identifier for the device instance of interest
    pBDT     - Pointer to start of Buffer Descriptor Table
    ppMode   - Ping-Pong buffering mode
    epValue  - Endpoint value, 0 <= epValue <= Module Maximum Endpoint
    bufferDirection - USB_BUFFER_RX or USB_BUFFER_TX
    bufferPingPong - USB_BUFFER_EVEN or USB_BUFFER_ODD
    bufferAddress - address in memory of endpoint transmit or receive buffer

  Returns:
    None.

  Example:
  <code>
  </code>

  Remarks:
    This feature may not be available on all devices. Please refer to the specific 
	device data sheet to determine availability or use PLIB_USB_ExistsBDTFunctions in your 
	application to determine whether this feature is available.	
*/

void PLIB_USB_BufferAddressSet ( USB_MODULE_ID index,
                                 void* pBDT,
                                 USB_PING_PONG_MODE ppMode,
                                 uint8_t epValue,
                                 USB_BUFFER_DIRECTION bufferDirection,
                                 USB_BUFFER_PING_PONG  bufferPingPong,
                                 void* bufferAddress );


// *****************************************************************************
/* Function:
    uint16_t PLIB_USB_BufferByteCountGet ( USB_MODULE_ID index,
                                           void * pBDT,
                                           USB_PING_PONG_MODE ppMode,
                                           uint8_t epValue,
                                           USB_BUFFER_DIRECTION bufferDirection,
                                           USB_BUFFER_PING_PONG  bufferPingPong )

  Summary:
    Returns the endpoint buffer byte count.

  Description:
    This function returns the endpoint buffer byte count, the actual number of 
    bytes transmitted or received.

  Precondition:
    None.

  Parameters:
    index    - Dummy argument, identifier for the device instance of interest
    pBDT     - Pointer to start of Buffer Descriptor Table
    ppMode   - Ping-Pong buffering mode
    epValue  - Endpoint value, 0 <= epValue <= Module Maximum Endpoint
    bufferDirection - USB_BUFFER_RX or USB_BUFFER_TX
    bufferPingPong - USB_BUFFER_EVEN or USB_BUFFER_ODD

  Returns:
    Endpoint buffer byte count.

  Example:
  <code>
  </code>

