chipKIT32/chipKIT-core/pic32/cores/pic32/harmony/framework/peripheral/usb/plib_usb.h
  Remarks:
    This feature may not be available on all devices. Please refer to the specific 
	device data sheet to determine availability or use PLIB_USB_ExistsBDTFunctions in your 
	application to determine whether this feature is available.	
*/

uint16_t PLIB_USB_BufferByteCountGet ( USB_MODULE_ID index,
                                       void* pBDT,
                                       USB_PING_PONG_MODE ppMode,
                                       uint8_t epValue,
                                       USB_BUFFER_DIRECTION bufferDirection,
                                       USB_BUFFER_PING_PONG  bufferPingPong );


// *****************************************************************************
/* Function:
    PLIB_USB_BufferByteCountSet ( USB_MODULE_ID index,
                                  void * pBDT,
                                  USB_PING_PONG_MODE ppMode,
                                  uint8_t epValue,
                                  USB_BUFFER_DIRECTION bufferDirection,
                                  USB_BUFFER_PING_PONG  bufferPingPong,
                                  uint16_t bufferByteCount )

  Summary:
    Sets the buffer byte count.

  Description:
    This function sets the number of bytes to be transmitted or the maximum number 
    of bytes to be received.

  Precondition:
    None.

  Parameters:
    index    - Dummy argument, identifier for the device instance of interest
    pBDT     - Pointer to start of Buffer Descriptor Table
    ppMode   - Ping-Pong buffering mode
    epValue  - Endpoint value, 0 <= epValue <= Module Maximum Endpoint
    bufferDirection - USB_BUFFER_RX or USB_BUFFER_TX
    bufferPingPong - USB_BUFFER_EVEN or USB_BUFFER_ODD
    bufferByteCount - number of bytes to be transmitted or the maximum number of bytes to be received

  Returns:
    None.

  Example:
  <code>
  </code>

  Remarks:
    This feature may not be available on all devices. Please refer to the specific 
	device data sheet to determine availability or use PLIB_USB_ExistsBDTFunctions in your 
	application to determine whether this feature is available.	
*/

void     PLIB_USB_BufferByteCountSet ( USB_MODULE_ID index,
                                       void* pBDT,
                                       USB_PING_PONG_MODE ppMode,
                                       uint8_t epValue,
                                       USB_BUFFER_DIRECTION bufferDirection,
                                       USB_BUFFER_PING_PONG  bufferPingPong,
                                       uint16_t bufferByteCount );

// *****************************************************************************
/* Function:
    USB_BUFFER_DATA01
        PLIB_USB_BufferDataToggleGet ( USB_MODULE_ID index,
                                       void * pBDT,
                                       USB_PING_PONG_MODE ppMode,
                                       uint8_t epValue,
                                       USB_BUFFER_DIRECTION bufferDirection,
                                       USB_BUFFER_PING_PONG  bufferPingPong )

  Summary:
    Returns data synchronization (DATA0 or DATA1) for the endpoint buffer.

  Description:
    This function returns data synchronization (DATA0 or DATA1) for the endpoint 
    buffer.

  Precondition:
    None.

  Parameters:
    index    - Dummy argument, identifier for the device instance of interest
    pBDT     - Pointer to start of Buffer Descriptor Table
    ppMode   - Ping-Pong buffering mode
    epValue  - Endpoint value, 0 <= epValue <= Module Maximum Endpoint
    bufferDirection - USB_BUFFER_RX or USB_BUFFER_TX
    bufferPingPong - USB_BUFFER_EVEN or USB_BUFFER_ODD

  Returns:
    Data Toggle value, USB_BUFFER_DATA0 or USB_BUFFER_DATA1, for the buffer

  Example:
  <code>
  </code>

  Remarks:
    This feature may not be available on all devices. Please refer to the specific 
	device data sheet to determine availability or use PLIB_USB_ExistsBDTFunctions in your 
	application to determine whether this feature is available.	
*/

USB_BUFFER_DATA01 PLIB_USB_BufferDataToggleGet ( USB_MODULE_ID index,
                                                 void* pBDT,
                                                 USB_PING_PONG_MODE ppMode,
                                                 uint8_t epValue,
                                                 USB_BUFFER_DIRECTION bufferDirection,
                                                 USB_BUFFER_PING_PONG  bufferPingPong );


// *****************************************************************************
/* Function:
    void PLIB_USB_BufferDataToggleSelect ( USB_MODULE_ID index,
                                           void * pBDT,
                                           USB_PING_PONG_MODE ppMode,
                                           uint8_t epValue,
                                           USB_BUFFER_DIRECTION bufferDirection,
                                           USB_BUFFER_PING_PONG  bufferPingPong,
                                           USB_BUFFER_DATA01 bufferData01 )

  Summary:
    Sets the endpoint buffer to DATA0 or DATA1.

  Description:
    This function sets the endpoint buffer to DATA0 or DATA1.

  Precondition:
    None.

  Parameters:
    index    - Dummy argument, identifier for the device instance of interest
    pBDT     - Pointer to start of Buffer Descriptor Table
    ppMode   - Ping-Pong buffering mode
    epValue  - Endpoint value, 0 <= epValue <= Module Maximum Endpoint
    bufferDirection - USB_BUFFER_RX or USB_BUFFER_TX
    bufferPingPong - USB_BUFFER_EVEN or USB_BUFFER_ODD
    bufferData01  - USB_BUFFER_DATA0 or USB_BUFFER_DATA1

  Returns:
    None.

  Example:
  <code>
  </code>

  Remarks:
    See PLIB_USB_BufferDataToggleGet to determine the received data toggle setting.
    This feature may not be available on all devices. Please refer to the specific 
	device data sheet to determine availability or use PLIB_USB_ExistsBDTFunctions in your 
	application to determine whether this feature is available.		
*/

