chipKIT32/chipKIT-core/pic32/cores/pic32/harmony/framework/peripheral/usb/plib_usb.h
void PLIB_USB_BufferDataToggleSelect ( USB_MODULE_ID index,
                                       void* pBDT,
                                       USB_PING_PONG_MODE ppMode,
                                       uint8_t epValue,
                                       USB_BUFFER_DIRECTION bufferDirection,
                                       USB_BUFFER_PING_PONG  bufferPingPong,
                                       USB_BUFFER_DATA01 bufferData01 );


// *****************************************************************************
/* Function:
    void PLIB_USB_BufferDataToggleSyncDisable ( USB_MODULE_ID index,
                                                void * pBDT,
                                                USB_PING_PONG_MODE ppMode,
                                                uint8_t epValue,
                                                USB_BUFFER_DIRECTION bufferDirection,
                                                USB_BUFFER_PING_PONG  bufferPingPong )

  Summary:
    Disables DATA0/DATA1 synchronization between the device and host.

  Description:
    This function disables DATA0/DATA1 synchronization between the device and host.

  Precondition:
    None.

  Parameters:
    index    - Dummy argument, identifier for the device instance of interest
    pBDT     - Pointer to start of Buffer Descriptor Table
    ppMode   - Ping-Pong buffering mode
    epValue  - Endpoint value, 0 <= epValue <= Module Maximum Endpoint
    bufferDirection - USB_BUFFER_RX or USB_BUFFER_TX
    bufferPingPong - USB_BUFFER_EVEN or USB_BUFFER_ODD

  Returns:
    None.

  Example:
  <code>
  </code>

  Remarks:
    This feature may not be available on all devices. Please refer to the specific 
	device data sheet to determine availability or use PLIB_USB_ExistsBDTFunctions in your 
	application to determine whether this feature is available.	
*/

void PLIB_USB_BufferDataToggleSyncDisable ( USB_MODULE_ID index,
                                            void* pBDT,
                                            USB_PING_PONG_MODE ppMode,
                                            uint8_t epValue,
                                            USB_BUFFER_DIRECTION bufferDirection,
                                            USB_BUFFER_PING_PONG  bufferPingPong );


// *****************************************************************************
/* Function:
    void PLIB_USB_BufferDataToggleSyncEnable  ( USB_MODULE_ID index,
                                                void * pBDT,
                                                USB_PING_PONG_MODE ppMode,
                                                uint8_t epValue,
                                                USB_BUFFER_DIRECTION bufferDirection,
                                                USB_BUFFER_PING_PONG  bufferPingPong )

  Summary:
    Enables DATA0/DATA1 synchronization between the device and host.

  Description:
    This function enables DATA0/DATA1 synchronization between the device and host.

  Precondition:
    None.

  Parameters:
    index    - Dummy argument, identifier for the device instance of interest
    pBDT     - Pointer to start of Buffer Descriptor Table
    ppMode   - Ping-Pong buffering mode
    epValue  - Endpoint value, 0 <= epValue <= Module Maximum Endpoint
    bufferDirection - USB_BUFFER_RX or USB_BUFFER_TX
    bufferPingPong - USB_BUFFER_EVEN or USB_BUFFER_ODD

  Returns:
    None.

  Example:
  <code>
  </code>

  Remarks:
    This feature may not be available on all devices. Please refer to the specific 
	device data sheet to determine availability or use PLIB_USB_ExistsBDTFunctions in your 
	application to determine whether this feature is available.	
*/

void PLIB_USB_BufferDataToggleSyncEnable  ( USB_MODULE_ID index,
                                            void* pBDT,
                                            USB_PING_PONG_MODE ppMode,
                                            uint8_t epValue,
                                            USB_BUFFER_DIRECTION bufferDirection,
                                            USB_BUFFER_PING_PONG  bufferPingPong );


// *****************************************************************************
/* Function:
    uint8_t PLIB_USB_BufferPIDGet ( USB_MODULE_ID index,
                                    void * pBDT,
                                    USB_PING_PONG_MODE ppMode,
                                    uint8_t epValue,
                                    USB_BUFFER_DIRECTION bufferDirection,
                                    USB_BUFFER_PING_PONG  bufferPingPong )

  Summary:
    Returns the token packet ID (PID) from the endpoint buffer status.

  Description:
    This function returns the token packet ID (PID) from the endpoint buffer status.

  Precondition:
    None.

  Parameters:
    index    - Dummy argument, identifier for the device instance of interest
    pBDT     - Pointer to start of Buffer Descriptor Table
    ppMode   - Ping-Pong buffering mode
    epValue  - Endpoint value, 0 <= epValue <= Module Maximum Endpoint
    bufferDirection - USB_BUFFER_RX or USB_BUFFER_TX
    bufferPingPong - USB_BUFFER_EVEN or USB_BUFFER_ODD

  Returns:
    Endpoint buffer packet ID (PID).

  Example:
  <code>
  </code>

  Remarks:
    There is no equivalent "Set" routine, since this field is read-only in the
    buffer status register within the Buffer Descriptor Table.  It is set
    when the buffer has been transmitted or received by the USB module and the
    usbOwnsBuffer field has been cleared by the USB module, releasing the buffer
    for software access.
    This feature may not be available on all devices. Please refer to the specific 
	device data sheet to determine availability or use PLIB_USB_ExistsBDTFunctions in your 
	application to determine whether this feature is available.		
*/

