chipKIT32/chipKIT-core/pic32/cores/pic32/harmony/framework/peripheral/usb/plib_usb.h
uint8_t PLIB_USB_BufferPIDGet ( USB_MODULE_ID index,
                                void* pBDT,
                                USB_PING_PONG_MODE ppMode,
                                uint8_t epValue,
                                USB_BUFFER_DIRECTION bufferDirection,
                                USB_BUFFER_PING_PONG  bufferPingPong );


// *****************************************************************************
/* Function:
    bool PLIB_USB_BufferReleasedToSW ( USB_MODULE_ID index,
                                       void * pBDT,
                                       USB_PING_PONG_MODE ppMode,
                                       uint8_t epValue,
                                       USB_BUFFER_DIRECTION bufferDirection,
                                       USB_BUFFER_PING_PONG  bufferPingPong )

  Summary:
    Returns the boolean flag value of 'true' when the buffer has been released by 
    the USB module.

  Description:
    This function returns the boolean flag value of 'true' when the buffer has 
    been released by the USB module.

  Precondition:
    None.

  Parameters:
    index    - Dummy argument, identifier for the device instance of interest
    pBDT     - Pointer to start of Buffer Descriptor Table
    ppMode   - Ping-Pong buffering mode
    epValue  - Endpoint value, 0 <= epValue <= Module Maximum Endpoint
    bufferDirection - USB_BUFFER_RX or USB_BUFFER_TX
    bufferPingPong - USB_BUFFER_EVEN or USB_BUFFER_ODD

  Returns:
    - true  - The buffer has been released by hardware
    - false - The buffer is still controlled by hardware

  Example:
  <code>
  </code>

  Remarks:
    This feature may not be available on all devices. Please refer to the specific 
	device data sheet to determine availability or use PLIB_USB_ExistsBDTFunctions in your 
	application to determine whether this feature is available.	
*/

bool PLIB_USB_BufferReleasedToSW ( USB_MODULE_ID index,
                                   void* pBDT,
                                   USB_PING_PONG_MODE ppMode,
                                   uint8_t epValue,
                                   USB_BUFFER_DIRECTION bufferDirection,
                                   USB_BUFFER_PING_PONG  bufferPingPong );


// *****************************************************************************
/* Function:
    void PLIB_USB_BufferReleaseToUSB ( USB_MODULE_ID index,
                                       void * pBDT,
                                       USB_PING_PONG_MODE ppMode,
                                       uint8_t epValue,
                                       USB_BUFFER_DIRECTION bufferDirection,
                                       USB_BUFFER_PING_PONG  bufferPingPong )

  Summary:
    Releases the endpoint buffer by software, allowing the USB module access to 
    the buffer.

  Description:
    This function releases the endpoint buffer by software, allowing the USB module 
    access to buffer.

  Precondition:
    None.

  Parameters:
    index    - Dummy argument, identifier for the device instance of interest
    pBDT     - Pointer to start of Buffer Descriptor Table
    ppMode   - Ping-Pong buffering mode
    epValue  - Endpoint value, 0 <= epValue <= Module Maximum Endpoint
    bufferDirection - USB_BUFFER_RX or USB_BUFFER_TX
    bufferPingPong - USB_BUFFER_EVEN or USB_BUFFER_ODD

  Returns:
    None.

  Example:
  <code>
  </code>

  Remarks:
    This feature may not be available on all devices. Please refer to the specific 
	device data sheet to determine availability or use PLIB_USB_ExistsBDTFunctions in your 
	application to determine whether this feature is available.	
*/

void PLIB_USB_BufferReleaseToUSB ( USB_MODULE_ID index,
                                   void* pBDT,
                                   USB_PING_PONG_MODE ppMode,
                                   uint8_t epValue,
                                   USB_BUFFER_DIRECTION bufferDirection,
                                   USB_BUFFER_PING_PONG  bufferPingPong );


// *****************************************************************************
/* Function:
  void PLIB_USB_BufferCancelReleaseToUSB ( USB_MODULE_ID index,
                                           void * pBDT,
                                           USB_PING_PONG_MODE ppMode,
                                           uint8_t epValue,
                                           USB_BUFFER_DIRECTION bufferDirection,
                                           USB_BUFFER_PING_PONG  bufferPingPong )

  Summary:
    Cancels release of the endpoint buffer by software, allowing software to again 
    access the buffer.

  Description:
    This function cancels the release of the endpoint buffer by software, allowing 
    software to again access the buffer.

  Precondition:
    None.

  Parameters:
    index    - Dummy argument, identifier for the device instance of interest
    pBDT     - Pointer to start of Buffer Descriptor Table
    ppMode   - Ping-Pong buffering mode
    epValue  - Endpoint value, 0 <= epValue <= Module Maximum Endpoint
    bufferDirection - USB_BUFFER_RX or USB_BUFFER_TX
    bufferPingPong - USB_BUFFER_EVEN or USB_BUFFER_ODD

  Returns:
    None.

  Example:
  <code>
  </code>

  Remarks:
    This feature may not be available on all devices. Please refer to the specific 
	device data sheet to determine availability or use PLIB_USB_ExistsBDTFunctions in your 
	application to determine whether this feature is available.	
*/

void PLIB_USB_BufferCancelReleaseToUSB ( USB_MODULE_ID index,
                                         void* pBDT,
                                         USB_PING_PONG_MODE ppMode,
                                         uint8_t epValue,
                                         USB_BUFFER_DIRECTION bufferDirection,
                                         USB_BUFFER_PING_PONG  bufferPingPong );


