chipKIT32/chipKIT-core/pic32/cores/pic32/harmony/framework/peripheral/usb/plib_usb.h
//******************************************************************************
/* Function :
    void PLIB_USB_BufferSchedule( USB_MODULE_ID  index ,
                                  void*  pBDT ,
                                  USB_PING_PONG_MODE  ppMode ,
                                  uint8_t  epValue ,
                                  USB_BUFFER_DIRECTION  bufferDirection ,
                                  USB_BUFFER_PING_PONG  bufferPingPong ,
                                  void *  bufferAddress ,
                                  int16_t  bufferByteCount ,
                                  USB_BUFFER_SCHEDULE_DATA01 bufferData01 )

  Summary:
    Hands over a buffer to the USB module along with the buffer address and byte count.

  Description:
    This function sets the endpoint descriptor buffer address, sets the send/receive
    byte count, and then hands over the buffer to the USB module.

  Preconditions:
    None.

  Parameters:
    index    - Dummy argument, identifier for the device instance of interest
    pBDT     - Pointer to start of Buffer Descriptor Table
    ppMode   - Ping-Pong buffering mode
    epValue  - Endpoint value, 0 <= epValue <= Module Maximum Endpoint
    bufferDirection - USB_BUFFER_RX or USB_BUFFER_TX
    bufferPingPong  - USB_BUFFER_EVEN or USB_BUFFER_ODD
    bufferAddress   - Address of the application buffer
    bufferByteCount - Send or expected receive byte count
    bufferData01    - USB_BUFFER_SET_DATA0, USB_BUFFER_SET_DATA1, or USB_BUFFER_DONTCHANGE
                      (The last choice leaves the existing DATA0/1 value of the buffer alone.)

  Returns:
    None.

  Remarks:
    This function does the work of three other functions:
        PLIB_USB_BufferAddressSet,
        PLIB_USB_BufferByteCountSet,
        PLIB_USB_BufferReleaseToUSB
		
    This feature may not be available on all devices. Please refer to the specific 
	device data sheet to determine availability or use PLIB_USB_ExistsBDTFunctions in your 
	application to determine whether this feature is available.			

*/

void PLIB_USB_BufferSchedule( USB_MODULE_ID  index ,
                              void*  pBDT ,
                              USB_PING_PONG_MODE  ppMode ,
                              uint8_t  epValue ,
                              USB_BUFFER_DIRECTION  bufferDirection ,
                              USB_BUFFER_PING_PONG  bufferPingPong ,
                              void *  bufferAddress,
                              int16_t  bufferByteCount ,
                              USB_BUFFER_SCHEDULE_DATA01 bufferData01 );


// *****************************************************************************
/* Function:
    void PLIB_USB_BufferStallDisable ( USB_MODULE_ID index,
                                       void * pBDT,
                                       USB_PING_PONG_MODE ppMode,
                                       uint8_t epValue,
                                       USB_BUFFER_DIRECTION bufferDirection,
                                       USB_BUFFER_PING_PONG  bufferPingPong )

  Summary:
    Disables STALL handshaking for the associated endpoint buffer.

  Description:
    This function disables STALL handshaking for the associated endpoint buffer.

  Precondition:
    The associated buffer must have been released by the USB module (i.e., 
    PLIB_USB_BufferReleasedToSW returns 'true').

  Parameters:
    index    - Dummy argument, identifier for the device instance of interest
    pBDT     - Pointer to start of Buffer Descriptor Table
    ppMode   - Ping-Pong buffering mode
    epValue  - Endpoint value, 0 <= epValue <= Module Maximum Endpoint
    bufferDirection - USB_BUFFER_RX or USB_BUFFER_TX
    bufferPingPong - USB_BUFFER_EVEN or USB_BUFFER_ODD

  Returns:
    None.

  Example:
  <code>
  </code>

  Remarks:
    Release of a STALL handshake for the buffer is done by hardware when the 
    host sends a SETUP token to the associated endpoint or resets the USB module
    This feature may not be available on all devices. Please refer to the specific 
	device data sheet to determine availability or use PLIB_USB_ExistsBDTFunctions in your 
	application to determine whether this feature is available.		.
*/

void PLIB_USB_BufferStallDisable ( USB_MODULE_ID index,
                                   void* pBDT,
                                   USB_PING_PONG_MODE ppMode,
                                   uint8_t epValue,
                                   USB_BUFFER_DIRECTION bufferDirection,
                                   USB_BUFFER_PING_PONG  bufferPingPong );


// *****************************************************************************
/* Function:
    void PLIB_USB_BufferStallEnable  ( USB_MODULE_ID index,
                                       void * pBDT,
                                       USB_PING_PONG_MODE ppMode,
                                       uint8_t epValue,
                                       USB_BUFFER_DIRECTION bufferDirection,
                                       USB_BUFFER_PING_PONG  bufferPingPong )

  Summary:
    Enables STALL handshaking for the associated endpoint buffer.

  Description:
    This function enables STALL handshaking for the associated endpoint buffer.

  Precondition:
    The associated buffer must have been released by the USB module (i.e. 
    PLIB_USB_BufferReleasedToSW returns 'true').

  Parameters:
    index    - Dummy argument, identifier for the device instance of interest
    pBDT     - Pointer to start of Buffer Descriptor Table
    ppMode   - Ping-Pong buffering mode
    epValue  - Endpoint value, 0 <= epValue <= Module Maximum Endpoint
    bufferDirection - USB_BUFFER_RX or USB_BUFFER_TX
    bufferPingPong - USB_BUFFER_EVEN or USB_BUFFER_ODD

  Returns:
    None.

  Example:
  <code>
  </code>

  Remarks:
    Release of a STALL handshake for the buffer is done by hardware when the host
    sends a SETUP token to the associated endpoint or resets the USB module.
    This feature may not be available on all devices. Please refer to the specific 
	device data sheet to determine availability or use PLIB_USB_ExistsBDTFunctions in your 
	application to determine whether this feature is available.		
*/

void PLIB_USB_BufferStallEnable  ( USB_MODULE_ID index,
                                   void* pBDT,
                                   USB_PING_PONG_MODE ppMode,
                                   uint8_t epValue,
                                   USB_BUFFER_DIRECTION bufferDirection,
                                   USB_BUFFER_PING_PONG  bufferPingPong );


// *****************************************************************************
/* Function:
    bool PLIB_USB_BufferStallGet ( USB_MODULE_ID index,
                                   void * pBDT,
                                   USB_PING_PONG_MODE ppMode,
                                   uint8_t epValue,
                                   USB_BUFFER_DIRECTION bufferDirection,
                                   USB_BUFFER_PING_PONG  bufferPingPong )

  Summary:
    Returns the buffer stall status for an endpoint/direction/ping-pong.

  Description:
    This function returns the buffer stall status for an endpoint/direction/ping-pong.

  Precondition:
    the associated buffer must have been released by the USB module (i.e., 
    PLIB_USB_BufferReleasedToSW returns 'true').

  Parameters:
    index    - Dummy argument, identifier for the device instance of interest
    pBDT     - Pointer to start of Buffer Descriptor Table
    ppMode   - Ping-Pong buffering mode
    epValue  - Endpoint value, 0 <= epValue <= Module Maximum Endpoint
    bufferDirection - USB_BUFFER_RX or USB_BUFFER_TX
    bufferPingPong - USB_BUFFER_EVEN or USB_BUFFER_ODD

  Returns:
    - true  - Buffer stall is enabled
    - false - Buffer stall is not enabled

  Example:
  <code>
  </code>

