chipKIT32/chipKIT-core/pic32/cores/pic32/harmony/framework/peripheral/usb/plib_usb.h
  Remarks:
    This feature may not be available on all devices. Please refer to the specific 
	device data sheet to determine availability or use PLIB_USB_ExistsBDTFunctions in your 
	application to determine whether this feature is available.	
*/

bool  PLIB_USB_BufferStallGet ( USB_MODULE_ID index,
                                void* pBDT,
                                USB_PING_PONG_MODE ppMode,
                                uint8_t epValue,
                                USB_BUFFER_DIRECTION bufferDirection,
                                USB_BUFFER_PING_PONG  bufferPingPong );


// *****************************************************************************
/* Function:
    void PLIB_USB_BufferPIDBitsClear ( USB_MODULE_ID index,
                                       void * pBDT,
                                       USB_PING_PONG_MODE ppMode,
                                       uint8_t epValue,
                                       USB_BUFFER_DIRECTION bufferDirection,
                                       USB_BUFFER_PING_PONG  bufferPingPong )

  Summary:
    Clears the Buffer Status bits in the Buffer Descriptor Table.

  Description:
    This function clears the Buffer Status bits in the Buffer Descriptor Table.

  Precondition:
    The associated buffer must have been released by the USB module (i.e., 
    PLIB_USB_BufferReleasedToSW returns 'true'.

  Parameters:
    index    - Dummy argument, identifier for the device instance of interest
    pBDT     - Pointer to start of Buffer Descriptor Table
    ppMode   - Ping-Pong buffering mode
    epValue  - Endpoint value, 0 <= epValue <= Module Maximum Endpoint
    bufferDirection - USB_BUFFER_RX or USB_BUFFER_TX
    bufferPingPong - USB_BUFFER_EVEN or USB_BUFFER_ODD

  Returns:
    None.

  Example:
  <code>
  </code>

  Remarks:
    Call PLIB_USB_BufferPIDBitsClear before setting buffer control bits.
    This is equivalent to:
        PLIB_USB_BufferCancelReleaseToUSB(...)
        PLIB_USB_BufferDataToggleSelect( ...,USB_BUFFER_DATA0)
        PLIB_USB_BufferDataToggleSyncDisable(...)
        PLIB_USB_BufferStallDisable(...)
    This feature may not be available on all devices. Please refer to the specific 
	device data sheet to determine availability or use PLIB_USB_ExistsBDTFunctions in your 
	application to determine whether this feature is available.			
*/

void PLIB_USB_BufferPIDBitsClear ( USB_MODULE_ID index,
                                   void* pBDT,
                                   USB_PING_PONG_MODE ppMode,
                                   uint8_t epValue,
                                   USB_BUFFER_DIRECTION bufferDirection,
                                   USB_BUFFER_PING_PONG  bufferPingPong );


// *****************************************************************************
/* Function:
    void PLIB_USB_BufferClearAll( USB_MODULE_ID index,
                                  void * pBDT,
                                  USB_PING_PONG_MODE ppMode,
                                  uint8_t epValue,
                                  USB_BUFFER_DIRECTION bufferDirection,
                                  USB_BUFFER_PING_PONG  bufferPingPong )

  Summary:
    Clears (zeros out) entries in the Buffer Descriptor Table.

  Description:
    This function clears (zeros out) the entries in the Buffer Descriptor Table.

  Precondition:
    None.

  Parameters:
    index    - Dummy argument, identifier for the device instance of interest
    pBDT     - Pointer to start of Buffer Descriptor Table
    ppMode   - Ping-Pong buffering mode
    epValue  - Endpoint value, 0 <= epValue <= Module Maximum Endpoint
    bufferDirection - USB_BUFFER_RX or USB_BUFFER_TX
    bufferPingPong - USB_BUFFER_EVEN or USB_BUFFER_ODD

  Returns:
    None.

  Example:
  <code>
  </code>
  Remarks:
    This feature may not be available on all devices. Please refer to the specific 
	device data sheet to determine availability or use PLIB_USB_ExistsBDTFunctions in your 
	application to determine whether this feature is available.	  
*/
void PLIB_USB_BufferClearAll( USB_MODULE_ID index,
                              void * pBDT,
                              USB_PING_PONG_MODE ppMode,
                              uint8_t epValue,
                              USB_BUFFER_DIRECTION bufferDirection,
                              USB_BUFFER_PING_PONG  bufferPingPong );


// *****************************************************************************
// *****************************************************************************
// Section: USB Peripheral Library Interface Functions: Endpoints
// *****************************************************************************
// *****************************************************************************

// *****************************************************************************
/* Function:
    void PLIB_USB_EP0LSDirectConnectDisable ( USB_MODULE_ID index )

  Summary:
    Disables direct connection to a low-speed device for Endpoint 0.

  Description:
    This function disables direct connection to a low-speed device for Endpoint 0.

  Precondition:
    The USB module must be in Host mode.

  Parameters:
    index          - Identifier for the device instance of interest

  Returns:
    None.

  Example:
  <code>
    PLIB_USB_EP0LSDirectConnectDisable(MY_USB_INSTANCE);
  </code>

  Remarks:
    Host mode and U1EP0 only. Not applicable for PIC18 devices, since USB Host 
    functionality is not available on PIC18 devices.
    This feature may not be available on all devices. Please refer to the specific 
	device data sheet to determine availability or use PLIB_USB_ExistsEP0LowSpeedConnect in your 
	application to determine whether this feature is available.		
*/

void PLIB_USB_EP0LSDirectConnectDisable ( USB_MODULE_ID index );


// *****************************************************************************
/* Function:
    void PLIB_USB_EP0LSDirectConnectEnable ( USB_MODULE_ID index )

  Summary:
     Enables direct connection to a low-speed device for Endpoint 0.

  Description:
     This function enables direct connection to a low-speed device for Endpoint 0.

  Precondition:
    USB module must be in Host mode.

  Parameters:
    index          - Identifier for the device instance of interest

  Returns:
    None.

  Example:
  <code>
    PLIB_USB_EP0LSDirectConnectEnable(MY_USB_INSTANCE);
  </code>

