chipKIT32/chipKIT-core/pic32/cores/pic32/harmony/framework/peripheral/usb/plib_usb.h
  Remarks:
    Host Mode and U1EP0 only. Not applicable for PIC18 devices, since USB Host 
    functionality is not available on PIC18 devices.
    This feature may not be available on all devices. Please refer to the specific 
	device data sheet to determine availability or use PLIB_USB_ExistsEP0LowSpeedConnect in your 
	application to determine whether this feature is available.		
*/

void PLIB_USB_EP0LSDirectConnectEnable ( USB_MODULE_ID index );


// *****************************************************************************
/*  Function:
    void PLIB_USB_EP0NakRetryDisable ( USB_MODULE_ID index )

  Summary:
    Disables retrying of NAKed transactions.

  Description:
    This function disables retrying of NAKed transactions.

  Precondition:
    The USB module must be in Host or OTG modes.

  Parameters:
    index          - Identifier for the device instance of interest

  Returns:
    None.

  Example:
  <code>
    PLIB_USB_EP0NakRetryDisable(MY_USB_INSTANCE);
  </code>

  Remarks:
    Host/OTG only. Not applicable for PIC18 devices, since USB Host and OTG
    functionality is not available on PIC18 devices.
    This feature may not be available on all devices. Please refer to the specific 
	device data sheet to determine availability or use PLIB_USB_ExistsEP0NAKRetry in your 
	application to determine whether this feature is available.		
*/

void PLIB_USB_EP0NakRetryDisable ( USB_MODULE_ID index );


// *****************************************************************************
/* Function:
    void PLIB_USB_EP0NakRetryEnable ( USB_MODULE_ID index )

  Summary:
    Enables retrying NAK'd transactions for Endpoint 0.

  Description:
    This function enables retrying NAK'd transactions for Endpoint 0.

  Precondition:
    The USB module must be in Host or OTG modes.

  Parameters:
    index          - Identifier for the device instance of interest

  Returns:
    None.

  Example:
  <code>
    PLIB_USB_EP0NakRetryEnable(MY_USB_INSTANCE);
  </code>

  Remarks:
    Host/OTG only. Not applicable for PIC18 devices, since USB Host or OTG 
    functionality is not available on PIC18 devices.
    This feature may not be available on all devices. Please refer to the specific 
	device data sheet to determine availability or use PLIB_USB_ExistsEP0NAKRetry in your 
	application to determine whether this feature is available.		
*/

void PLIB_USB_EP0NakRetryEnable ( USB_MODULE_ID index );


// *****************************************************************************
/* Function:
    void PLIB_USB_EPnControlTransferDisable ( USB_MODULE_ID index, uint8_t epValue )

  Summary:
    Disables endpoint control transfers.

  Description:
    This function disables endpoint control transfers when endpoint transmit and 
    endpoint receive are both enabled.

  Precondition:
    None.

  Parameters:
    index          - Identifier for the device instance of interest
    epValue        - Endpoint value, 0 <= epValue <= Module Maximum Endpoint

  Returns:
    None.

  Example:
  <code>
    PLIB_USB_EPnControlTransferDisable(MY_USB_INSTANCE, someEP);
  </code>

  Remarks:
    This feature may not be available on all devices. Please refer to the specific 
	device data sheet to determine availability or use PLIB_USB_ExistsEPnRxEnable in your 
	application to determine whether this feature is available.	
*/

void PLIB_USB_EPnControlTransferDisable ( USB_MODULE_ID index, uint8_t epValue );

// *****************************************************************************
/* Function:
    void PLIB_USB_EPnAttributesSet ( USB_MODULE_ID index, 
            uint8_t epValue, int direction, bool isControl, bool handshake)

  Summary:
    Configures attributes of the endpoint such as direction, handshake capability
    and direction.

  Description:
    Configures attributes of the endpoint such as direction, handshake capability
    and direction. If the isControl flag is true, then the direction and handshake
    parameters are ignored and the endpoint is configured for control transfers. 

  Precondition:
    None.

  Parameters:
    index          - Identifier for the device instance of interest
    epValue        - Endpoint value, 0 <= epValue <= Module Maximum Endpoint
    direction      - Endpoint direction, if 1 then RX and if 0 then TX.
    isControl      - If true endpoint is configured for control transfers.
    handshake      - If true, then handshake is enabled on the endpoint else
                     it is disabled.

  Returns:
    None.

  Example:
  <code>
    // This enables endpoint 0 for control transfers. 
    PLIB_USB_EPnAttributesSet(MY_USB_INSTANCE, 0, 0, true, true);
    // This enables endpoint 2 for non control transfer, direction
    // is RX and handshake enable. 
    PLIB_USB_EPnAttributesSet(MY_USB_INSTANCE, 2, 1, false, true);
  </code>

  Remarks:
    None.
*/

void PLIB_USB_EPnAttributesSet ( USB_MODULE_ID index, 
        uint8_t epValue, int direction, bool isControl, bool handshake);

// *****************************************************************************
/* Function:
    void PLIB_USB_EPnAttributesClear ( USB_MODULE_ID index, uint8_t epValue)

  Summary:
    Clears the set attributes of the specified endpoint.

  Description:
    Clears the set attributes of the specified endpoint. The endpoint transmit
    receive, handshake and setup packet handling capability is disabled.

  Precondition:
    None.

  Parameters:
    index          - Identifier for the device instance of interest
    epValue        - Endpoint value, 0 <= epValue <= Module Maximum Endpoint

  Returns:
    None.

  Example:
  <code>
    // This clears up the endpoint 0 attributes and thus disables
    // the endpoints
    PLIB_USB_EPnAttributesClear(MY_USB_INSTANCE, 0);
  </code>

  Remarks:
    None.
*/

void PLIB_USB_EPnAttributesClear ( USB_MODULE_ID index, uint8_t epValue);

// *****************************************************************************
/* Function:
    void PLIB_USB_EPnDirectionDisable ( USB_MODULE_ID index, 
                                            uint8_t epValue, int direction)

  Summary:
    Disables the specified endpoint direction.

  Description:
    Disables the specified endpoint direction.

  Precondition:
    None.

  Parameters:
    index          - Identifier for the device instance of interest
    epValue        - Endpoint value, 0 <= epValue <= Module Maximum Endpoint
    direction      - If 1, then TX direction is disabled. If 0 RX direction is
                     disabled.

  Returns:
    None.

  Example:
  <code>
    // This function disables the TX direction of endpoint 1
    PLIB_USB_EPnDirectionDisable(MY_USB_INSTANCE, 1, 1);
  </code>

