chipKIT32/chipKIT-core/pic32/cores/pic32/harmony/framework/peripheral/usb/plib_usb.h
  Remarks:
    None.
*/

void PLIB_USB_EPnDirectionDisable ( USB_MODULE_ID index, 
                                uint8_t epValue, int direction);

// *****************************************************************************
/* Function:
    void PLIB_USB_EPnControlTransferEnable ( USB_MODULE_ID index, uint8_t epValue )

  Summary:
    Enables endpoint control transfers.

  Description:
    This function enables endpoint control transfers when endpoint transmit and 
    endpoint receive are both enabled.

  Precondition:
    None.

  Parameters:
    index          - Identifier for the device instance of interest
    epValue        - Endpoint value, 0 <= epValue <= Module Maximum Endpoint

  Returns:
    None.

  Example:
  <code>
    PLIB_USB_EPnControlTransferEnable(MY_USB_INSTANCE, someEP);
  </code>

  Remarks:
    This feature may not be available on all devices. Please refer to the specific 
	device data sheet to determine availability or use PLIB_USB_ExistsEPnRxEnable in your 
	application to determine whether this feature is available.	
*/

void PLIB_USB_EPnControlTransferEnable ( USB_MODULE_ID index, uint8_t epValue );


// *****************************************************************************
/* Function:
    void PLIB_USB_EPnHandshakeDisable ( USB_MODULE_ID index, uint8_t epValue )

  Summary:
    Disables endpoint handshaking.

  Description:
    This function disables endpoint handshaking.  Typically used for Isochronous endpoints.

  Precondition:
    None.

  Parameters:
    index          - Identifier for the device instance of interest
    epValue        - Endpoint value, 0 <= epValue <= Module Maximum Endpoint

  Returns:
    None.

  Example:
  <code>
    PLIB_USB_EPnHandshakeDisable(MY_USB_INSTANCE, someEP);
  </code>

  Remarks:
    This feature may not be available on all devices. Please refer to the specific 
	device data sheet to determine availability or use PLIB_USB_ExistsEPnRxEnable in your 
	application to determine whether this feature is available.	
*/

void PLIB_USB_EPnHandshakeDisable ( USB_MODULE_ID index, uint8_t epValue );


// *****************************************************************************
/* Function:
    void PLIB_USB_EPnHandshakeEnable ( USB_MODULE_ID index, uint8_t epValue )

  Summary:
    Enables endpoint handshaking.

  Description:
    This function enables endpoint handshaking.

  Precondition:
    None.

  Parameters:
    index          - Identifier for the device instance of interest
    epValue        - Endpoint value, 0 <= epValue <= Module Maximum Endpoint

  Returns:
    None.

  Example:
  <code>
    PLIB_USB_EPnHandshakeEnable(MY_USB_INSTANCE, someEP);
  </code>

  Remarks:
    This feature may not be available on all devices. Please refer to the specific 
	device data sheet to determine availability or use PLIB_USB_ExistsEPnRxEnable in your 
	application to determine whether this feature is available.	
*/

void PLIB_USB_EPnHandshakeEnable ( USB_MODULE_ID index, uint8_t epValue );

// *****************************************************************************
/* Function:
    bool PLIB_USB_EPnIsStalled ( USB_MODULE_ID index, uint8_t epValue  )

  Summary:
    Tests whether the endpoint epValue is stalled.

  Description:
    This function tests whether the endpoint epValue is stalled.

  Precondition:
    None.

  Parameters:
    index          - Identifier for the device instance of interest
    epValue        - Endpoint value, 0 <= epValue <= Module Maximum Endpoint

  Returns:
    - true  - The endpoint is stalled
    - false - The endpoint is not stalled

  Example:
  <code>
    if( PLIB_USB_EPnIsStalled(MY_USB_INSTANCE, someEP) )
    {
        // Handle the stall
    }
  </code>

  Remarks:
    Not valid before an endpoint is enabled.
    This feature may not be available on all devices. Please refer to the specific 
	device data sheet to determine availability or use PLIB_USB_ExistsEPnRxEnable in your 
	application to determine whether this feature is available.		
*/

bool PLIB_USB_EPnIsStalled ( USB_MODULE_ID index, uint8_t epValue );


// *****************************************************************************
/* Function:
    void PLIB_USB_EPnStallClear ( USB_MODULE_ID index, uint8_t epValue )

  Summary:
    Clears an endpoint's stalled flag.

  Description:
    This function clears an endpoint's stalled flag.

  Precondition:
    None.

  Parameters:
    index          - Identifier for the device instance of interest
    epValue        - Endpoint value, 0 <= epValue <= Module Maximum Endpoint

  Returns:
    None.

  Example:
  <code>
    if( PLIB_USB_EPnIsStalled(MY_USB_INSTANCE, someEP) )
    {
        // Handle the stall
        PLIB_USB_EPnStallClear(MY_USB_INSTANCE, someEP);
    }
  </code>

  Remarks:
    Not valid before an endpoint is enabled.
    This feature may not be available on all devices. Please refer to the specific 
	device data sheet to determine availability or use PLIB_USB_ExistsEPnRxEnable in your 
	application to determine whether this feature is available.		
*/

void PLIB_USB_EPnStallClear ( USB_MODULE_ID index, uint8_t epValue  );


// *****************************************************************************
/* Function:
    void PLIB_USB_EPnRxSelect ( USB_MODULE_ID index, uint8_t epValue, USB_EP_TXRX epTxRx )

  Summary:
    Selects receive capabilities of an endpoint.

  Description:
    This function selects receive capabilities of an endpoint.

  Precondition:
    None.

  Parameters:
    index   - Identifier for the device instance of interest
    epValue - Endpoint value, 0 <= epValue <= Module Maximum Endpoint
    epTxRx  - Transmit/Receive setting for endpoint: USB_EP_RX, USB_EP_NOTXRX

  Returns:
    None.

  Example:
  <code>
    PLIB_USB_EPnRxSelect(MY_USB_INSTANCE, someEP, USB_EP_RX);
  </code>

