chipKIT32/chipKIT-core/pic32/cores/pic32/harmony/framework/peripheral/usb/plib_usb.h
  Remarks:
    This feature may not be available on all devices. Please refer to the specific 
	device data sheet to determine availability or use PLIB_USB_ExistsEPnRxEnable in your 
	application to determine whether this feature is available.	
*/

void PLIB_USB_EPnRxSelect ( USB_MODULE_ID index, uint8_t epValue, USB_EP_TXRX epTxRx );


// *****************************************************************************
/* Function:
    void PLIB_USB_EPnTxSelect ( USB_MODULE_ID index, uint8_t epValue, USB_EP_TXRX epTxRx )

  Summary:
    Selects transmit capabilities of an endpoint.

  Description:
    This function selects transmit capabilities of an endpoint.

  Precondition:
    None.

  Parameters:
    index   - Identifier for the device instance of interest
    epValue - Endpoint value, 0 <= epValue <= Module Maximum Endpoint
    epTxRx  - Transmit/Receive setting for endpoint: USB_EP_TX, USB_EP_NOTXRX

  Returns:
    None.

  Example:
  <code>
    PLIB_USB_EPnTxSelect(MY_USB_INSTANCE, someEP, USB_EP_TX);
  </code>

  Remarks:
    This feature may not be available on all devices. Please refer to the specific 
	device data sheet to determine availability or use PLIB_USB_ExistsEPnRxEnable in your 
	application to determine whether this feature is available.	
*/

void PLIB_USB_EPnTxSelect ( USB_MODULE_ID index, uint8_t epValue, USB_EP_TXRX epTxRx );


// *****************************************************************************
/* Function:
    void PLIB_USB_EPnTxRxSelect ( USB_MODULE_ID index, uint8_t epValue, USB_EP_TXRX epTxRx )

  Summary:
    Selects transmit and/or receive capabilities of an endpoint.

  Description:
    This function selects transmit and/or receive capabilities of an endpoint.

  Precondition:
    None.

  Parameters:
    index   - Identifier for the device instance of interest
    epValue - Endpoint value, 0 <= epValue <= Module Maximum Endpoint
    epTxRx  - Transmit/Receive setting for endpoint: USB_EP_TX, USB_EP_RX, USB_EP_TX_RX, USB_EP_NOTXRX

  Returns:
    None.

  Example:
  <code>
    PLIB_USB_EPnTxRxSelect(MY_USB_INSTANCE, someEP, USB_EP_TXRX);
  </code>

  Remarks:
    This feature may not be available on all devices. Please refer to the specific 
	device data sheet to determine availability or use PLIB_USB_ExistsEPnRxEnable in your 
	application to determine whether this feature is available.	
*/

void PLIB_USB_EPnTxRxSelect ( USB_MODULE_ID index, uint8_t epValue, USB_EP_TXRX epTxRx );


// *****************************************************************************
// *****************************************************************************
// Section: USB Peripheral Library Interface Functions: Interrupts
// *****************************************************************************
// *****************************************************************************

// *****************************************************************************
/* Function:
    void PLIB_USB_InterruptDisable( USB_MODULE_ID index, USB_INTERRUPTS interruptFlag )

  Summary:
    Disables a general interrupt for the USB module.

  Description:
    This function disables a general interrupt source for the USB module.

  Precondition:
    None.

  Parameters:
    index     - Identifier for the device instance of interest
    interruptFlag - Interrupt

  Returns:
    None.

  Example:
  <code>
    PLIB_USB_InterruptDisable( MY_USB_INSTANCE, USB_INT_ERROR );
  </code>

  Remarks:
    This feature may not be available on all devices. Please refer to the specific 
	device data sheet to determine availability or use PLIB_USB_ExistsGEN_Interrupt in your 
	application to determine whether this feature is available.	
*/

void PLIB_USB_InterruptDisable( USB_MODULE_ID index, USB_INTERRUPTS interruptFlag );


// *****************************************************************************
/* Function:
    void PLIB_USB_InterruptEnable( USB_MODULE_ID index, USB_INTERRUPTS interruptFlag )

  Summary:
    Enables a general interrupt for the USB module.

  Description:
    This function enables general interrupt sources of the USB module to trigger 
    a USB interrupt.

  Precondition:
    None.

  Parameters:
    index     - Identifier for the device instance of interest
    interruptFlag - Interrupt

  Returns:
    None.

  Example:
  <code>
    PLIB_USB_InterruptEnable( MY_USB_INSTANCE, USB_INT_ERROR );
  </code>

  Remarks:
    This feature may not be available on all devices. Please refer to the specific 
	device data sheet to determine availability or use PLIB_USB_ExistsGEN_Interrupt in your 
	application to determine whether this feature is available.	
*/

void PLIB_USB_InterruptEnable( USB_MODULE_ID index, USB_INTERRUPTS interruptFlag );

// *****************************************************************************
/* Function:
    USB_INTERRUPTS PLIB_USB_InterruptEnableGet( USB_MODULE_ID index)

  Summary:
    Returns the enable/disable status of general USB module interrupts

  Description:
    Returns the enable/disable status of general USB module interrupts

  Precondition:
    None.

  Parameters:
    index     - Identifier for the device instance of interest

  Returns:
    A bit map containing status of enabled interrupts.

  Example:
  <code>
    USB_INTERRUPTS enabledInterrupts;
    enabledInterrupts = PLIB_USB_InterruptEnableGet( MY_USB_INSTANCE);
    if(enabledInterrupts|USB_INT_ATTACH)
    {
        // This means Attach interrupt is enabled.
    }

  </code>

  Remarks:
    This feature may not be available on all devices. Please refer to the specific 
	device data sheet to determine availability or use PLIB_USB_ExistsGEN_Interrupt in your 
	application to determine whether this feature is available.	
*/
USB_INTERRUPTS PLIB_USB_InterruptEnableGet(USB_MODULE_ID index);

// *****************************************************************************
/* Function:
    void PLIB_USB_TokenSend(USB_MODULE_ID index, USB_PID pidValue, 
            uint8_t endpoint, uint8_t deviceAddress, bool isLowSpeed);

  Summary:
    Sends token to the specified address.

  Description:
    This function sends the specified token to the specified endpoint and
    address. The token is placed on the bus at the next available time. The
    token can be executed at low speed. 

  Precondition:
    None.

  Parameters:
    index       - Identifier for the device instance of interest
    pidValue    - PID of the token to be placed on the bus.
    endpoint    - Device endpoint to which the token should be sent.
    isLowSpeed  - Is true if the token should be executed at low speed. 

  Returns:
    None.

  Example:
  <code>
    // Send an OUT token to endpoint 1 device address 2 at full speed
    PLIB_USB_SendToken(MY_USB_INSTANCE, USB_PID_OUT, 1, 2, false);

  </code>

