chipKIT32/chipKIT-core/pic32/cores/pic32/harmony/framework/peripheral/usb/plib_usb.h
  Remarks:
    This feature may not be available on all devices. Please refer to the specific 
	device data sheet to determine availability or use PLIB_USB_ExistsGEN_Interrupt in your 
	application to determine whether this feature is available.	
*/
void PLIB_USB_TokenSend(USB_MODULE_ID index, USB_PID pidValue, uint8_t endpoint, uint8_t deviceAddress, bool isLowSpeed);

// *****************************************************************************
/* Function:
    void PLIB_USB_EP0HostSetup(USB_MODULE_ID index);

  Summary:
    Sends token to the specified address.

  Description:
    This function configures endpoint 0 for typical host operation. Control transfers
    are enable. Transmit and Receive is enabled. Handshaking is enabled. Low Speed
    connection is disabled. NAK retry is disabled.

  Precondition:
    None.

  Parameters:
    index       - Identifier for the device instance of interest

  Returns:
    None.

  Example:
  <code>
    // Configure endpoint 0 for host operation

    PLBIB_USB_EP0HostSetup(USB_MODULE_ID index);

  </code>

  Remarks:
    This feature may not be available on all devices. Please refer to the specific 
	device data sheet to determine availability or use PLIB_USB_ExistsGEN_Interrupt in your 
	application to determine whether this feature is available.	
*/
void PLIB_USB_EP0HostSetup(USB_MODULE_ID index);

// *****************************************************************************
/* Function:
    void PLIB_USB_InterruptFlagClear( USB_MODULE_ID index, USB_INTERRUPTS interruptFlag )

  Summary:
    Clears a general interrupt flag for the USB module.

  Description:
    This function clears a general interrupt source flag for the USB module.

  Precondition:
    None.

  Parameters:
    index     - Identifier for the device instance of interest
    interruptFlag - Interrupt

  Returns:
    None.

  Example:
  <code>
    PLIB_USB_InterruptFlagClear( MY_USB_INSTANCE, USB_INT_ERROR );
  </code>

  Remarks:
    This feature may not be available on all devices. Please refer to the specific 
	device data sheet to determine availability or use PLIB_USB_ExistsGEN_InterruptStatus in your 
	application to determine whether this feature is available.	
*/

void PLIB_USB_InterruptFlagClear( USB_MODULE_ID index, USB_INTERRUPTS interruptFlag );


// *****************************************************************************
/* Function:
    bool PLIB_USB_InterruptFlagGet( USB_MODULE_ID index, USB_INTERRUPTS interruptFlag )

  Summary:
    Tests a general interrupt flag for the USB module.

  Description:
    This function tests a general interrupt source flag for the USB module.

  Precondition:
    None.

  Parameters:
    index     - Identifier for the device instance of interest
    interruptFlag - Interrupt

  Returns:
    None.

  Example:
  <code>
    if ( PLIB_USB_InterruptFlagGet(MY_USB_INSTANCE,USB_INT_ANY) )
        if ( PLIB_USB_InterruptFlagGet(MY_USB_INSTANCE,USB_INT_ERROR) )
        {
            PLIB_USB_InterruptFlagClear(MY_USB_INSTANCE,USB_INT_ERROR);
            // Error clean up
        }
        if ( PLIB_USB_InterruptFlagGet(MY_USB_INSTANCE,USB_INT_HOST_DETACH) )
        {
            PLIB_USB_InterruptFlagClear(MY_USB_INSTANCE,USB_INT_HOST_DETACH);
            // Device detached clean up
        }
        .
        .
        .
    }
  </code>

  Remarks:
    This feature may not be available on all devices. Please refer to the specific 
	device data sheet to determine availability or use PLIB_USB_ExistsGEN_InterruptStatus in your 
	application to determine whether this feature is available.	
*/

bool PLIB_USB_InterruptFlagGet( USB_MODULE_ID index, USB_INTERRUPTS interruptFlag );


// *****************************************************************************
/* Function:
    void PLIB_USB_InterruptFlagSet( USB_MODULE_ID index, USB_INTERRUPTS interruptFlag )

  Summary:
    Sets a general interrupt flag for the USB module.

  Description:
    This function sets a general interrupt source flag for the USB module.

  Precondition:
    None.

  Parameters:
    index     - Identifier for the device instance of interest
    interruptFlag - Interrupt

  Returns:
    None.

  Example:
  <code>
    PLIB_USB_InterruptFlagSet( MY_USB_INSTANCE, USB_INT_ERROR );
  </code>

  Remarks:
    This feature may not be available on all devices. Please refer to the specific 
	device data sheet to determine availability or use PLIB_USB_ExistsGEN_InterruptStatus in your 
	application to determine whether this feature is available.	
*/

void PLIB_USB_InterruptFlagSet( USB_MODULE_ID index, USB_INTERRUPTS interruptFlag );


// *****************************************************************************
/* Function:
    bool PLIB_USB_InterruptIsEnabled( USB_MODULE_ID index, USB_INTERRUPTS interruptFlag )

  Summary:
    Returns true if interrupts are enabled.

  Description:
    This function returns true if interrupts are enabled.

  Precondition:
    None.

  Parameters:
    index     - Identifier for the device instance of interest
    interruptFlag - Interrupt

  Returns:
    - true  - Interrupts are enabled
    - false - Interrupts are not enabled

  Example:
  <code>
    if ( PLIB_USB_InterruptIsEnabled( MY_USB_INSTANCE, USB_INT_ERROR ) )
    {

    }
  </code>

  Remarks:
    This feature may not be available on all devices. Please refer to the specific 
	device data sheet to determine availability or use PLIB_USB_ExistsGEN_Interrupt in your 
	application to determine whether this feature is available.	
*/

bool PLIB_USB_InterruptIsEnabled( USB_MODULE_ID index, USB_INTERRUPTS interruptFlag );


// *****************************************************************************
// *****************************************************************************
// Section: USB Peripheral Library Interface Functions: Error Interrupts
// *****************************************************************************
// *****************************************************************************

// *****************************************************************************
/* Function:
    void PLIB_USB_ErrorInterruptDisable( USB_MODULE_ID index, USB_ERROR_INTERRUPTS interruptFlag )

  Summary:
    Disables an error interrupt for the USB module.

  Description:
    This function disables an error interrupt source for the USB module.

  Precondition:
    None.

  Parameters:
    index     - Identifier for the device instance of interest
    interruptFlag - Interrupt

  Returns:
    None.

  Example:
  <code>
    PLIB_USB_ErrorInterruptDisable( MY_USB_INSTANCE, USB_ERR_INT_BAD_CRC16 );
  </code>

