chipKIT32/chipKIT-core/pic32/cores/pic32/harmony/framework/peripheral/usb/plib_usb.h
  Remarks:
    This feature may not be available on all devices. Please refer to the specific 
	device data sheet to determine availability or use PLIB_USB_ExistsERR_Interrupt in your 
	application to determine whether this feature is available.	
*/

void PLIB_USB_ErrorInterruptDisable( USB_MODULE_ID index, USB_ERROR_INTERRUPTS   interruptFlag );


// *****************************************************************************
/* Function:
    void PLIB_USB_ErrorInterruptEnable( USB_MODULE_ID index, USB_ERROR_INTERRUPTS interruptFlag )

  Summary:
    Enables an error interrupt for the USB module.

  Description:
    This function enables error interrupt sources of the USB module to trigger 
    a USB interrupt.

  Precondition:
    None.

  Parameters:
    index     - Identifier for the device instance of interest
    interruptFlag - Interrupt

  Returns:
    None.

  Example:
  <code>
    PLIB_USB_ErrorInterruptEnable( MY_USB_INSTANCE, USB_ERR_INT_BAD_CRC16 );
  </code>

  Remarks:
    This feature may not be available on all devices. Please refer to the specific 
	device data sheet to determine availability or use PLIB_USB_ExistsERR_Interrupt in your 
	application to determine whether this feature is available.	
*/

void PLIB_USB_ErrorInterruptEnable( USB_MODULE_ID index, USB_ERROR_INTERRUPTS   interruptFlag );


// *****************************************************************************
/* Function:
    void PLIB_USB_ErrorInterruptFlagClear( USB_MODULE_ID index, USB_ERROR_INTERRUPTS interruptFlag )

  Summary:
    Clears an error interrupt flag for the USB module.

  Description:
    This function clears an error interrupt source flag for the USB module.

  Precondition:
    None.

  Parameters:
    index     - Identifier for the device instance of interest
    interruptFlag - Interrupt

  Returns:
    None.

  Example:
  <code>
    PLIB_USB_ErrorInterruptFlagClear( MY_USB_INSTANCE, USB_ERR_INT_BAD_CRC16 );
  </code>

  Remarks:
    None.
*/

void PLIB_USB_ErrorInterruptFlagClear( USB_MODULE_ID index, USB_ERROR_INTERRUPTS   interruptFlag );


// *****************************************************************************
/* Function:
    bool PLIB_USB_ErrorInterruptFlagGet( USB_MODULE_ID index, USB_ERROR_INTERRUPTS interruptFlag )

  Summary:
    Tests an error interrupt flag for the USB module.

  Description:
    This function tests an error interrupt source flag for the USB module.

  Precondition:
    None.

  Parameters:
    index     - Identifier for the device instance of interest
    interruptFlag - Interrupt

  Returns:
    None.

  Example:
  <code>
    if ( PLIB_USB_ErrorInterruptFlagGet(MY_USB_INSTANCE,USB_ERR_INT_ANY) )
        if ( PLIB_USB_ErrorInterruptFlagGet(MY_USB_INSTANCE,USB_ERR_INT_PID_CHECK_FAILURE) )
        {
            PLIB_USB_ErrorInterruptFlagClear(MY_USB_INSTANCE,USB_ERR_INT_PID_CHECK_FAILURE);
            // PID Error Check failure cleanup
        }
        if ( PLIB_USB_ErrorInterruptFlagGet(MY_USB_INSTANCE,USB_ERR_INT_DEVICE_EOF_ERROR) )
        {
            PLIB_USB_ErrorInterruptFlagClear(MY_USB_INSTANCE,USB_ERR_INT_DEVICE_EOF_ERROR);
            // EOF error cleanup
        }
        .
        .
        .
    }
  </code>

  Remarks:
    This feature may not be available on all devices. Please refer to the specific 
	device data sheet to determine availability or use PLIB_USB_ExistsERR_InterruptStatus in your 
	application to determine whether this feature is available.	
*/

bool PLIB_USB_ErrorInterruptFlagGet( USB_MODULE_ID index, USB_ERROR_INTERRUPTS   interruptFlag );


// *****************************************************************************
/* Function:
    void PLIB_USB_ErrorInterruptFlagSet( USB_MODULE_ID index, USB_ERROR_INTERRUPTS interruptFlag )

  Summary:
    Sets an error interrupt flag for the USB module.

  Description:
    This function sets an error interrupt source flag for the USB module.

  Precondition:
    None.

  Parameters:
    index     - Identifier for the device instance of interest
    interruptFlag - Interrupt

  Returns:
    None.

  Example:
  <code>
    PLIB_USB_ErrorInterruptFlagSet( MY_USB_INSTANCE, USB_ERR_INT_BAD_CRC16 );
  </code>

  Remarks:
    This feature may not be available on all devices. Please refer to the specific 
	device data sheet to determine availability or use PLIB_USB_ExistsERR_InterruptStatus in your 
	application to determine whether this feature is available.	
*/

void PLIB_USB_ErrorInterruptFlagSet( USB_MODULE_ID index, USB_ERROR_INTERRUPTS   interruptFlag );


// *****************************************************************************
/* Function:
    bool PLIB_USB_ErrorInterruptIsEnabled( USB_MODULE_ID index, USB_INTERRUPTS interruptFlag )

  Summary:
    Returns true if interrupts are enabled.

  Description:
    This function determines whether interrupts are enabled.

  Precondition:
    None.

  Parameters:
    index     - Identifier for the device instance of interest
    interruptFlag - Interrupt

  Returns:
    - true  - Interrupts are enabled
    - false - Interrupts are not enabled

  Example:
  <code>
    if ( PLIB_USB_ErrorInterruptIsEnabled( MY_USB_INSTANCE, USB_ERR_INT_BAD_CRC16 ) )
    {

    }
  </code>

  Remarks:
    This feature may not be available on all devices. Please refer to the specific 
	device data sheet to determine availability or use PLIB_USB_ExistsERR_InterruptStatus in your 
	application to determine whether this feature is available.	
*/

bool PLIB_USB_ErrorInterruptIsEnabled( USB_MODULE_ID index, USB_INTERRUPTS interruptFlag );


// *****************************************************************************
// *****************************************************************************
// Section: USB Peripheral Library Interface Functions: Last Transaction Status
// *****************************************************************************
// *****************************************************************************

// *****************************************************************************
/* Function:
    USB_BUFFER_DIRECTION PLIB_USB_LastTransactionDirectionGet ( USB_MODULE_ID index )

  Summary:
    Indicates the direction of the last transaction.

  Description:
    This function indicates the direction of the last transaction, either transmit 
    or receive.

  Precondition:
    None.

  Parameters:
    index          - Identifier for the device instance of interest

  Returns:
    USB_LastDirection: USB_RECEIVE_TRANSFER or USB_TRANSMIT_TRANSFER

  Example:
    See PLIB_USB_LastTransactionEndPtGet.

