chipKIT32/chipKIT-core/pic32/cores/pic32/harmony/framework/peripheral/usb/plib_usb.h
  Remarks:
    None.
*/

USB_BUFFER_DIRECTION PLIB_USB_LastTransactionDirectionGet ( USB_MODULE_ID index );


// *****************************************************************************
/* Function:
    uint8_t PLIB_USB_LastTransactionEndPtGet ( USB_MODULE_ID index )

  Summary:
    Returns the endpoint number of the last USB transfer.

  Description:
    This function returns the endpoint number of the last USB transfer, which is 
    actually the index into the Buffer Descriptor Table of the last USB transfer.

  Precondition:
    None.

  Parameters:
    index          - Identifier for the device instance of interest

  Returns:
    endPoint - Endpoint of last completed USB transfer

  Example:
  <code>
    while ( !PLIB_USB_INT_FlagGet(MY_USB_INSTANCE,USB_INT_GEN,TOKEN_DONE) )
    {
        // Do nothing, wait until completion of next transaction
    }

    // Retrieve information relating to the last completed transaction
    endpoint  = PLIB_USB_LastTransactionEndPtGet(MY_USB_INSTANCE);
    direction = PLIB_USB_LastTransactionDirectionGet(MY_USB_INSTANCE);
    pingPongState = PLIB_USB_LastTransactionPingPongStateGet(MY_USB_INSTANCE);

    // Clearing the Token Processing Done flag advances the status FIFO to
    // oldest transaction in the FIFO.  Wait for completion of next transaction
    // before using PLIB_USB_Last*Get functions again to read status.
    PLIB_USB_INT_FlagClear(MY_USB_INSTANCE,USB_INT_GEN,TOKEN_DONE);
  </code>

  Remarks:
    This feature may not be available on all devices. Please refer to the specific 
	device data sheet to determine availability or use PLIB_USB_ExistsLastDirection in your 
	application to determine whether this feature is available.	
*/

uint8_t PLIB_USB_LastTransactionEndPtGet ( USB_MODULE_ID index );


// *****************************************************************************
/* Function:
    USB_PING_PONG_STATE PLIB_USB_LastTransactionPingPongStateGet ( USB_MODULE_ID index )

  Summary:
    Indicates whether the last transaction was to an EVEN buffer or an ODD buffer.

  Description:
    This function indicates whether the last transaction was to an Even buffer or 
    an Odd buffer.

  Precondition:
    None.

  Parameters:
    index          - Identifier for the device instance of interest

  Returns:
    USB_PING_PONG_STATE.

  Example:
    See PLIB_USB_LastTransactionEndPtGet.

  Remarks:
    Not valid if PIC18 or PIC24F endpoint does not have ping-pong buffering enabled.
    This feature may not be available on all devices. Please refer to the specific 
	device data sheet to determine availability or use PLIB_USB_ExistsLastPingPong in your 
	application to determine whether this feature is available.	
*/

USB_PING_PONG_STATE PLIB_USB_LastTransactionPingPongStateGet ( USB_MODULE_ID index );


// *****************************************************************************
// *****************************************************************************
// Section: USB Peripheral Library Interface Functions: Host
// *****************************************************************************
// *****************************************************************************

// *****************************************************************************
/* Function:
    bool PLIB_USB_IsBusyWithToken ( USB_MODULE_ID index )

  Summary:
    Indicates whether there is a token being executed by the USB module as Host.

  Description:
    This function indicates whether there is a token being executed by the USB module 
    as Host. Software should check that the previous token is finished before issuing 
    a new token.

  Precondition:
    USB module must be in Host mode.

  Parameters:
    index          - Identifier for the device instance of interest

  Returns:
    None.

  Example:
  <code>
    while( PLIB_USB_IsBusyWithToken(MY_USB_INSTANCE) )
    {
        // do nothing
    }
    // Issue new token
  </code>

  Remarks:
    Not applicable for PIC18 devices since PIC18 devices do not support Host mode.
    This feature may not be available on all devices. Please refer to the specific 
	device data sheet to determine availability or use PLIB_USB_ExistsHostBusyWithToken in your 
	application to determine whether this feature is available.		
*/

bool PLIB_USB_IsBusyWithToken ( USB_MODULE_ID index );


// *****************************************************************************
/* Function:
    void PLIB_USB_SOFDisable ( USB_MODULE_ID index )

  Summary:
    Disables the automatic generation of the SOF token.

  Description:
    This function disables the automatic generation of the SOF token.

  Precondition:
    USB module must be in Host mode.

  Parameters:
    index          - Identifier for the device instance of interest

  Returns:
    None.

  Example:
  <code>
    PLIB_USB_SOFDisable(MY_USB_INSTANCE);
  </code>

  Remarks:
    Not applicable for PIC18 devices since PIC18 devices do not support Host mode.
    This feature may not be available on all devices. Please refer to the specific 
	device data sheet to determine availability or use PLIB_USB_ExistsStartOfFrames in your 
	application to determine whether this feature is available.		
*/

void PLIB_USB_SOFDisable ( USB_MODULE_ID index );


// *****************************************************************************
/* Function:
    void PLIB_USB_SOFEnable ( USB_MODULE_ID index )

  Summary:
    Enables the automatic generation of the SOF token every 1 ms.

  Description:
    This function enables the automatic generation of the SOF token every 1 ms.

  Precondition:
    USB module must be in Host mode.

  Parameters:
    index          - Identifier for the device instance of interest

  Returns:
    None.

  Example:
  <code>
    PLIB_USB_SOFEnable(MY_USB_INSTANCE);
  </code>

