chipKIT32/chipKIT-core/pic32/cores/pic32/harmony/framework/peripheral/usb/plib_usb.h
  Remarks:
    Not applicable for PIC18 devices since PIC18 devices do not support Host mode.
    This feature may not be available on all devices. Please refer to the specific 
	device data sheet to determine availability or use PLIB_USB_ExistsStartOfFrames in your 
	application to determine whether this feature is available.		
*/

void PLIB_USB_SOFEnable ( USB_MODULE_ID index );


// *****************************************************************************
/* Function:
    uint8_t PLIB_USB_SOFThresholdGet ( USB_MODULE_ID index )

  Summary:
    Returns the Start-of-Frame (SOF) Count bits.

  Description:
    This function returns the Start-of-Frame (SOF) Count bits. (Value represents 
    10 + (packet size of n bytes);).

  Precondition:
    The USB module must be in Host mode.

  Parameters:
    index          - Identifier for the device instance of interest

  Returns:
    SOF threshold value.

  Example:
  <code>
    thresholdSOF = PLIB_USB_SOFThresholdGet(MY_USB_INSTANCE);
  </code>

  Remarks:
    Host mode only.
<pre><c>
    SOF Threshold Value = packet byte count + 10
                        = 0b0100_1010 = 0x4A = 74 for 64-byte packet
                        = 0b0010_1010 = 0x2A = 42 for 32-byte packet
                        = 0b0001_1010 = 0x1A = 26 for 16-byte packet
                        = 0x0001_0010 = 0x12 = 18 for  8-byte packet
 </c></pre>
    This feature may not be available on all devices. Please refer to the specific 
	device data sheet to determine availability or use PLIB_USB_ExistsSOFThreshold in your 
	application to determine whether this feature is available.	 
*/

uint8_t PLIB_USB_SOFThresholdGet ( USB_MODULE_ID index );


// *****************************************************************************
/* Function:
    void PLIB_USB_SOFThresholdSet ( USB_MODULE_ID index, uint8_t threshold )

  Summary:
    Sets the Start-of-Frame (SOF) threshold value.

  Description:
    This function sets the Start-of-Frame (SOF) threshold value.

  Precondition:
    The USB module must be in Host mode.

  Parameters:
    index          - Identifier for the device instance of interest
    threshold      - SOF threshold

  Returns:
    None.

  Example:
  <code>
    // Set SOF threshold for 64-byte packets
    PLIB_USB_SOFThresholdSet(MY_USB_INSTANCE,64+10);
  </code>

  Remarks:
    Host mode only.
<pre><c>
    SOF Threshold Value = packet byte count + 10
                        = 0b0100_1010 = 0x4A = 74 for 64-byte packet
                        = 0b0010_1010 = 0x2A = 42 for 32-byte packet
                        = 0b0001_1010 = 0x1A = 26 for 16-byte packet
                        = 0x0001_0010 = 0x12 = 18 for  8-byte packet
 </c></pre>
    This feature may not be available on all devices. Please refer to the specific 
	device data sheet to determine availability or use PLIB_USB_ExistsSOFThreshold in your 
	application to determine whether this feature is available.	 
*/

void PLIB_USB_SOFThresholdSet ( USB_MODULE_ID index, uint8_t threshold );


// *****************************************************************************
/* Function:
    uint8_t PLIB_USB_TokenEPGet ( USB_MODULE_ID index )

  Summary:
    Returns the specified Endpoint address.

  Description: 
    This function returns the address of the specified Endpoint.

  Precondition:
    The USB module must be in Host mode.

  Parameters:
    index          - Identifier for the device instance of interest

  Returns:
    Endpoint value - 0 <= epValue <= Module Maximum Endpoint.

  Example:
  <code>
    someEP = PLIB_USB_TokenEPGet(MY_USB_INSTANCE);
  </code>

  Remarks:
    Host mode only.
	
    This feature may not be available on all devices. Please refer to the specific 
	device data sheet to determine availability or use PLIB_USB_ExistsTokenEP in your 
	application to determine whether this feature is available.		
*/

uint8_t PLIB_USB_TokenEPGet ( USB_MODULE_ID index );


// *****************************************************************************
/* Function:
    void PLIB_USB_TokenEPSet ( USB_MODULE_ID index, uint8_t epValue )

  Summary:
    Sets the Endpoint address for a host transaction.

  Description:
    This function sets the Endpoint address for a host transaction.

  Precondition:
    The USB module must be in Host mode.

  Parameters:
    index          - Identifier for the device instance of interest
    epValue        - Endpoint value, 0 <= epValue <= Module Maximum Endpoint

  Returns:
    None.

  Example:
  <code>
    uint8_t someEP = 0x03;
    PLIB_USB_TokenEPSet(MY_USB_INSTANCE, someEP);
  </code>

  Remarks:
    Host mode only.
    This feature may not be available on all devices. Please refer to the specific 
	device data sheet to determine availability or use PLIB_USB_ExistsTokenEP in your 
	application to determine whether this feature is available.		
*/

void PLIB_USB_TokenEPSet ( USB_MODULE_ID index, uint8_t epValue );


// *****************************************************************************
/* Function:
    USB_PID PLIB_USB_TokenPIDGet ( USB_MODULE_ID index )

  Summary:
    Returns the token transaction type.

  Description:
    This function returns the token transaction type.

  Precondition:
    The USB module must be in Host mode.

  Parameters:
    index          - Identifier for the device instance of interest

  Returns:
    Packet ID of token, USB_PID_SETUP, USB_PID_IN, or USB_PID_OUT

  Example:
  <code>
    somePID = PLIB_USB_TokenPIDGet(MY_USB_INSTANCE);
  </code>

  Remarks:
    Host mode only.
    This feature may not be available on all devices. Please refer to the specific 
	device data sheet to determine availability or use PLIB_USB_ExistsTokenPID in your 
	application to determine whether this feature is available.		
*/

USB_PID PLIB_USB_TokenPIDGet ( USB_MODULE_ID index );


// *****************************************************************************
/* Function:
    void PLIB_USB_TokenPIDSet ( USB_MODULE_ID index, USB_PID pidValue)

  Summary:
    Sets the token transaction type to pidValue.

  Description:
    This function sets the token transaction type to pidValue.

  Precondition:
    The USB module must be in Host mode.

  Parameters:
    index          - Identifier for the device instance of interest
    pidValue       - USB_PID_SETUP, USB_PID_IN, or USB_PID_OUT

  Returns:
    None.

  Example:
  <code>
    somePID = USB_PID_SETUP;
    PLIB_USB_TokenPIDSet (MY_USB_INSTANCE, somePID );
  </code>

