chipKIT32/chipKIT-core/pic32/cores/pic32/harmony/framework/peripheral/usb/plib_usb.h
  Remarks:
    Host mode only.
    This feature may not be available on all devices. Please refer to the specific 
	device data sheet to determine availability or use PLIB_USB_ExistsTokenPID in your 
	application to determine whether this feature is available.		
*/

void PLIB_USB_TokenPIDSet ( USB_MODULE_ID index, USB_PID pidValue );


// *****************************************************************************
/* Function:
    void PLIB_USB_TokenSpeedSelect ( USB_MODULE_ID index, USB_TOKEN_SPEED tokenSpeed )

  Summary:
    Selects low speed or full speed for subsequent token executions.

  Description:
    This function selects low speed or full speed for subsequent token executions.

  Precondition:
    The USB module must be in Host mode.

  Parameters:
    index          - Identifier for the device instance of interest
    tokenSpeed     - Speed for next token execution: USB_LOWSPEED_TOKENS or USB_FULLSPEED_TOKENS

  Returns:
    None.

  Example:
  <code>
    PLIB_USB_TokenSpeedSet(MY_USB_INSTANCE,USB_LOWSPEED_TOKENS);
  </code>

  Remarks:
    Not applicable for PIC18 devices since PIC18 devices do not support Host mode.
    This feature may not be available on all devices. Please refer to the specific 
	device data sheet to determine availability or use PLIB_USB_ExistsNextTokenSpeed in your 
	application to determine whether this feature is available.		
*/

void PLIB_USB_TokenSpeedSelect ( USB_MODULE_ID index, USB_TOKEN_SPEED tokenSpeed );


// *****************************************************************************
// *****************************************************************************
// Section: USB Peripheral Library Interface Functions: Bus Signaling
// *****************************************************************************
// *****************************************************************************

// *****************************************************************************
/* Function:
    void PLIB_USB_ResetSignalDisable ( USB_MODULE_ID index )

  Summary:
    Disables reset signaling on the USB bus.

  Description:
    This function disables reset signaling on the USB bus.

  Precondition:
    The USB module must be in Host mode.

  Parameters:
    index          - Identifier for the device instance of interest

  Returns:
    None.

  Example:
    See PLIB_USB_ResetSignalEnable.

  Remarks:
    Not applicable for PIC18, since USB Host functionality is Not available on PIC18 devices.
    This feature may not be available on all devices. Please refer to the specific 
	device data sheet to determine availability or use PLIB_USB_ExistsHostGeneratesReset in your 
	application to determine whether this feature is available.		

*/

void PLIB_USB_ResetSignalDisable ( USB_MODULE_ID index );


// *****************************************************************************
/* Function:
    void PLIB_USB_ResetSignalEnable ( USB_MODULE_ID index )

  Summary:
    Enables reset signaling on the USB bus.

  Description:
    This function enables reset signaling on the USB bus.

  Precondition:
    The USB module must be in Host mode.

  Parameters:
    index          - Identifier for the device instance of interest

  Returns:
    None.

  Example:
  <code>
    // Snippet to perform a software reset:
    PLIB_USB_ResetSignalEnable(MY_USB_INSTANCE);
    // ... delay 50ms
    PLIB_USB_ResetSignalDisable(MY_USB_INSTANCE);
  </code>

  Remarks:
    Not applicable for PIC18, since USB Host functionality is Not available on PIC18 devices.
    This feature may not be available on all devices. Please refer to the specific 
	device data sheet to determine availability or use PLIB_USB_ExistsHostGeneratesReset in your 
	application to determine whether this feature is available.	
*/

void PLIB_USB_ResetSignalEnable ( USB_MODULE_ID index );


// *****************************************************************************
/* Function:
    void PLIB_USB_ResumeSignalingDisable ( USB_MODULE_ID index )

  Summary:
    Disables resume signaling.

  Description:
    This function disables resume signaling.

  Precondition:
    None.

  Parameters:
    index          - Identifier for the device instance of interest

  Returns:
    None.

  Example:
    See PLIB_USB_ResumeSignalingEnable.

  Remarks:
    This feature may not be available on all devices. Please refer to the specific 
	device data sheet to determine availability or use PLIB_USB_ExistsResumeSignaling in your 
	application to determine whether this feature is available.	
*/

void PLIB_USB_ResumeSignalingDisable ( USB_MODULE_ID index );


// *****************************************************************************
/* Function:
    void PLIB_USB_ResumeSignalingEnable ( USB_MODULE_ID index )

  Summary:
    Enables resume signaling.

  Description:
    This function enables resume signaling. Resume allows the peripheral to 
    perform a remote wake-up by executing resume signaling.

  Precondition:
    None.

  Parameters:
    index          - Identifier for the device instance of interest

  Returns:
    None.

  Example:
  <code>
    // Perform resume signaling:
    PLIB_USB_ResumeSignalingEnable(MY_USB_INSTANCE);
    // Delay 10ms
    PLIB_USB_ResumeSignalingDisable(MY_USB_INSTANCE);
  </code>

  Remarks:
    Software must enable resume signaling for 10 ms if the device is in Device mode,
    or for 25 ms if the device is in Host mode, and then disable resume signaling 
    to enable remote wake-up. In Host mode, the USB module will append a low-speed 
    EOP to the end resume signaling when it is disabled.
    This feature may not be available on all devices. Please refer to the specific 
	device data sheet to determine availability or use PLIB_USB_ExistsResumeSignaling in your 
	application to determine whether this feature is available.		
*/

void PLIB_USB_ResumeSignalingEnable ( USB_MODULE_ID index );


// *****************************************************************************
// *****************************************************************************
// Section: USB Peripheral Library Interface Functions: On-The-Go (OTG)
// *****************************************************************************
// *****************************************************************************

// *****************************************************************************
/* Function:
    bool PLIB_USB_OTG_BSessionHasEnded ( USB_MODULE_ID index )

  Summary:
    Returns the status of the B-Session End Indicator bit.

  Description:
    This function returns the status of the B-Session End Indicator bit.

  Precondition:
    The USB module must be in OTG mode.

  Parameters:
    index          - Identifier for the device instance of interest

  Returns:
    - true  - The VBUS Voltage is below VB_SESS_END on the B-device
    - false - The VBUS voltage is above VB_SESS_END on the B-device

  Example:
  <code>
    if ( !PLIB_USB_OTG_BSessionHasEnded(MY_USB_INSTANCE) )
    {
        // B session valid
    }
    else
    {
        // B session not valid
    }
  </code>

