chipKIT32/chipKIT-core/pic32/cores/pic32/harmony/framework/peripheral/usb/plib_usb.h
  Remarks:
    Not available on PIC18 devices.
    This feature may not be available on all devices. Please refer to the specific 
	device data sheet to determine availability or use PLIB_USB_ExistsOTG_BSessionEnd in your 
	application to determine whether this feature is available.		
*/

bool PLIB_USB_OTG_BSessionHasEnded ( USB_MODULE_ID index );


// *****************************************************************************
/* Function:
    bool PLIB_USB_OTG_IDPinStateIsTypeA ( USB_MODULE_ID index )

  Summary:
    Returns the ID Pin state.

  Description:
    This function returns ID Pin state.

  Precondition:
    The USB module must be in OTG mode.

  Parameters:
    index          - Identifier for the device instance of interest

  Returns:
    - true  - Type A Cable attached,
    - false - No cable is attached or a Type B cable is attached

  Example:
  <code>
    if ( PLIB_USB_OTG_IDPinStateIsTypeA(MY_USB_INSTANCE) )
    {
        // Type A cable attached
    }
    else
    {
        // No cable or Type B cable attached
    };
  </code>

  Remarks:
    Not available on PIC18 devices.
    This feature may not be available on all devices. Please refer to the specific 
	device data sheet to determine availability or use PLIB_USB_ExistsOTG_IDPinState in your 
	application to determine whether this feature is available.		
*/

bool PLIB_USB_OTG_IDPinStateIsTypeA ( USB_MODULE_ID index );


// *****************************************************************************
/* Function:
    bool PLIB_USB_OTG_LineStateIsStable ( USB_MODULE_ID index )

  Summary:
    Returns the status of the Line Stable Indicator bit.

  Description:
    This function returns the status of the Line Stable Indicator bit.

  Precondition:
    The USB module must be in OTG mode.

  Parameters:
    index          - Identifier for the device instance of interest

  Returns:
    - true  - The USB line state has been stable for the previous 1 ms
    - false - The USB line state has not been stable for the previous 1 ms

  Example:
  <code>
    if( PLIB_USB_OTG_LineStateIsStable(MY_USB_INSTANCE) ) {
        // Line has been stable
        // ... rest of code ...
    }
  </code>

  Remarks:
    Not available on PIC18 devices.
    This feature may not be available on all devices. Please refer to the specific 
	device data sheet to determine availability or use PLIB_USB_ExistsOTG_LineState in your 
	application to determine whether this feature is available.		
*/

bool PLIB_USB_OTG_LineStateIsStable ( USB_MODULE_ID index );


// *****************************************************************************
/* Function:
    void PLIB_USB_OTG_PullUpPullDownSetup( USB_MODULE_ID index,
                                           USB_OTG_PULL_UP_PULL_DOWN resistor,
                                           bool enableResistor )

  Summary:
    Enables or disables pull-up and pull-down resistors.

  Description:
    This function enables or disables pull-up and pull-down resistors.

  Precondition:
    USB On-The-Go (OTG) must be enabled.

  Parameters:
    index          - Identifier for the device instance of interest
    resistor       - USB_OTG_DPLUS_PULLUP,    USB_OTG_DMINUS_PULLUP,
                     USB_OTG_DPLUS_PULLDN, or USB_OTG_DMINUS_PULLDN
    enableResistor  - true to enable resistor, false to disable it

  Returns:
    None.

  Example:
  <code>
    // Enable pull-up resistor for D+
    PLIB_USB_OTG_PullUpPullDownSetup(MY_USB_INSTANCE,USB_OTG_DPLUS_PULLUP,true);
  </code>

  Remarks:
    Not available on PIC18 devices.
    This feature may not be available on all devices. Please refer to the specific 
	device data sheet to determine availability or use PLIB_USB_ExistsOTG_PullUpPullDown in your 
	application to determine whether this feature is available.		
*/

void PLIB_USB_OTG_PullUpPullDownSetup( USB_MODULE_ID index,
                                       USB_OTG_PULL_UP_PULL_DOWN resistor,
                                       bool enableResistor );


// *****************************************************************************
/* Function:
    bool PLIB_USB_OTG_SessionValid ( USB_MODULE_ID index )

  Summary:
    Returns the status of the Session Valid Indicator bit.

  Description:
    This function returns the status of the Session Valid Indicator bit.

  Precondition:
    The USB module must be in OTG mode.

  Parameters:
    index          - Identifier for the device instance of interest

  Returns:
    - true  - The VBUS voltage is above Session Valid on the A or B device
    - false - The VBUS voltage is below Session Valid on the A or B device

  Example:
  <code>
    if ( PLIB_USB_OTG_SessionValid(MY_USB_INSTANCE) )
    {
        // Session valid
    }
    else
    {
        // Session not valid
    }
  </code>

  Remarks:
    Not available on PIC18 devices.
    This feature may not be available on all devices. Please refer to the specific 
	device data sheet to determine availability or use PLIB_USB_ExistsOTG_SessionValid in your 
	application to determine whether this feature is available.		
*/

bool PLIB_USB_OTG_SessionValid ( USB_MODULE_ID index );


// *****************************************************************************
/* Function:
    void PLIB_USB_OTG_VBusChargeDisable ( USB_MODULE_ID index )

  Summary:
    Disables VBUS line charge.

  Description:
    This function disables VBUS line charge.

  Precondition:
    None.

  Parameters:
    index          - Identifier for the device instance of interest

  Returns:
    None.

  Example:
  <code>
    PLIB_USB_OTG_VBusChargeDisable(MY_USB_INSTANCE);
  </code>

  Remarks:
    Not available on PIC18 or PIC32 devices.
    This feature may not be available on all devices. Please refer to the specific 
	device data sheet to determine availability or use PLIB_USB_ExistsOTG_VbusCharge in your 
	application to determine whether this feature is available.		
*/

