chipKIT32/chipKIT-core/pic32/cores/pic32/harmony/framework/peripheral/usb/plib_usb.h
void PLIB_USB_OTG_VBusChargeDisable ( USB_MODULE_ID index );


// *****************************************************************************
/* Function:
    void PLIB_USB_OTG_VBusDischargeEnable ( USB_MODULE_ID index )

  Summary:
    Enables VBUS line to be discharged through a resistor.

  Description:
    This function enables the VBUS line to be discharged through a resistor.

  Precondition:
    None.

  Parameters:
    index          - Identifier for the device instance of interest

  Returns:
    None.

  Example:
  <code>
    PLIB_USB_OTG_VBusDischargeEnable(MY_USB_INSTANCE);
  </code>

  Remarks:
    Not available on PIC18 or PIC32 devices.  This feature may not be available
    on all devices. Please refer to the specific device data sheet to determine
    availability or use PLIB_USB_ExistsOTG_VbusCharge in your application to
    determine whether this feature is available.
*/

void PLIB_USB_OTG_VBusDischargeEnable ( USB_MODULE_ID index );


// *****************************************************************************
/* Function:
    void PLIB_USB_OTG_VBusChargeTo3V( USB_MODULE_ID index )

  Summary:
    Sets the VBUS line to charge to 3.3V.

  Description:
    This function sets the VBUS line to charge to 3.3V.

  Precondition:
    None.

  Parameters:
    index          - Identifier for the device instance of interest

  Returns:
    None.

  Example:
  <code>
    PLIB_USB_OTG_VBusChargeTo3V(MY_USB_INSTANCE);
  </code>

  Remarks:
    Not available on PIC18 or PIC32 devices.
*/

void PLIB_USB_OTG_VBusChargeTo3V( USB_MODULE_ID index );


// *****************************************************************************
/* Function:
    void PLIB_USB_OTG_VBusChargeTo5V ( USB_MODULE_ID index )

  Summary:
    Sets the VBUS line to charge to 5V.

  Description: 
    This function sets the VBUS line to charge to 5V.

  Precondition:
    None.

  Parameters:
    index          - Identifier for the device instance of interest

  Returns:
    None.

  Example:
  <code>
    PLIB_USB_OTG_VBusChargeTo5V (MY_USB_INSTANCE);
  </code>

  Remarks:
    Not available on PIC18 or PIC32 devices.
*/

void PLIB_USB_OTG_VBusChargeTo5V( USB_MODULE_ID index );


// *****************************************************************************
/* Function:
    void PLIB_USB_OTG_VBusDischargeDisable ( USB_MODULE_ID index )

  Summary:
    Disables VBUS line discharge.

  Description:
    This function disables VBUS line discharge.

  Precondition:
    None.

  Parameters:
    index          - Identifier for the device instance of interest

  Returns:
    None.

  Example:
  <code>
    PLIB_USB_OTG_VBusDischargeDisable(MY_USB_INSTANCE);
  </code>

  Remarks:
    Not available on PIC18 or PIC32 devices.
    This feature may not be available on all devices. Please refer to the specific 
	device data sheet to determine availability or use PLIB_USB_ExistsOTG_VbusDischarge in your 
	application to determine whether this feature is available.		
*/

void PLIB_USB_OTG_VBusDischargeDisable ( USB_MODULE_ID index );


// *****************************************************************************
/* Function:
    void PLIB_USB_OTG_VBusChargeEnable ( USB_MODULE_ID index )

  Summary:
    Enables the VBUS line to be charged through a pull-up resistor.

  Description:
    This function enables the VBUS line to be charged through a pull-up resistor.

  Precondition:
    None.

  Parameters:
    index          - Identifier for the device instance of interest

  Returns:
    None.

  Example:
  <code>
    PLIB_USB_OTG_VBusChargeEnable(MY_USB_INSTANCE);
  </code>

  Remarks:
    Not available on PIC18 or PIC32 devices.
    This feature may not be available on all devices. Please refer to the specific 
	device data sheet to determine availability or use PLIB_USB_ExistsOTG_VbusDischarge in your 
	application to determine whether this feature is available.		
*/

void PLIB_USB_OTG_VBusChargeEnable ( USB_MODULE_ID index );


// *****************************************************************************
/* Function:
    void PLIB_USB_OTG_VBusPowerOff ( USB_MODULE_ID index )

  Summary:
    Turns off power on the VBUS Line.

  Description:
    This function turns off power on the VBUS Line.

  Precondition:
    None.

  Parameters:
    index          - Identifier for the device instance of interest

  Returns:
    None.

  Example:
  <code>
    PLIB_USB_OTG_VBusPowerOff(MY_USB_INSTANCE);
  </code>

  Remarks:
    Not available on PIC18 devices.
    This feature may not be available on all devices. Please refer to the specific 
	device data sheet to determine availability or use PLIB_USB_ExistsOTG_VbusPowerOnOff in your 
	application to determine whether this feature is available.		
*/

void PLIB_USB_OTG_VBusPowerOff ( USB_MODULE_ID index );


// *****************************************************************************
/* Function:
    void PLIB_USB_OTG_VBusPowerOn ( USB_MODULE_ID index )

  Summary:
    Turns on power for the VBUS line.

  Description:
    This function turns on power for the VBUS line.

  Precondition:
    None.

  Parameters:
    index          - Identifier for the device instance of interest

  Returns:
    None.

  Example:
  <code>
    PLIB_USB_OTG_VBusPowerOn(MY_USB_INSTANCE);
  </code>

  Remarks:
    Not available on PIC18 devices.
    This feature may not be available on all devices. Please refer to the specific 
	device data sheet to determine availability or use PLIB_USB_ExistsOTG_VbusPowerOnOff in your 
	application to determine whether this feature is available.		
*/

void PLIB_USB_OTG_VBusPowerOn ( USB_MODULE_ID index );


// *****************************************************************************
/* Function:
    bool PLIB_USB_OTG_VBusValid ( USB_MODULE_ID index )

  Summary:
    Returns the status of the A-VBUS valid indicator.

  Description:
    This function returns the status of the A-VBUS valid indicator.

  Precondition:
    The USB module must be in OTG mode.

  Parameters:
    index          - Identifier for the device instance of interest

  Returns:
    - true  - The VBUS voltage is above VA_VBUS_VLD on the A-device,
    - false - The VBUS voltage is below VA_VBUS_VLD on the A-device

  Example:
  <code>
    if ( PLIB_USB_OTG_VBusValid(MY_USB_INSTANCE) )
    {
        // VBUS voltage above session valid for A device
    }
    else
    {
        // VBUS voltage below session valid for A device
    }
  </code>

