chipKIT32/chipKIT-core/pic32/cores/pic32/harmony/framework/peripheral/usb/plib_usb.h
  Remarks:
    This feature may not be available on all devices. Please refer to the specific 
	device data sheet to determine availability or use PLIB_USB_ExistsOTG_InterruptStatus in your 
	application to determine whether this feature is available.	
*/

void PLIB_USB_OTG_InterruptFlagSet( USB_MODULE_ID index, USB_OTG_INTERRUPTS     interruptFlag );


// *****************************************************************************
/* Function:
    bool PLIB_USB_OTG_InterruptIsEnabled( USB_MODULE_ID index, USB_INTERRUPTS interruptFlag )

  Summary:
    Returns whether or not interrupts are enabled.

  Description:
    This function returns whether or not interrupts are enabled.

  Precondition:
    None.

  Parameters:
    index     - Identifier for the device instance of interest
    interruptFlag - Interrupt

  Returns:
    - true  - Interrupts are enabled
    - false - Interrupts are not enabled

  Example:
  <code>
    if ( PLIB_USB_OTG_InterruptIsEnabled( MY_USB_INSTANCE, USB_OTG_INT_ID_STATE_CHANGE  ) )
    {

    }
  </code>

  Remarks:
    This feature may not be available on all devices. Please refer to the specific 
	device data sheet to determine availability or use PLIB_USB_ExistsOTG_Interrupt in your 
	application to determine whether this feature is available.	
*/

bool PLIB_USB_OTG_InterruptIsEnabled( USB_MODULE_ID index, USB_INTERRUPTS interruptFlag );


// *****************************************************************************
// *****************************************************************************
// Section: USB Peripheral Library Interface Functions: USB Activity
// *****************************************************************************
// *****************************************************************************

// *****************************************************************************
/* Function:
    bool PLIB_USB_ActivityPending ( USB_MODULE_ID index )

  Summary:
    Returns whether or not USB activity is pending.

  Description:
    This function returns whether or not USB bus activity has been detected, an 
    interrupt is pending, or an interrupt is yet to be generated.

  Preconditions:
    None.

  Input:
    index -  Identifier for the device instance of interest

  Return:
    - true  - The USB module should not be suspended
    - false - No interrupts are pending or module may be suspended or powered down

  Example:
  <code>
    while ( PLIB_USB_ActivityPending(MY_USB_INSTANCE) )
    {
        // Wait
    }
    // Suspend USB module.
  </code>
  Remarks:
    Not available on PIC18 devices.
    This feature may not be available on all devices. Please refer to the specific 
	device data sheet to determine availability or use PLIB_USB_ExistsActivityPending in your 
	application to determine whether this feature is available.		
*/

bool PLIB_USB_ActivityPending ( USB_MODULE_ID index );

// *****************************************************************************
/* Function:
    uint16_t PLIB_USB_FrameNumberGet ( USB_MODULE_ID index )

  Summary:
    Returns the USB frame number.

  Description:
    This function returns the USB frame number in the lower 11 bits.

  Precondition:
    None.

  Parameters:
    index          - Identifier for the device instance of interest

  Returns:
    Current frame number in lower 11 bits.

  Example:
  <code>
    frameNumber = PLIB_USB_FrameNumberGet(MY_USB_INSTANCE);
  </code>

  Remarks:
    This feature may not be available on all devices. Please refer to the specific 
	device data sheet to determine availability or use PLIB_USB_ExistsFrameNumber in your 
	application to determine whether this feature is available.	
*/

uint16_t PLIB_USB_FrameNumberGet ( USB_MODULE_ID index );

// *****************************************************************************
/* Function:
    bool PLIB_USB_JStateIsActive ( USB_MODULE_ID index )

  Summary:
    Live differential receiver J State flag.

  Description:
    This function indicates the live JState (differential '0' in low speed, 
    differential '1' in full speed) on the bus.

  Precondition:
    The USB module must be in Host mode.

  Parameters:
    index          - Identifier for the device instance of interest

  Returns:
    None.

  Example:
  <code>
    // Enable Host Mode
    PLIB_USB_OperatingModeSelect(MY_USB_INSTANCE,USB_OPMODE_HOST);

    // Enable D+ and D- pull-down resistors
    PLIB_USB_OTG_PullUpPullDownSetup(MY_USB_INSTANCE,USB_OTG_DPLUS_PULLDN, true);
    PLIB_USB_OTG_PullUpPullDownSetup(MY_USB_INSTANCE,USB_OTG_DMINUS_PULLDN,true);

    // Disable D+ and D- pull-up resistors
    PLIB_USB_OTG_PullUpPullDownSetup(MY_USB_INSTANCE,USB_OTG_DPLUS_PULLUP, false);
    PLIB_USB_OTG_PullUpPullDownSetup(MY_USB_INSTANCE,USB_OTG_DMINUS_PULLUP,false);

    // Enable SOF Packet generation
    PLIB_USB_SOFEnable(MY_USB_INSTANCE);

    // Enable the device attach interrupt
    PLIB_USB_INT_Enable(MY_USB_INSTANCE,USB_INT_OTG,ACTIVITY_DETECT);

    // Wait for the Attach interrupt.
    while(!PLIB_USB_INT_FlagGet(MY_USB_INSTANCE,USB_INT_OTG,ACTIVITY_DETECT) )
    {
        //Do nothing
    }

    // Check JState
    if( PLIB_USB_JStateIsActive(MY_USB_INSTANCE) )
    {
        // Full Speed
        PLIB_USB_FullSpeedEnable(MY_USB_INSTANCE);
    }
    else
    {
        // Low Speed
        PLIB_USB_FullSpeedDisable(MY_USB_INSTANCE);
    }
  </code>

  Remarks:
    Not applicable for PIC18 devices since PIC18 devices do not support Host mode.
    This feature may not be available on all devices. Please refer to the specific 
	device data sheet to determine availability or use PLIB_USB_ExistsLiveJState in your 
	application to determine whether this feature is available.		
*/

bool PLIB_USB_JStateIsActive ( USB_MODULE_ID index );

// *****************************************************************************
/* Function:
    void PLIB_USB_PacketTransferEnable ( USB_MODULE_ID index )

  Summary:
    Re-enables the Serial Interface Engine (SIE), allowing token and packet
    processing.

  Description:
    This function re-enables the Serial Interface Engine (SIE), allowing token and 
    packet processing.

  Precondition:
    USB module must be in device mode.

  Parameters:
    index          - Identifier for the device instance of interest

  Returns:
    None.

