chipKIT32/chipKIT-core/pic32/cores/pic32/harmony/framework/peripheral/usb/plib_usb.h
  <code>
    if( PLIB_USB_PacketTransferIsDisabled(MY_USB_INSTANCE) )
    {
        // SETUP token received, do the needful operations
        .
        .
        .
        // SETUP handling completed, enable Setup token and packet processing:
        PLIB_USB_PacketTransferEnable(MY_USB_INSTANCE);
    }
  </code>

  Remarks:
    Not valid when the USB module is in Host mode.
    This feature may not be available on all devices. Please refer to the specific 
	device data sheet to determine availability or use PLIB_USB_ExistsPacketTransfer in your 
	application to determine whether this feature is available.		
*/

void PLIB_USB_PacketTransferEnable ( USB_MODULE_ID index );

// *****************************************************************************
/* Function:
    void PLIB_USB_PacketTransferDisable ( USB_MODULE_ID index )

  Summary:
    Disables the Serial Interface Engine (SIE).

  Description:
    This function disables the Serial Interface Engine (SIE).

  Precondition:
    USB module must be in device mode.

  Parameters:
    index          - Identifier for the device instance of interest

  Returns:
    None.

  <code>
    if( PLIB_USB_PacketTransferIsDisabled(MY_USB_INSTANCE) )
    {
        // SETUP token received, do the needful operations
        .
        .
        .
        // SETUP handling completed, enable Setup token and packet processing:
        PLIB_USB_PacketTransferDisable(MY_USB_INSTANCE);
    }
  </code>

  Remarks:
    Not valid when the USB module is in Host mode.
    This feature may not be available on all devices. Please refer to the specific 
	device data sheet to determine availability or use PLIB_USB_ExistsPacketTransfer in your 
	application to determine whether this feature is available.		
*/

void PLIB_USB_PacketTransferDisable ( USB_MODULE_ID index );

// *****************************************************************************
/* Function:
    bool PLIB_USB_PacketTransferIsDisabled ( USB_MODULE_ID index )

  Summary:
    Indicates that a setup token has been received from the Host
    and that token/packet processing is disabled.

  Description:
    This function indicates that a setup token has been received from the Host
    and that the Serial Interface Engine (SIE) has been turned off, disabling 
    token and packet processing.

  Precondition:
    USB module must be in device mode.

  Parameters:
    index          - Identifier for the device instance of interest

  Returns:
    None.

  Example:
  <code>
    if( PLIB_USB_PacketTransferIsDisabled(MY_USB_INSTANCE) )
    {
        // SETUP token received, do the needful operations
        .
        .
        .
        // SETUP handling completed, enable Setup token and packet processing:
        PLIB_USB_PacketTransferEnable(MY_USB_INSTANCE);
    }
  </code>

  Remarks:
    Not valid when USB is Host.
    This feature may not be available on all devices. Please refer to the specific 
	device data sheet to determine availability or use PLIB_USB_ExistsPacketTransfer in your 
	application to determine whether this feature is available.		
*/

bool PLIB_USB_PacketTransferIsDisabled ( USB_MODULE_ID index );

// *****************************************************************************
/* Function:
    bool PLIB_USB_SE0InProgress( USB_MODULE_ID index )

  Summary:
    Returns whether a single-ended zero event is in progress.

  Description:
    This function returns whether a single-ended zero event is in progress.

  Precondition:
    None.

  Parameters:
    index          - Identifier for the device instance of interest

  Returns:
    - true  - A single ended zero event (SE0) is occurring
    - false - A single-ended zero event (SE0) is not occurring

  Example:
  <code>
    if( PLIB_USB_SE0InProgress(MY_USB_INSTANCE) )
    {
        // handle the SE0 event
    }
  </code>

  Remarks:
    This feature may not be available on all devices. Please refer to the specific 
	device data sheet to determine availability or use PLIB_USB_ExistsLiveSingleEndedZero in your 
	application to determine whether this feature is available.	
*/

bool PLIB_USB_SE0InProgress( USB_MODULE_ID index );


// *****************************************************************************
// *****************************************************************************
// Section: USB Peripheral Library I/F Routines: External Transceiver Support
// *****************************************************************************
// *****************************************************************************

// *****************************************************************************
/* Function:
    void PLIB_USB_I2CInterfaceForExtModuleDisable ( USB_MODULE_ID index )

  Summary:
    Specifies external module(s) are controlled via dedicated pins.

  Description:
    Specifies that external module(s) are controlled via dedicated pins.

  Precondition:
    None.

  Parameters:
    index          - Identifier for the device instance of interest

  Returns:
    None.

  Example:
  <code>
    PLIB_USB_I2CInterfaceForExtModuleDisable(MY_USB_INSTANCE);
  </code>

  Remarks:
    This feature is not available on all devices. Please refer to the specific
    device data sheet to determine whether this feature is available on your device.
*/

void PLIB_USB_I2CInterfaceForExtModuleDisable ( USB_MODULE_ID index );


// *****************************************************************************
/* Function:
    void PLIB_USB_I2CInterfaceForExtModuleEnable ( USB_MODULE_ID index )

  Summary:
    Specifies external module(s) are controlled via the I2C interface.

  Description:
    This function specifies that external module(s) are controlled via the I2C
    interface.

  Precondition:
    None.

  Parameters:
    index          - Identifier for the device instance of interest

  Returns:
    None.

  Example:
  <code>
    PLIB_USB_I2CInterfaceForExtModuleEnable(MY_USB_INSTANCE);
  </code>

