chipKIT32/chipKIT-core/pic32/cores/pic32/harmony/framework/peripheral/usb/plib_usb.h
  Remarks:
    This feature is not available on all devices. Please refer to the specific
    device data sheet to determine whether this feature is available on your device.
*/

void PLIB_USB_I2CInterfaceForExtModuleEnable ( USB_MODULE_ID index );


// *****************************************************************************
/* Function:
    void PLIB_USB_TransceiverDisable ( USB_MODULE_ID index )

  Summary:
    Disables the on-chip transceiver

  Description:
    This function disables the on-chip transceiver and enables the interface to 
    the off-chip transceiver.

  Precondition:
    None.

  Parameters:
    index          - Identifier for the device instance of interest

  Returns:
    None.

  Example:
  <code>
    PLIB_USB_TransceiverDisable(MY_USB_INSTANCE);
  </code>

  Remarks:
    PIC18 devices only.
    This feature may not be available on all devices. Please refer to the specific 
	device data sheet to determine availability or use PLIB_USB_ExistsOnChipTransceiver in your 
	application to determine whether this feature is available.	
*/

void PLIB_USB_TransceiverDisable ( USB_MODULE_ID index );


// *****************************************************************************
/* Function:
    void PLIB_USB_TransceiverEnable ( USB_MODULE_ID index )

  Summary:
    Enables the on-chip transceiver.

  Description:
    This function enables the on-chip transceiver. The interface to the off-chip 
    transceiver is disabled.

  Precondition:
    Use only before the USB module is enabled by calling PLIB_USB_Enable.

  Parameters:
    index          - Identifier for the device instance of interest

  Returns:
    None.

  Example:
  <code>
    PLIB_USB_TransceiverEnable(MY_USB_INSTANCE);
  </code>

  Remarks:
    PIC18 devices only.
    This feature may not be available on all devices. Please refer to the specific 
	device data sheet to determine availability or use PLIB_USB_ExistsOnChipTransceiver in your 
	application to determine whether this feature is available.		
*/

void PLIB_USB_TransceiverEnable ( USB_MODULE_ID index );


// *****************************************************************************
// *****************************************************************************
// Section: USB Peripheral Library Interface Functions: VBUS Support
// *****************************************************************************
// *****************************************************************************


// *****************************************************************************
/* Function:
    void PLIB_USB_ExternalComparatorMode2Pin ( USB_MODULE_ID index )

  Summary: 
    Sets the 2-pin input configuration for VBUS comparators.

  Description:
    This function sets the 2-pin input configuration for VBUS Comparators.

  Precondition:
    None.

  Parameters:
    index          - Identifier for the device instance of interest

  Returns:
    None.

  Example:
  <code>
    PLIB_USB_ExternalComparatorMode2Pin(MY_USB_INSTANCE);
  </code>

  Remarks:
    This feature is not available on all devices. Please refer to the specific
    device data sheet to determine whether this feature is available on your device.
*/

void PLIB_USB_ExternalComparatorMode2Pin ( USB_MODULE_ID index );


// *****************************************************************************
/* Function:
    void PLIB_USB_ExternalComparatorMode3Pin ( USB_MODULE_ID index )

  Summary: 
    Sets the 3-pin input configuration for VBUS Comparators.

  Description:
    This function sets the 3-pin input configuration for VBUS comparators.

  Precondition:
    None.

  Parameters:
    index          - Identifier for the device instance of interest

  Returns:
    None.

  Example:
  <code>
    PLIB_USB_ExternalComparatorMode3Pin(MY_USB_INSTANCE);
  </code>

  Remarks:
    This feature is not available on all devices. Please refer to the specific
    device data sheet to determine whether this feature is available on your device.
*/

void PLIB_USB_ExternalComparatorMode3Pin ( USB_MODULE_ID index );


// *****************************************************************************
/* Function:
    void PLIB_USB_PWMCounterDisable( USB_MODULE_ID index );

  Summary:
    Disables the PWM counter used to generate the VBUS for the USB module.

  Description:
    This function disables the PWM counter used to generate the VBUS for the 
    USB module.

  Precondition:
    None.

  Parameters:
    index          - Identifier for the device instance of interest

  Returns:
    None.

  Example:
  <code>
    PLIB_USB_PWMDisable(MY_USB_INSTANCE);
    PLIB_USB_PWMCounterDisable(MY_USB_INSTANCE);
  </code>

  Remarks:
    This feature is not available on all devices. Please refer to the specific
    device data sheet to determine whether this feature is available on your device.
*/

void PLIB_USB_PWMCounterDisable ( USB_MODULE_ID index );


// *****************************************************************************
/* Function:
    void PLIB_USB_PWMCounterEnable( USB_MODULE_ID index )

  Summary:
    Enables the PWM counter used to generate the VBUS for the USB module.

  Description:
    This function enables the PWM counter used to generate the VBUS for the 
    USB module.

  Precondition:
    None.

  Parameters:
    index          - Identifier for the device instance of interest

  Returns:
    None.

  Example:
  <code>
    PLIB_USB_PWMEnable(MY_USB_INSTANCE);
    PLIB_USB_PWMCounterEnable(MY_USB_INSTANCE);
  </code>

  Remarks:
    This feature is not available on all devices. Please refer to the specific
    device data sheet to determine whether this feature is available on your device.
*/

void PLIB_USB_PWMCounterEnable ( USB_MODULE_ID index );


// *****************************************************************************
/* Function:
    void PLIB_USB_PWMDisable ( USB_MODULE_ID index )

  Summary:
    Disables the PWM Generator.

  Description:
    This function disables the PWM Generator. PWM output held in a reset state 
    defined by PLIB_USB_PWMPolarityActiveHigh or PLIB_USB_PWMPolarityActiveLow.

  Precondition:
    None.

  Parameters:
    index          - Identifier for the device instance of interest

  Returns:
    None.

  Example:
  <code>
    PLIB_USB_PWMDisable (MY_USB_INSTANCE);
  </code>

