chipKIT32/chipKIT-core/pic32/cores/pic32/harmony/framework/peripheral/usb/plib_usb.h
  Remarks:
    This feature is not available on all devices. Please refer to the specific
    device data sheet to determine whether this feature is available on your device.
*/

void PLIB_USB_PWMDisable ( USB_MODULE_ID index );


// *****************************************************************************
/* Function:
    void PLIB_USB_PWMEnable ( USB_MODULE_ID index )

  Summary:
    Enables the PWM Generator.

  Description:
    This function enables the PWM Generator.

  Precondition:
    None.

  Parameters:
    index          - Identifier for the device instance of interest

  Returns:
    None.

  Example:
  <code>
    PLIB_USB_PWMEnable(MY_USB_INSTANCE);
  </code>

  Remarks:
    This feature is not available on all devices. Please refer to the specific
    device data sheet to determine whether this feature is available on your device.
*/

void PLIB_USB_PWMEnable ( USB_MODULE_ID index );


// *****************************************************************************
/* Function:
    void PLIB_USB_PWMPolarityActiveHigh ( USB_MODULE_ID index )

  Summary:
    Sets the PWM output to active-low and resets high.

  Description:
    This function sets the PWM output to active-low and resets high.

  Precondition:
    None.

  Parameters:
    index          - Identifier for the device instance of interest

  Returns:
    None.

  Example:
  <code>
    PLIB_USB_PWMPolaritiy (MY_USB_INSTANCE);
  </code>

  Remarks:
    This feature is not available on all devices. Please refer to the specific
    device data sheet to determine whether this feature is available on your device.
*/

void PLIB_USB_PWMPolarityActiveHigh ( USB_MODULE_ID index );


// *****************************************************************************
/* Function:
    void PLIB_USB_PWMPolaritiyActiveLow ( USB_MODULE_ID index )

  Summary:
    Sets the PWM output to active-high and resets low.

  Description:
    This function sets the PWM output to active-high and resets low.

  Precondition:
    None.

  Parameters:
    index          - Identifier for the device instance of interest

  Returns:
    None.

  Remarks:
    This feature is not available on all devices. Please refer to the specific
    device data sheet to determine whether this feature is available on your device.
*/

void PLIB_USB_PWMPolaritiyActiveLow ( USB_MODULE_ID index );


// *****************************************************************************
/* Function:
    void PLIB_USB_VBoostDisable ( USB_MODULE_ID index )

  Summary:
    Disables the On-Chip 5V Boost Regulator Circuit Disabled bit.

  Description:
    This function disables the On-Chip 5V Boost Regulator Circuit Disabled bit.

  Precondition:
    None.

  Parameters:
    index          - Identifier for the device instance of interest

  Returns:
    None.

  Example:
  <code>
    PLIB_USB_VBoostDisable(MY_USB_INSTANCE);
  </code>

  Remarks:
    This feature is not available on all devices. Please refer to the specific
    device data sheet to determine whether this feature is available on your device.
*/

void PLIB_USB_VBoostDisable ( USB_MODULE_ID index );


// *****************************************************************************
/* Function:
    void PLIB_USB_VBoostEnable ( USB_MODULE_ID index )

  Summary: 
    Enables the On-Chip 5V Boost Regulator Circuit Enabled bit.

  Description:
    This function enables the On-Chip 5V Boost Regulator Circuit Enabled bit.

  Precondition:
    None.

  Parameters:
    index          - Identifier for the device instance of interest

  Returns:
    None.

  Example:
  <code>
    PLIB_USB_VBoostEnable(MY_USB_INSTANCE);
  </code>

  Remarks:
    This feature is not available on all devices. Please refer to the specific
    device data sheet to determine whether this feature is available on your device.
*/

void PLIB_USB_VBoostEnable ( USB_MODULE_ID index );


// *****************************************************************************
/* Function:
    void PLIB_USB_VBUSComparatorDisable ( USB_MODULE_ID index )

  Summary:
    Disables the on-chip VBUS Comparator.

  Description: 
    This function disables the on-chip VBUS Comparator.

  Precondition:
    None.

  Parameters:
    index          - Identifier for the device instance of interest

  Returns:
    None.

  Example:
  <code>
    PLIB_USB_VBUSComparatorDisable(MY_USB_INSTANCE);
  </code>

  Remarks:
    This feature is not available on all devices. Please refer to the specific
    device data sheet to determine whether this feature is available on your device.
*/

void PLIB_USB_VBUSComparatorDisable ( USB_MODULE_ID index );


// *****************************************************************************
/* Function:
    void PLIB_USB_VBUSComparatorEnable ( USB_MODULE_ID index )

  Summary:
    Enables the on-chip VBUS Comparator.

  Description:
    This function enables the on-chip VBUS Comparator.

  Precondition:
    None.

  Parameters:
    index          - Identifier for the device instance of interest

  Returns:
    None.

  Example:
  <code>
    PLIB_USB_VBUSComparatorEnable(MY_USB_INSTANCE);
  </code>

  Remarks:
    This feature is not available on all devices. Please refer to the specific
    device data sheet to determine whether this feature is available on your device.
*/

void PLIB_USB_VBUSComparatorEnable ( USB_MODULE_ID index );


// *****************************************************************************
/* Function:
    void PLIB_USB_VBUSPullUpDisable ( USB_MODULE_ID index )

  Summary:
    Disables the pull-up on the VBUS pin.

  Description:
    This function disables the pull-up on the VBUS pin.

  Precondition:
    None.

  Parameters:
    index          - Identifier for the device instance of interest

  Returns:
    None.

  Example:
  <code>
    PLIB_USB_VBUSPullUpDisable(MY_USB_INSTANCE);
  </code>

