chipKIT32/chipKIT-core/pic32/cores/pic32/harmony/framework/peripheral/usb/plib_usb.h
  Remarks:
    This feature is not available on all devices. Please refer to the specific
    device data sheet to determine whether this feature is available on your device.
*/

void PLIB_USB_VBUSPullUpDisable ( USB_MODULE_ID index );


// *****************************************************************************
/* Function:
    void PLIB_USB_VBUSPullUpEnable ( USB_MODULE_ID index )

  Summary: 
    Enables the pull-up on the VBUS pin.

  Description: 
    This function enables the pull-up on the VBUS pin.

  Precondition:
    None.

  Parameters:
    index          - Identifier for the device instance of interest

  Returns:
    None.

  Example:
  <code>
    PLIB_USB_VBUSPullUpEnable(MY_USB_INSTANCE);
  </code>

  Remarks:
    This feature is not available on all devices. Please refer to the specific
    device data sheet to determine whether this feature is available on your device.
*/

void PLIB_USB_VBUSPullUpEnable ( USB_MODULE_ID index );


// *****************************************************************************
// *****************************************************************************
// Section: USB Peripheral Library Interface Functions: Test Support
// *****************************************************************************
// *****************************************************************************

// *****************************************************************************
/* Function:
    void PLIB_USB_EyePatternEnable ( USB_MODULE_ID index )

  Summary:
    Enables USB eye pattern test.

  Description:
    This function enables the USB eye pattern test.

  Precondition:
    None.

  Parameters:
    index          - Identifier for the device instance of interest

  Returns:
    None.

  Example:
  <code>
    PLIB_USB_EyePatternEnable(MY_USB_INSTANCE);
  </code>

  Remarks:
    This feature may not be available on all devices. Please refer to the specific 
	device data sheet to determine availability or use PLIB_USB_ExistsEyePattern in your 
	application to determine whether this feature is available.	
*/

void PLIB_USB_EyePatternEnable ( USB_MODULE_ID index );


// *****************************************************************************
/* Function:
    void PLIB_USB_EyePatternDisable ( USB_MODULE_ID index )

  Summary:
    Disables the USB eye pattern test.

  Description:
    This function disables the USB eye pattern test.

  Precondition:
    None.

  Parameters:
    index          - Identifier for the device instance of interest

  Returns:
    None.

  Example:
  <code>
    PLIB_USB_EyePatternDisable(MY_USB_INSTANCE);
  </code>

  Remarks:
    This feature may not be available on all devices. Please refer to the specific 
	device data sheet to determine availability or use PLIB_USB_ExistsEyePattern in your 
	application to determine whether this feature is available.	
*/

void PLIB_USB_EyePatternDisable ( USB_MODULE_ID index );

// *****************************************************************************
/* Function:
    void PLIB_USB_PingPongReset ( USB_MODULE_ID index )

  Summary:
    Resets the USB peripheral internal Ping-Pong indicator to point to even 
    buffers.

  Description:
    This function resets the USB peripheral internal Ping-Pong indicator to point 
    to Even buffers.

  Precondition:
    None.

  Parameters:
    index          - Identifier for the device instance of interest

  Returns:
    None.

  Example:
  <code>
    PLIB_USB_PingPongReset(MY_USB_INSTANCE);
  </code>

  Remarks:
    This feature may not be available on all devices. Please refer to the specific 
	device data sheet to determine availability or use PLIB_USB_ExistsBufferFreeze in your 
	application to determine whether this feature is available.	
*/

void PLIB_USB_PingPongReset (USB_MODULE_ID index); 

// *****************************************************************************
/* Function:
    void PLIB_USB_AllInterruptEnable(USB_MODULE_ID index, USB_INTERRUPTS usbInterruptsFlag, 
        USB_ERROR_INTERRUPTS usbErrorInterruptsFlag, USB_OTG_INTERRUPTS otgInterruptFlag);  

  Summary:
    Configures the USB peripheral general interrupts, error interrupts and
    OTG interrupts.

  Description:
    This function configures the USB peripheral general interrupts, error 
    interrupts and OTG interrupts.

  Precondition:
    None.

  Parameters:
    index          - Identifier for the device instance of interest
    usbInterruptsFlag - General interrupts to be configured
    usbErrorInterruptsFlag - USB Error interrupts to be configured
    otgInterruptFlag - OTG interrupts to be configured

  Returns:
    None.

  Example:
  <code>
    // This code snippet disables all OTG interrupts, disables
    // the SOF interrupt and enables all error interrupts.
    USB_OTG_INTERRUPTS otgInterruptEnables = ~USB_OTG_INT_ALL ;
    USB_INTERRUPTS generalInterruptEnables = USB_INT_ALL & ~USB_INT_SOF ;
    USB_ERROR_INTERRUPTS errorInterruptEnables = USB_ERR_INT_ALL ; 
   
    PLIB_USB_AllInterruptEnable(USB_MODULE_ID index, USB_INTERRUPTS usbInterruptsFlag, 
        USB_ERROR_INTERRUPTS usbErrorInterruptsFlag,
        USB_OTG_INTERRUPTS otgInterruptFlag);  
  
  </code>

  Remarks:
    This feature may not be available on all devices. Please refer to the specific 
	device data sheet to determine availability or use PLIB_USB_ExistsALL_Interrupt in your 
	application to determine whether this feature is available.	
*/

void PLIB_USB_AllInterruptEnable(USB_MODULE_ID index, USB_INTERRUPTS usbInterruptsFlag, 
        USB_ERROR_INTERRUPTS usbErrorInterruptsFlag,
        USB_OTG_INTERRUPTS otgInterruptFlag);  

// *****************************************************************************
/* Function:
    USB_ERROR_INTERRUPTS PLIB_USB_ErrorInterruptFlagAllGet(USB_MODULE_ID index);

  Summary:
    Returns a logically ORed bit map of active error interrupt flags.

  Description:
    This function returns a logically ORed bit map of active error interrupt 
    flags.

  Precondition:
    None.

  Parameters:
    index          - Identifier for the device instance of interest

  Returns:
    Returns a logically ORed bit map of active error interrupt flags.

  Example:
  <code>
    USB_ERROR_INTERRUPTS errorInterruptEnables; 

    errorInterruptEnables = PLIB_USB_ErrorInterruptFlagAllGet(MY_USB_INSTANCE);
    if(errorInterruptEnables | USB_ERR_INT_DEVICE_EOF_ERROR)
    {
        // End of frame error occurred.
    }
  </code>

