chipKIT32/chipKIT-core/pic32/cores/pic32/harmony/framework/peripheral/usb/plib_usb.h
  Remarks:
    This feature may not be available on all devices. Please refer to the specific 
	device data sheet to determine availability or use PLIB_USB_ExistsERR_InterruptStatus in your 
	application to determine whether this feature is available.	
*/

USB_ERROR_INTERRUPTS PLIB_USB_ErrorInterruptFlagAllGet(USB_MODULE_ID index);

// *****************************************************************************
/* Function:
    USB_INTERRUPTS PLIB_USB_InterruptFlagAllGet(USB_MODULE_ID index);

  Summary:
    Returns a logically ORed bit map of active general USB interrupt flags.

  Description:
    This function returns a logically ORed bit map of active general USB interrupt
    flags.

  Precondition:
    None.

  Parameters:
    index          - Identifier for the device instance of interest

  Returns:
    Returns a logically ORed bit map of active general USB interrupt flags.

  Example:
  <code>
    USB_INTERRUPTS interruptEnables; 

    interruptEnables = PLIB_USB_InterruptFlagAllGet(MY_USB_INSTANCE);
    if(interruptEnables | USB_INT_DEVICE_RESET)
    {
        // Device received reset signaling
    }
  </code>

  Remarks:
    This feature may not be available on all devices. Please refer to the specific 
	device data sheet to determine availability or use PLIB_USB_ExistsGEN_InterruptStatus in your 
	application to determine whether this feature is available.	
*/

USB_INTERRUPTS PLIB_USB_InterruptFlagAllGet(USB_MODULE_ID index);

// *****************************************************************************
/* Function:
    void PLIB_USB_LastTransactionDetailsGet(USB_MODULE_ID index, 
        USB_BUFFER_DIRECTION * direction, 
        USB_PING_PONG_STATE * pingpong,
        uint8_t * endpoint);

  Summary:
    Returns the details of the last completed transaction.

  Description:
    This function returns the details of the last completed transaction.

  Precondition:
    None.

  Parameters:
    index          - Identifier for the device instance of interest
    direction      - Return value contains direction of the last transfer
    pingpong       - Return value contains Ping-Pong indication of the
                     the last transfer
    endpoint       - Return value contains the endpoint which processed the
                     last transfer

  Returns:
    None.

  Example:
  <code>
    USB_BUFFER_DIRECTION direction; 
    USB_PING_PONG_STATE pingpong;
    uint8_t endpoint;

    interruptEnables = PLIB_USB_InterruptFlagAllGet(MY_USB_INSTANCE);
    if(interruptEnables | USB_INT_TOKEN_DONE)
    {
        // Find out details of the token
        PLIB_USB_LastTransactionDetailsGet(MY_USB_INSTANCE, &direction, 
                                        &pingpong, &endpoint);
    }
  </code>

  Remarks:
    This feature may not be available on all devices. Please refer to the specific 
	device data sheet to determine availability or use PLIB_USB_ExistsLastTransactionDetails in your 
	application to determine whether this feature is available.	
*/

void PLIB_USB_LastTransactionDetailsGet(USB_MODULE_ID index, 
        USB_BUFFER_DIRECTION * direction, 
        USB_PING_PONG_STATE * pingpong,
        uint8_t * endpoint);

// *****************************************************************************
/* Function:
    void PLIB_USB_BufferAllCancelReleaseToUSB(USB_MODULE_ID index, 
        void * pBDT,USB_PING_PONG_MODE ppMode, int nEndpoints);
  
  Summary:
    Cancels all endpoint buffer releases to the USB module and hands over the 
    buffer to the CPU.

  Description:
    This function cancels all endpoint buffer releases to the USB module and hands 
    over the buffer to the CPU.

  Precondition:
    None.

  Parameters:
    index          - Identifier for the device instance of interest
    pBDT           - Pointer to the Buffer Descriptor Table
    ppMode         - Buffer Descriptor Table Ping-Pong mode
    nEndpoints     - Number of endpoints in the Buffer-Descriptor table

  Returns:
    None.

  Example:
  <code>
    
    //Cancel all buffer releases to USB.
    //BDT has 3 Endpoints.

    PLIB_USB_BufferAllCancelReleaseToUSB(MY_USB_INSTANCE, pBDT, 
                                    USB_PING_PONG_NO_PING_PONG, 3);
  </code>

  Remarks:
    This feature may not be available on all devices. Please refer to the specific 
	device data sheet to determine availability or use PLIB_USB_ExistsBDTFunctions in your 
	application to determine whether this feature is available.	
*/
void PLIB_USB_BufferAllCancelReleaseToUSB(USB_MODULE_ID index, 
        void * pBDT,USB_PING_PONG_MODE ppMode, int nEndpoints);

// *****************************************************************************
/* Function:
    void PLIB_USB_EPnRxEnable(USB_MODULE_ID index, uint8_t endpoint);
  
  Summary:
    Enables an endpoint to process IN tokens.

  Description:
    This function enables an endpoint to process IN tokens.

  Precondition:
    None.

  Parameters:
    index          - Identifier for the device instance of interest
    endpoint       - Endpoint to be affected

  Returns:
    None.

  Example:
  <code>
    
    //Provision endpoint 3 to process IN Token 
    PLIB_USB_EPnRxEnable(MY_USB_INSTANCE, 3);

  </code>

  Remarks:
    This feature may not be available on all devices. Please refer to the specific 
	device data sheet to determine availability or use PLIB_USB_ExistsEPnRxEnable in your 
	application to determine whether this feature is available.	
*/
void PLIB_USB_EPnRxEnable(USB_MODULE_ID index, uint8_t endpoint);

// *****************************************************************************
/* Function:
    void PLIB_USB_EPnRxDisable(USB_MODULE_ID index, uint8_t endpoint);
  
  Summary:
    Disables an endpoint's ability to process IN tokens.

  Description:
    This function disables an endpoint's ability to process IN tokens.

  Precondition:
    None.

  Parameters:
    index          - Identifier for the device instance of interest
    endpoint       - Endpoint to be affected

  Returns:
    None.

  Example:
  <code>
    
    //De-provision endpoint 3 to process IN Token 
    PLIB_USB_EPnRxDisable(MY_USB_INSTANCE, 3);

  </code>

