chipKIT32/chipKIT-core/pic32/cores/pic32/harmony/framework/peripheral/usb/plib_usb.h
  Remarks:
    This feature may not be available on all devices. Please refer to the specific 
	device data sheet to determine availability or use PLIB_USB_ExistsEPnRxEnable in your 
	application to determine whether this feature is available.	
*/

void PLIB_USB_EPnRxDisable(USB_MODULE_ID index, uint8_t endpoint);

// *****************************************************************************
/* Function:
    void PLIB_USB_EPnTxEnable(USB_MODULE_ID index, uint8_t endpoint);
  
  Summary:
    Enables an endpoint to process OUT tokens.

  Description:
    This function enables an endpoint to process OUT tokens.

  Precondition:
    None.

  Parameters:
    index          - Identifier for the device instance of interest
    endpoint       - Endpoint to be affected

  Returns:
    None.

  Example:
  <code>
    
    //Provision endpoint 3 to process OUT Token 
    PLIB_USB_EPnTxEnable(MY_USB_INSTANCE, 3);

  </code>

  Remarks:
    None.
*/
void PLIB_USB_EPnTxEnable(USB_MODULE_ID index, uint8_t endpoint);

// *****************************************************************************
/* Function:
    void PLIB_USB_EPnTxDisable(USB_MODULE_ID index, uint8_t endpoint);
  
  Summary:
    Disables an endpoint's ability to process OUT tokens.

  Description:
    This function disables an endpoint's ability to process OUT tokens.

  Precondition:
    None.

  Parameters:
    index          - Identifier for the device instance of interest
    endpoint       - Endpoint to be affected

  Returns:
    None.

  Example:
  <code>
    
    //De-provision endpoint 3 to process OUT Token 
    PLIB_USB_EPnTxDisable(MY_USB_INSTANCE, 3);

  </code>

  Remarks:
    This feature may not be available on all devices. Please refer to the specific 
	device data sheet to determine availability or use PLIB_USB_ExistsEPnRxEnable in your 
	application to determine whether this feature is available.	
*/

void PLIB_USB_EPnTxDisable(USB_MODULE_ID index, uint8_t endpoint);

// *****************************************************************************
/* Function:
    void PLIB_USB_BufferEP0RxStatusInitialize ( USB_MODULE_ID index,
                                            void* pBDT,
                                            USB_PING_PONG_MODE ppMode,
                                            USB_BUFFER_PING_PONG pingpong,
                                            uint16_t bufferByteCount );

  Summary:
    Initializes the Endpoint 0 RX endpoint buffer descriptors.

  Description:
    This function initializes the Endpoint 0 RX endpoint buffer descriptors. This 
    function will clear the Endpoint 0 RX Buffer Descriptor status field, load the 
    endpoint size and release the buffer to the USB module.

  Precondition:
    None.

  Parameters:
    index          - Identifier for the device instance of interest
    pBDT           - Pointer to Buffer Descriptor Table
    pingpong       - Ping-Pong mode
    bufferByteCount - size of the EP0 RX buffer in bytes


  Returns:
    None.

  Example:
  <code>
    
    //Initialize EP0 RX even buffer descriptor and release back to 
    //USB. Buffer size is 64

    PLIB_USB_BufferEP0RxStatusInitialize ( MY_USB_INSTANCE, pBDT,
        USB_PING_PONG_NO_PING_PONG, USB_BUFFER_EVEN, 64);

  </code>

  Remarks:
    This feature may not be available on all devices. Please refer to the specific 
	device data sheet to determine availability or use PLIB_USB_ExistsBDTFunctions in your 
	application to determine whether this feature is available.	
*/

void PLIB_USB_BufferEP0RxStatusInitialize ( USB_MODULE_ID index,
                                            void* pBDT,
                                            USB_PING_PONG_MODE ppMode,
                                            USB_BUFFER_PING_PONG pingpong,
                                            uint16_t bufferByteCount );

// *****************************************************************************
/* Function:
    void PLIB_USB_BufferClearAllDTSEnable( USB_MODULE_ID index,
                                           void * pBDT,
                                           USB_PING_PONG_MODE ppMode,
                                           uint8_t epValue,
                                           USB_BUFFER_DIRECTION bufferDirection);

  Summary:
    Clears the endpoint descriptor entry and enables data toggle synchronization. 

  Description:
    This function clears the endpoint descriptor entry and enables data toggle 
    synchronization.

  Precondition:
    None.

  Parameters:
    index          - Identifier for the device instance of interest
    pBDT           - pointer to Buffer Descriptor Table
    pingpong       - Ping-Pong mode.
    epvalue        - Endpoint to be be affected
    bufferDirection - Endpoint direction

  Returns:
    None.

  Example:
  <code>
    
    //Clear endpoint 6 buffer descriptor transmit entry and
    //enable data toggle synchronization. 

    PLIB_USB_BufferClearAllDTSEnable ( MY_USB_INSTANCE, pBDT,
        USB_PING_PONG_NO_PING_PONG, 6, USB_BUFFER_TX);

  </code>

  Remarks:
    None.
*/

void PLIB_USB_BufferClearAllDTSEnable( USB_MODULE_ID index,
                                           void * pBDT,
                                           USB_PING_PONG_MODE ppMode,
                                           uint8_t epValue,
                                           USB_BUFFER_DIRECTION bufferDirection);

// *****************************************************************************
/* Function:
    void PLIB_USB_UOEMonitorEnable( USB_MODULE_ID index );
  
  Summary:
    Enables the OE signal output.

  Description:
    This function enables the OE signal output.

  Precondition:
    None.

  Parameters:
    index          - Identifier for the device instance of interest

  Returns:
    None.

  Example:
  <code>
    
