chipKIT32/chipKIT-core/pic32/cores/pic32/harmony/framework/peripheral/usb/plib_usb.h
    //Enable the OE output.
    PLIB_USB_UOEMonitorEnable(MY_USB_INSTANCE);

  </code>

  Remarks:
    This feature may not be available on all devices. Please refer to the specific 
	device data sheet to determine availability or use PLIB_USB_ExistsUOEMonitor in your 
	application to determine whether this feature is available.	
*/

void PLIB_USB_UOEMonitorEnable( USB_MODULE_ID index );

// *****************************************************************************
/* Function:
    void PLIB_USB_UOEMonitorDisable( USB_MODULE_ID index );
  
  Summary:
    Disables the OE signal output.

  Description:
    This function disables the OE signal output.

  Precondition:
    None.

  Parameters:
    index          - Identifier for the device instance of interest

  Returns:
    None.

  Example:
  <code>
    
    //Disable the OE output.
    PLIB_USB_UOEMonitorDisable(MY_USB_INSTANCE);

  </code>

  Remarks:
    This feature may not be available on all devices. Please refer to the specific 
	device data sheet to determine availability or use PLIB_USB_ExistsUOEMonitor in your 
	application to determine whether this feature is available.	
*/

void PLIB_USB_UOEMonitorDisable( USB_MODULE_ID index );

// *****************************************************************************
// *****************************************************************************
// Section: USB Peripheral Library Exists API Functions
// *****************************************************************************
// *****************************************************************************
/* The following functions indicate the existence of the features on the device.
*/

//******************************************************************************
/* Function :  PLIB_USB_ExistsOTG_InterruptStatus( USB_MODULE_ID index )

  Summary:
    Identifies whether the OTG_InterruptStatus feature exists on the USB module.

  Description:
    This function identifies whether the OTG_InterruptStatus feature is available
    on the USB module. When this function returns true, these functions are 
    supported on the device:
    - PLIB_USB_OTG_InterruptFlagSet
    - PLIB_USB_OTG_InterruptFlagClear
    - PLIB_USB_OTG_InterruptFlagGet

  Preconditions:
    None.

  Parameters:
    index           - Identifier for the device instance

  Returns:
    - true   - The OTG_InterruptStatus feature is supported on the device
    - false  - The OTG_InterruptStatus feature is not supported on the device

  Remarks:
    None.
*/

bool PLIB_USB_ExistsOTG_InterruptStatus( USB_MODULE_ID index );


//******************************************************************************
/* Function :  PLIB_USB_ExistsOTG_Interrupt( USB_MODULE_ID index )

  Summary:
    Identifies whether the OTG_Interrupt feature exists on the USB module.

  Description:
    This function identifies whether the OTG_Interrupt feature is available
    on the USB module. When this function returns true, these functions are 
    supported on the device:
    - PLIB_USB_OTG_InterruptEnable
    - PLIB_USB_OTG_InterruptDisable
    - PLIB_USB_OTG_InterruptIsEnabled

  Preconditions:
    None.

  Parameters:
    index           - Identifier for the device instance

  Returns:
    - true   - The OTG_Interrupt feature is supported on the device
    - false  - The OTG_Interrupt feature is not supported on the device

  Remarks:
    None.
*/

bool PLIB_USB_ExistsOTG_Interrupt( USB_MODULE_ID index );


//******************************************************************************
/* Function :  PLIB_USB_ExistsOTG_IDPinState( USB_MODULE_ID index )

  Summary:
    Identifies whether the OTG_IDPinState feature exists on the USB module.

  Description:
    This function identifies whether the OTG_IDPinState feature is available
    on the USB module. When this function returns true, this function is
    supported on the device:
    - PLIB_USB_OTG_IDPinStateIsTypeA

  Preconditions:
    None.

  Parameters:
    index           - Identifier for the device instance

  Returns:
    - true   - The OTG_IDPinState feature is supported on the device
    - false  - The OTG_IDPinState feature is not supported on the device

  Remarks:
    None.
*/

bool PLIB_USB_ExistsOTG_IDPinState( USB_MODULE_ID index );


//******************************************************************************
/* Function :  PLIB_USB_ExistsOTG_LineState( USB_MODULE_ID index )

  Summary:
    Identifies whether the OTG_LineState feature exists on the USB module.

  Description:
    This function identifies whether the OTG_LineState feature is available
    on the USB module. When this function returns true, this function is
    supported on the device:
    - PLIB_USB_OTG_LineStateIsStable

  Preconditions:
    None.

  Parameters:
    index           - Identifier for the device instance

  Returns:
    - true   - The OTG_LineState feature is supported on the device
    - false  - The OTG_LineState feature is not supported on the device

  Remarks:
    None.
*/

bool PLIB_USB_ExistsOTG_LineState( USB_MODULE_ID index );


//******************************************************************************
/* Function :  PLIB_USB_ExistsOTG_SessionValid( USB_MODULE_ID index )

  Summary:
    Identifies whether the OTG_SessionValid feature exists on the USB module.

  Description:
    This function identifies whether the OTG_SessionValid feature is available
    on the USB module. When this function returns true, this function is
    supported on the device:
    - PLIB_USB_OTG_SessionValid

  Preconditions:
    None.

  Parameters:
    index           - Identifier for the device instance

  Returns:
    - true   - The OTG_SessionValid feature is supported on the device
    - false  - The OTG_SessionValid feature is not supported on the device

