chipKIT32/chipKIT-core/pic32/cores/pic32/harmony/framework/peripheral/usb/plib_usb.h
  Remarks:
    None.
*/

bool PLIB_USB_ExistsOTG_SessionValid( USB_MODULE_ID index );


//******************************************************************************
/* Function :  PLIB_USB_ExistsOTG_BSessionEnd( USB_MODULE_ID index )

  Summary:
    Identifies whether the OTG_BSessionEnd feature exists on the USB module.

  Description:
    This function identifies whether the OTG_BSessionEnd feature is available
    on the USB module. When this function returns true, this function is
    supported on the device:
    - PLIB_USB_OTG_BSessionHasEnded

  Preconditions:
    None.

  Parameters:
    index           - Identifier for the device instance

  Returns:
    - true   - The OTG_BSessionEnd feature is supported on the device
    - false  - The OTG_BSessionEnd feature is not supported on the device

  Remarks:
    None.
*/

bool PLIB_USB_ExistsOTG_BSessionEnd( USB_MODULE_ID index );


//******************************************************************************
/* Function :  PLIB_USB_ExistsOTG_ASessionValid( USB_MODULE_ID index )

  Summary:
    Identifies whether the OTG_ASessionValid feature exists on the USB module.

  Description:
    This function identifies whether the OTG_ASessionValid feature is available
    on the USB module. When this function returns true, this function is
    supported on the device:
    - PLIB_USB_OTG_VBusValid

  Preconditions:
    None.

  Parameters:
    index           - Identifier for the device instance

  Returns:
    - true   - The OTG_ASessionValid feature is supported on the device
    - false  - The OTG_ASessionValid feature is not supported on the device

  Remarks:
    None.
*/

bool PLIB_USB_ExistsOTG_ASessionValid( USB_MODULE_ID index );


//******************************************************************************
/* Function :  PLIB_USB_ExistsOTG_PullUpPullDown( USB_MODULE_ID index )

  Summary:
    Identifies whether the OTG_PullUpPullDown feature exists on the USB module.

  Description:
    This function identifies whether the OTG_PullUpPullDown feature is available
    on the USB module. When this function returns true, this function is
    supported on the device:
    - PLIB_USB_OTG_PullUpPullDownSetup

  Preconditions:
    None.

  Parameters:
    index           - Identifier for the device instance

  Returns:
    - true   - The OTG_PullUpPullDown feature is supported on the device
    - false  - The OTG_PullUpPullDown feature is not supported on the device

  Remarks:
    None.
*/

bool PLIB_USB_ExistsOTG_PullUpPullDown( USB_MODULE_ID index );


//******************************************************************************
/* Function :  PLIB_USB_ExistsOTG_VbusPowerOnOff( USB_MODULE_ID index )

  Summary:
    Identifies whether the OTG_VbusPowerOnOff feature exists on the USB module.

  Description:
    This function identifies whether the OTG_VbusPowerOnOff feature is available
    on the USB module. When this function returns true, these functions are 
    supported on the device:
    - PLIB_USB_OTG_VBusPowerOff
    - PLIB_USB_OTG_VBusPowerOn

  Preconditions:
    None.

  Parameters:
    index           - Identifier for the device instance

  Returns:
    - true   - The OTG_VbusPowerOnOff feature is supported on the device
    - false  - The OTG_VbusPowerOnOff feature is not supported on the device

  Remarks:
    None.
*/

bool PLIB_USB_ExistsOTG_VbusPowerOnOff( USB_MODULE_ID index );


//******************************************************************************
/* Function :  PLIB_USB_ExistsOTG_VbusCharge( USB_MODULE_ID index )

  Summary:
    Identifies whether the OTG_VbusCharge feature exists on the USB module.

  Description:
    This function identifies whether the OTG_VbusCharge feature is available
    on the USB module. When this function returns true, these functions are 
    supported on the device:
    - PLIB_USB_OTG_VBusChargeEnable
    - PLIB_USB_OTG_VBusChargeDisable

  Preconditions:
    None.

  Parameters:
    index           - Identifier for the device instance

  Returns:
    - true   - The OTG_VbusCharge feature is supported on the device
    - false  - The OTG_VbusCharge feature is not supported on the device

  Remarks:
    None.
*/

bool PLIB_USB_ExistsOTG_VbusCharge( USB_MODULE_ID index );


//******************************************************************************
/* Function :  PLIB_USB_ExistsOTG_VbusDischarge( USB_MODULE_ID index )

  Summary:
    Identifies whether the OTG_VbusDischarge feature exists on the USB module.

  Description:
    This function identifies whether the OTG_VbusDischarge feature is available
    on the USB module. When this function returns true, these functions are 
    supported on the device:
    - PLIB_USB_OTG_VBusDischargeEnable
    - PLIB_USB_OTG_VBusDischargeDisable

  Preconditions:
    None.

  Parameters:
    index           - Identifier for the device instance

  Returns:
    - true   - The OTG_VbusDischarge feature is supported on the device
    - false  - The OTG_VbusDischarge feature is not supported on the device

  Remarks:
    None.
*/

bool PLIB_USB_ExistsOTG_VbusDischarge( USB_MODULE_ID index );


//******************************************************************************
/* Function :  PLIB_USB_ExistsActivityPending( USB_MODULE_ID index )

  Summary:
    Identifies whether the ActivityPending feature exists on the USB module.

  Description:
    This function identifies whether the ActivityPending feature is available
    on the USB module. When this function returns true, this function is
    supported on the device:
    - PLIB_USB_ActivityPending

  Preconditions:
    None.

  Parameters:
    index           - Identifier for the device instance

  Returns:
    - true   - The ActivityPending feature is supported on the device
    - false  - The ActivityPending feature is not supported on the device

