chipKIT32/chipKIT-core/pic32/cores/pic32/harmony/framework/peripheral/usb/plib_usb.h
  Remarks:
    None.
*/

bool PLIB_USB_ExistsActivityPending( USB_MODULE_ID index );


//******************************************************************************
/* Function :  PLIB_USB_ExistsSleepEntryGuard( USB_MODULE_ID index )

  Summary:
    Identifies whether the SleepEntryGuard feature exists on the USB module.

  Description:
    This function identifies whether the SleepEntryGuard feature is available
    on the USB module. When this function returns true, these functions are 
    supported on the device:
    - PLIB_USB_SleepGuardEnable
    - PLIB_USB_SleepGuardDisable

  Preconditions:
    None.

  Parameters:
    index           - Identifier for the device instance

  Returns:
    - true   - The SleepEntryGuard feature is supported on the device
    - false  - The SleepEntryGuard feature is not supported on the device

  Remarks:
    None.
*/

bool PLIB_USB_ExistsSleepEntryGuard( USB_MODULE_ID index );


//******************************************************************************
/* Function :  PLIB_USB_ExistsModuleBusy( USB_MODULE_ID index )

  Summary:
    Identifies whether the ModuleBusy feature exists on the USB module.

  Description:
    This function identifies whether the ModuleBusy feature is available
    on the USB module. When this function returns true, these functions are 
    supported on the device:
    - PLIB_USB_ModuleIsBusy

  Preconditions:
    None.

  Parameters:
    index           - Identifier for the device instance

  Returns:
    - true   - The ModuleBusy feature is supported on the device
    - false  - The ModuleBusy feature is not supported on the device

  Remarks:
    None.
*/

bool PLIB_USB_ExistsModuleBusy( USB_MODULE_ID index );


//******************************************************************************
/* Function :  PLIB_USB_ExistsSuspend( USB_MODULE_ID index )

  Summary:
    Identifies whether the Suspend feature exists on the USB module.

  Description:
    This function identifies whether the Suspend feature is available
    on the USB module. When this function returns true, these functions are 
    supported on the device:
    - PLIB_USB_SuspendEnable
    - PLIB_USB_SuspendDisable

  Preconditions:
    None.

  Parameters:
    index           - Identifier for the device instance

  Returns:
    - true   - The Suspend feature is supported on the device
    - false  - The Suspend feature is not supported on the device

  Remarks:
    None.
*/

bool PLIB_USB_ExistsSuspend( USB_MODULE_ID index );


//******************************************************************************
/* Function :  PLIB_USB_ExistsModulePower( USB_MODULE_ID index )

  Summary:
    Identifies whether the ModulePower feature exists on the USB module.

  Description:
    This function identifies whether the ModulePower feature is available
    on the USB module. When this function returns true, these functions are 
    supported on the device:
    - PLIB_USB_Enable
    - PLIB_USB_Disable

  Preconditions:
    None.

  Parameters:
    index           - Identifier for the device instance

  Returns:
    - true   - The ModulePower feature is supported on the device
    - false  - The ModulePower feature is not supported on the device

  Remarks:
    None.
*/

bool PLIB_USB_ExistsModulePower( USB_MODULE_ID index );


//******************************************************************************
/* Function :  PLIB_USB_ExistsGEN_InterruptStatus( USB_MODULE_ID index )

  Summary:
    Identifies whether the GEN_InterruptStatus feature exists on the USB module.

  Description:
    This function identifies whether the GEN_InterruptStatus feature is available
    on the USB module. When this function returns true, these functions are 
    supported on the device:
    - PLIB_USB_InterruptFlagSet
    - PLIB_USB_InterruptFlagClear
    - PLIB_USB_InterruptFlagGet
    - PLIB_USB_InterruptFlagAllGet

  Preconditions:
    None.

  Parameters:
    index           - Identifier for the device instance

  Returns:
    - true   - The GEN_InterruptStatus feature is supported on the device
    - false  - The GEN_InterruptStatus feature is not supported on the device

  Remarks:
    None.
*/

bool PLIB_USB_ExistsGEN_InterruptStatus( USB_MODULE_ID index );


//******************************************************************************
/* Function :  PLIB_USB_ExistsGEN_Interrupt( USB_MODULE_ID index )

  Summary:
    Identifies whether the GEN_Interrupt feature exists on the USB module.

  Description:
    This function identifies whether the GEN_Interrupt feature is available
    on the USB module. When this function returns true, these functions are 
    supported on the device:
    - PLIB_USB_InterruptEnable
    - PLIB_USB_InterruptDisable
    - PLIB_USB_InterruptIsEnabled

  Preconditions:
    None.

  Parameters:
    index           - Identifier for the device instance

  Returns:
    - true   - The GEN_Interrupt feature is supported on the device
    - false  - The GEN_Interrupt feature is not supported on the device

  Remarks:
    None.
*/

bool PLIB_USB_ExistsGEN_Interrupt( USB_MODULE_ID index );


//******************************************************************************
/* Function :  PLIB_USB_ExistsALL_Interrupt( USB_MODULE_ID index )

  Summary:
    Identifies whether the ALL_Interrupt feature exists on the USB module.

  Description:
    This function identifies whether the ALL_Interrupt feature is available
    on the USB module. When this function returns true, these functions are 
    supported on the device:
    - PLIB_USB_AllInterruptEnable

  Preconditions:
    None.

  Parameters:
    index           - Identifier for the device instance

  Returns:
    - true   - The ALL_Interrupt feature is supported on the device
    - false  - The ALL_Interrupt feature is not supported on the device

