chipKIT32/chipKIT-core/pic32/cores/pic32/harmony/framework/peripheral/usb/plib_usb.h
  Remarks:
    None.
*/

bool PLIB_USB_ExistsALL_Interrupt( USB_MODULE_ID index );


//******************************************************************************
/* Function :  PLIB_USB_ExistsERR_InterruptStatus( USB_MODULE_ID index )

  Summary:
    Identifies whether the ERR_InterruptStatus feature exists on the USB module.

  Description:
    This function identifies whether the ERR_InterruptStatus feature is available
    on the USB module. When this function returns true, these functions are 
    supported on the device:
    - PLIB_USB_ErrorInterruptFlagSet
    - PLIB_USB_ErrorInterruptFlagClear
    - PLIB_USB_ErrorInterruptFlagGet
    - PLIB_USB_ErrorInterruptFlagAllGet

  Preconditions:
    None.

  Parameters:
    index           - Identifier for the device instance

  Returns:
    - true   - The ERR_InterruptStatus feature is supported on the device
    - false  - The ERR_InterruptStatus feature is not supported on the device

  Remarks:
    None.
*/

bool PLIB_USB_ExistsERR_InterruptStatus( USB_MODULE_ID index );


//******************************************************************************
/* Function :  PLIB_USB_ExistsERR_Interrupt( USB_MODULE_ID index )

  Summary:
    Identifies whether the ERR_Interrupt feature exists on the USB module.

  Description:
    This function identifies whether the ERR_Interrupt feature is available
    on the USB module. When this function returns true, these functions are 
    supported on the device:
    - PLIB_USB_ErrorInterruptEnable
    - PLIB_USB_ErrorInterruptDisable
    - PLIB_USB_ErrorInterruptIsEnabled

  Preconditions:
    None.

  Parameters:
    index           - Identifier for the device instance

  Returns:
    - true   - The ERR_Interrupt feature is supported on the device
    - false  - The ERR_Interrupt feature is not supported on the device

  Remarks:
    None.
*/

bool PLIB_USB_ExistsERR_Interrupt( USB_MODULE_ID index );


//******************************************************************************
/* Function :  PLIB_USB_ExistsLastEndpoint( USB_MODULE_ID index )

  Summary:
    Identifies whether the LastEndpoint feature exists on the USB module.

  Description:
    This function identifies whether the LastEndpoint feature is available
    on the USB module. When this function returns true, this function is
    supported on the device:
    - PLIB_USB_LastTransactionEndPtGet

  Preconditions:
    None.

  Parameters:
    index           - Identifier for the device instance

  Returns:
    - true   - The LastEndpoint feature is supported on the device
    - false  - The LastEndpoint feature is not supported on the device

  Remarks:
    None.
*/

bool PLIB_USB_ExistsLastEndpoint( USB_MODULE_ID index );


//******************************************************************************
/* Function :  PLIB_USB_ExistsLastDirection( USB_MODULE_ID index )

  Summary:
    Identifies whether the LastDirection feature exists on the USB module.

  Description:
    This function identifies whether the LastDirection feature is available
    on the USB module. When this function returns true, this function is
    supported on the device:
    - PLIB_USB_LastTransactionDirectionGet

  Preconditions:
    None.

  Parameters:
    index           - Identifier for the device instance

  Returns:
    - true   - The LastDirection feature is supported on the device
    - false  - The LastDirection feature is not supported on the device

  Remarks:
    None.
*/

bool PLIB_USB_ExistsLastDirection( USB_MODULE_ID index );


//******************************************************************************
/* Function :  PLIB_USB_ExistsLastPingPong( USB_MODULE_ID index )

  Summary:
    Identifies whether the LastPingPong feature exists on the USB module.

  Description:
    This function identifies whether the LastPingPong feature is available
    on the USB module. When this function returns true, this function is
    supported on the device:
    - PLIB_USB_LastTransactionPingPongStateGet

  Preconditions:
    None.

  Parameters:
    index           - Identifier for the device instance

  Returns:
    - true   - The LastPingPong feature is supported on the device
    - false  - The LastPingPong feature is not supported on the device

  Remarks:
    None.
*/

bool PLIB_USB_ExistsLastPingPong( USB_MODULE_ID index );


//******************************************************************************
/* Function :  PLIB_USB_ExistsLastTransactionDetails( USB_MODULE_ID index )

  Summary:
    Identifies whether the LastTransactionDetails feature exists on the USB module.

  Description:
    This function identifies whether the LastTransactionDetails feature is available
    on the USB module. When this function returns true, this function is
    supported on the device:
    - PLIB_USB_LastTransactionDetailsGet

  Preconditions:
    None.

  Parameters:
    index           - Identifier for the device instance

  Returns:
    - true   - The LastTransactionDetails feature is supported on the device
    - false  - The LastTransactionDetails feature is not supported on the device

  Remarks:
    None.
*/

bool PLIB_USB_ExistsLastTransactionDetails( USB_MODULE_ID index );


//******************************************************************************
/* Function :  PLIB_USB_ExistsLiveJState( USB_MODULE_ID index )

  Summary:
    Identifies whether the LiveJState feature exists on the USB module.

  Description:
    This function identifies whether the LiveJState feature is available
    on the USB module. When this function returns true, this function is
    supported on the device:
    - PLIB_USB_JStateIsActive

  Preconditions:
    None.

  Parameters:
    index           - Identifier for the device instance

  Returns:
    - true   - The LiveJState feature is supported on the device
    - false  - The LiveJState feature is not supported on the device

