chipKIT32/chipKIT-core/pic32/cores/pic32/harmony/framework/peripheral/usb/plib_usb.h
  Remarks:
    None.
*/

bool PLIB_USB_ExistsLiveJState( USB_MODULE_ID index );


//******************************************************************************
/* Function :  PLIB_USB_ExistsLiveSingleEndedZero( USB_MODULE_ID index )

  Summary:
    Identifies whether the LiveSingleEndedZero feature exists on the USB module.

  Description:
    This function identifies whether the LiveSingleEndedZero feature is available
    on the USB module. When this function returns true, this function is
    supported on the device:
    - PLIB_USB_SE0InProgress

  Preconditions:
    None.

  Parameters:
    index           - Identifier for the device instance

  Returns:
    - true   - The LiveSingleEndedZero feature is supported on the device
    - false  - The LiveSingleEndedZero feature is not supported on the device

  Remarks:
    None.
*/

bool PLIB_USB_ExistsLiveSingleEndedZero( USB_MODULE_ID index );


//******************************************************************************
/* Function :  PLIB_USB_ExistsPacketTransfer( USB_MODULE_ID index )

  Summary:
    Identifies whether the PacketTransfer feature exists on the USB module.

  Description:
    This function identifies whether the PacketTransfer feature is available
    on the USB module. When this function returns true, these functions are 
    supported on the device:
    - PLIB_USB_PacketTransferIsDisabled
    - PLIB_USB_PacketTransferEnable
    - PLIB_USB_PacketTransferDisable

  Preconditions:
    None.

  Parameters:
    index           - Identifier for the device instance

  Returns:
    - true   - The PacketTransfer feature is supported on the device
    - false  - The PacketTransfer feature is not supported on the device

  Remarks:
    None.
*/

bool PLIB_USB_ExistsPacketTransfer( USB_MODULE_ID index );


//******************************************************************************
/* Function :  PLIB_USB_ExistsHostBusyWithToken( USB_MODULE_ID index )

  Summary:
    Identifies whether the HostBusyWithToken feature exists on the USB module.

  Description:
    This function identifies whether the HostBusyWithToken feature is available
    on the USB module. When this function returns true, this function is
    supported on the device:
    - PLIB_USB_IsBusyWithToken

  Preconditions:
    None.

  Parameters:
    index           - Identifier for the device instance

  Returns:
    - true   - The HostBusyWithToken feature is supported on the device
    - false  - The HostBusyWithToken feature is not supported on the device

  Remarks:
    None.
*/

bool PLIB_USB_ExistsHostBusyWithToken( USB_MODULE_ID index );


//******************************************************************************
/* Function :  PLIB_USB_ExistsHostGeneratesReset( USB_MODULE_ID index )

  Summary:
    Identifies whether the HostGeneratesReset feature exists on the USB module.

  Description:
    This function identifies whether the HostGeneratesReset feature is available
    on the USB module. When this function returns true, these functions are 
    supported on the device:
    - PLIB_USB_ResetSignalEnable
    - PLIB_USB_ResetSignalDisable

  Preconditions:
    None.

  Parameters:
    index           - Identifier for the device instance

  Returns:
    - true   - The HostGeneratesReset feature is supported on the device
    - false  - The HostGeneratesReset feature is not supported on the device

  Remarks:
    None.
*/

bool PLIB_USB_ExistsHostGeneratesReset( USB_MODULE_ID index );


//******************************************************************************
/* Function :  PLIB_USB_ExistsOpModeSelect( USB_MODULE_ID index )

  Summary:
    Identifies whether the OpModeSelect feature exists on the USB module.

  Description:
    This function identifies whether the OpModeSelect feature is available
    on the USB module. When this function returns true, this function is
    supported on the device:
    - PLIB_USB_OperatingModeSelect

  Preconditions:
    None.

  Parameters:
    index           - Identifier for the device instance

  Returns:
    - true   - The OpModeSelect feature is supported on the device
    - false  - The OpModeSelect feature is not supported on the device

  Remarks:
    None.
*/

bool PLIB_USB_ExistsOpModeSelect( USB_MODULE_ID index );


//******************************************************************************
/* Function :  PLIB_USB_ExistsResumeSignaling( USB_MODULE_ID index )

  Summary:
    Identifies whether the ResumeSignaling feature exists on the USB module.

  Description:
    This function identifies whether the ResumeSignaling feature is available
    on the USB module. When this function returns true, these functions are 
    supported on the device:
    - PLIB_USB_ResumeSignalingEnable
    - PLIB_USB_ResumeSignalingDisable

  Preconditions:
    None.

  Parameters:
    index           - Identifier for the device instance

  Returns:
    - true   - The ResumeSignaling feature is supported on the device
    - false  - The ResumeSignaling feature is not supported on the device

  Remarks:
    None.
*/

bool PLIB_USB_ExistsResumeSignaling( USB_MODULE_ID index );


//******************************************************************************
/* Function :  PLIB_USB_ExistsBufferFreeze( USB_MODULE_ID index )

  Summary:
    Identifies whether the BufferFreeze feature exists on the USB module.

  Description:
    This function identifies whether the BufferFreeze feature is available
    on the USB module. When this function returns true, these functions are 
    supported on the device:
    - PLIB_USB_PingPongFreeze
    - PLIB_USB_PingPongUnfreeze
    - PLIB_USB_PingPongReset

  Preconditions:
    None.

  Parameters:
    index           - Identifier for the device instance

  Returns:
    - true   - The BufferFreeze feature is supported on the device
    - false  - The BufferFreeze feature is not supported on the device

