chipKIT32/chipKIT-core/pic32/cores/pic32/harmony/framework/peripheral/usb/plib_usb.h
  Remarks:
    None.
*/

bool PLIB_USB_ExistsBufferFreeze( USB_MODULE_ID index );


//******************************************************************************
/* Function :  PLIB_USB_ExistsStartOfFrames( USB_MODULE_ID index )

  Summary:
    Identifies whether the StartOfFrames feature exists on the USB module.

  Description:
    This function identifies whether the StartOfFrames feature is available
    on the USB module. When this function returns true, these functions are 
    supported on the device:
    - PLIB_USB_SOFEnable
    - PLIB_USB_SOFDisable

  Preconditions:
    None.

  Parameters:
    index           - Identifier for the device instance

  Returns:
    - true   - The StartOfFrames feature is supported on the device
    - false  - The StartOfFrames feature is not supported on the device

  Remarks:
    None.
*/

bool PLIB_USB_ExistsStartOfFrames( USB_MODULE_ID index );


//******************************************************************************
/* Function :  PLIB_USB_ExistsNextTokenSpeed( USB_MODULE_ID index )

  Summary:
    Identifies whether the NextTokenSpeed feature exists on the USB module.

  Description:
    This function identifies whether the NextTokenSpeed feature is available
    on the USB module. When this function returns true, this function is
    supported on the device:
    - PLIB_USB_TokenSpeedSelect

  Preconditions:
    None.

  Parameters:
    index           - Identifier for the device instance

  Returns:
    - true   - The NextTokenSpeed feature is supported on the device
    - false  - The NextTokenSpeed feature is not supported on the device

  Remarks:
    None.
*/

bool PLIB_USB_ExistsNextTokenSpeed( USB_MODULE_ID index );


//******************************************************************************
/* Function :  PLIB_USB_ExistsDeviceAddress( USB_MODULE_ID index )

  Summary:
    Identifies whether the DeviceAddress feature exists on the USB module.

  Description:
    This function identifies whether the DeviceAddress feature is available
    on the USB module. When this function returns true, these functions are 
    supported on the device:
    - PLIB_USB_DeviceAddressSet
    - PLIB_USB_DeviceAddressGet

  Preconditions:
    None.

  Parameters:
    index           - Identifier for the device instance

  Returns:
    - true   - The DeviceAddress feature is supported on the device
    - false  - The DeviceAddress feature is not supported on the device

  Remarks:
    None.
*/

bool PLIB_USB_ExistsDeviceAddress( USB_MODULE_ID index );


//******************************************************************************
/* Function :  PLIB_USB_ExistsFrameNumber( USB_MODULE_ID index )

  Summary:
    Identifies whether the FrameNumber feature exists on the USB module.

  Description:
    This function identifies whether the FrameNumber feature is available
    on the USB module. When this function returns true, this function is
    supported on the device:
    - PLIB_USB_FrameNumberGet

  Preconditions:
    None.

  Parameters:
    index           - Identifier for the device instance

  Returns:
    - true   - The FrameNumber feature is supported on the device
    - false  - The FrameNumber feature is not supported on the device

  Remarks:
    None.
*/

bool PLIB_USB_ExistsFrameNumber( USB_MODULE_ID index );


//******************************************************************************
/* Function :  PLIB_USB_ExistsTokenPID( USB_MODULE_ID index )

  Summary:
    Identifies whether the TokenPID feature exists on the USB module.

  Description:
    This function identifies whether the TokenPID feature is available
    on the USB module. When this function returns true, these functions are 
    supported on the device:
    - PLIB_USB_TokenPIDGet
    - PLIB_USB_TokenPIDSet

  Preconditions:
    None.

  Parameters:
    index           - Identifier for the device instance

  Returns:
    - true   - The TokenPID feature is supported on the device
    - false  - The TokenPID feature is not supported on the device

  Remarks:
    None.
*/

bool PLIB_USB_ExistsTokenPID( USB_MODULE_ID index );


//******************************************************************************
/* Function :  PLIB_USB_ExistsTokenEP( USB_MODULE_ID index )

  Summary:
    Identifies whether the TokenEP feature exists on the USB module.

  Description:
    This function identifies whether the TokenEP feature is available
    on the USB module. When this function returns true, these functions are 
    supported on the device:
    - PLIB_USB_TokenEPGet
    - PLIB_USB_TokenEPSet

  Preconditions:
    None.

  Parameters:
    index           - Identifier for the device instance

  Returns:
    - true   - The TokenEP feature is supported on the device
    - false  - The TokenEP feature is not supported on the device

  Remarks:
    None.
*/

bool PLIB_USB_ExistsTokenEP( USB_MODULE_ID index );


//******************************************************************************
/* Function :  PLIB_USB_ExistsSOFThreshold( USB_MODULE_ID index )

  Summary:
    Identifies whether the SOFThreshold feature exists on the USB module.

  Description:
    This function identifies whether the SOFThreshold feature is available
    on the USB module. When this function returns true, these functions are 
    supported on the device:
    - PLIB_USB_SOFThresholdGet
    - PLIB_USB_SOFThresholdSet

  Preconditions:
    None.

  Parameters:
    index           - Identifier for the device instance

  Returns:
    - true   - The SOFThreshold feature is supported on the device
    - false  - The SOFThreshold feature is not supported on the device

  Remarks:
    None.
*/

bool PLIB_USB_ExistsSOFThreshold( USB_MODULE_ID index );


//******************************************************************************
/* Function :  PLIB_USB_ExistsBDTBaseAddress( USB_MODULE_ID index )

  Summary:
    Identifies whether the BDTBaseAddress feature exists on the USB module.

  Description:
    This function identifies whether the BDTBaseAddress feature is available
    on the USB module. When this function returns true, these functions are 
    supported on the device:
    - PLIB_USB_BDTBaseAddressGet
    - PLIB_USB_BDTBaseAddressSet

  Preconditions:
    None.

  Parameters:
    index           - Identifier for the device instance

  Returns:
    - true   - The BDTBaseAddress feature is supported on the device
    - false  - The BDTBaseAddress feature is not supported on the device

