chipKIT32/chipKIT-core/pic32/cores/pic32/harmony/framework/peripheral/usb/plib_usb.h
  Remarks:
    None.
*/

bool PLIB_USB_ExistsBDTBaseAddress( USB_MODULE_ID index );


//******************************************************************************
/* Function :  PLIB_USB_ExistsEyePattern( USB_MODULE_ID index )

  Summary:
    Identifies whether the EyePattern feature exists on the USB module.

  Description:
    This function identifies whether the EyePattern feature is available
    on the USB module. When this function returns true, these functions are 
    supported on the device:
    - PLIB_USB_EyePatternDisable
    - PLIB_USB_EyePatternEnable

  Preconditions:
    None.

  Parameters:
    index           - Identifier for the device instance

  Returns:
    - true   - The EyePattern feature is supported on the device
    - false  - The EyePattern feature is not supported on the device

  Remarks:
    None.
*/

bool PLIB_USB_ExistsEyePattern( USB_MODULE_ID index );


//******************************************************************************
/* Function :  PLIB_USB_ExistsStopInIdle( USB_MODULE_ID index )

  Summary:
    Identifies whether the StopInIdle feature exists on the USB module.

  Description:
    This function identifies whether the StopInIdle feature is available
    on the USB module. When this function returns true, these functions are 
    supported on the device:
    - PLIB_USB_StopInIdleEnable
    - PLIB_USB_StopInIdleDisable

  Preconditions:
    None.

  Parameters:
    index           - Identifier for the device instance

  Returns:
    - true   - The StopInIdle feature is supported on the device
    - false  - The StopInIdle feature is not supported on the device

  Remarks:
    None.
*/

bool PLIB_USB_ExistsStopInIdle( USB_MODULE_ID index );


//******************************************************************************
/* Function :  PLIB_USB_ExistsAutomaticSuspend( USB_MODULE_ID index )

  Summary:
    Identifies whether the AutomaticSuspend feature exists on the USB module.

  Description:
    This function identifies whether the AutomaticSuspend feature is available
    on the USB module. When this function returns true, these functions are 
    supported on the device:
    - PLIB_USB_AutoSuspendDisable
    - PLIB_USB_AutoSuspendEnable

  Preconditions:
    None.

  Parameters:
    index           - Identifier for the device instance

  Returns:
    - true   - The AutomaticSuspend feature is supported on the device
    - false  - The AutomaticSuspend feature is not supported on the device

  Remarks:
    None.
*/

bool PLIB_USB_ExistsAutomaticSuspend( USB_MODULE_ID index );


//******************************************************************************
/* Function :  PLIB_USB_ExistsPingPongMode( USB_MODULE_ID index )

  Summary:
    Identifies whether the PingPongMode feature exists on the USB module.

  Description:
    This function identifies whether the PingPongMode feature is available
    on the USB module. When this function returns true, these functions are 
    supported on the device:
    - PLIB_USB_PingPongModeSelect
    - PLIB_USB_PingPongModeGet

  Preconditions:
    None.

  Parameters:
    index           - Identifier for the device instance

  Returns:
    - true   - The PingPongMode feature is supported on the device
    - false  - The PingPongMode feature is not supported on the device

  Remarks:
    None.
*/

bool PLIB_USB_ExistsPingPongMode( USB_MODULE_ID index );


//******************************************************************************
/* Function :  PLIB_USB_ExistsUOEMonitor( USB_MODULE_ID index )

  Summary:
    Identifies whether the UOEMonitor feature exists on the USB module.

  Description:
    This function identifies whether the UOEMonitor feature is available
    on the USB module. When this function returns true, these functions are 
    supported on the device:
    - PLIB_USB_UOEMonitorEnable
    - PLIB_USB_UOEMonitorDisable

  Preconditions:
    None.

  Parameters:
    index           - Identifier for the device instance

  Returns:
    - true   - The UOEMonitor feature is supported on the device
    - false  - The UOEMonitor feature is not supported on the device

  Remarks:
    None.
*/

bool PLIB_USB_ExistsUOEMonitor( USB_MODULE_ID index );


//******************************************************************************
/* Function :  PLIB_USB_ExistsOnChipPullup( USB_MODULE_ID index )

  Summary:
    Identifies whether the OnChipPullup feature exists on the USB module.

  Description:
    This function identifies whether the OnChipPullup feature is available
    on the USB module. When this function returns true, these functions are 
    supported on the device:
    - PLIB_USB_OnChipPullUpDisable
    - PLIB_USB_OnChipPullUpEnable

  Preconditions:
    None.

  Parameters:
    index           - Identifier for the device instance

  Returns:
    - true   - The OnChipPullup feature is supported on the device
    - false  - The OnChipPullup feature is not supported on the device

  Remarks:
    None.
*/

bool PLIB_USB_ExistsOnChipPullup( USB_MODULE_ID index );


//******************************************************************************
/* Function :  PLIB_USB_ExistsOnChipTransceiver( USB_MODULE_ID index )

  Summary:
    Identifies whether the OnChipTransceiver feature exists on the USB module.

  Description:
    This function identifies whether the OnChipTransceiver feature is available
    on the USB module. When this function returns true, these functions are 
    supported on the device:
    - PLIB_USB_TransceiverEnable
    - PLIB_USB_TransceiverDisable

  Preconditions:
    None.

  Parameters:
    index           - Identifier for the device instance

  Returns:
    - true   - The OnChipTransceiver feature is supported on the device
    - false  - The OnChipTransceiver feature is not supported on the device

