chipKIT32/chipKIT-core/pic32/cores/pic32/harmony/framework/peripheral/usb/plib_usb.h
  Remarks:
    None.
*/

bool PLIB_USB_ExistsOnChipTransceiver( USB_MODULE_ID index );


//******************************************************************************
/* Function :  PLIB_USB_ExistsSpeedControl( USB_MODULE_ID index )

  Summary:
    Identifies whether the SpeedControl feature exists on the USB module.

  Description:
    This function identifies whether the SpeedControl feature is available
    on the USB module. When this function returns true, these functions are 
    supported on the device:
    - PLIB_USB_FullSpeedEnable
    - PLIB_USB_FullSpeedDisable

  Preconditions:
    None.

  Parameters:
    index           - Identifier for the device instance

  Returns:
    - true   - The SpeedControl feature is supported on the device
    - false  - The SpeedControl feature is not supported on the device

  Remarks:
    None.
*/

bool PLIB_USB_ExistsSpeedControl( USB_MODULE_ID index );


//******************************************************************************
/* Function :  PLIB_USB_ExistsEP0LowSpeedConnect( USB_MODULE_ID index )

  Summary:
    Identifies whether the EP0LowSpeedConnect feature exists on the USB module.

  Description:
    This function identifies whether the EP0LowSpeedConnect feature is available
    on the USB module. When this function returns true, these functions are 
    supported on the device:
    - PLIB_USB_EP0LSDirectConnectEnable
    - PLIB_USB_EP0LSDirectConnectDisable

  Preconditions:
    None.

  Parameters:
    index           - Identifier for the device instance

  Returns:
    - true   - The EP0LowSpeedConnect feature is supported on the device
    - false  - The EP0LowSpeedConnect feature is not supported on the device

  Remarks:
    None.
*/

bool PLIB_USB_ExistsEP0LowSpeedConnect( USB_MODULE_ID index );


//******************************************************************************
/* Function :  PLIB_USB_ExistsEP0NAKRetry( USB_MODULE_ID index )

  Summary:
    Identifies whether the EP0NAKRetry feature exists on the USB module.

  Description:
    This function identifies whether the EP0NAKRetry feature is available
    on the USB module. When this function returns true, these functions are 
    supported on the device:
    - PLIB_USB_EP0NakRetryEnable
    - PLIB_USB_EP0NakRetryDisable

  Preconditions:
    None.

  Parameters:
    index           - Identifier for the device instance

  Returns:
    - true   - The EP0NAKRetry feature is supported on the device
    - false  - The EP0NAKRetry feature is not supported on the device

  Remarks:
    None.
*/

bool PLIB_USB_ExistsEP0NAKRetry( USB_MODULE_ID index );


//******************************************************************************
/* Function :  PLIB_USB_ExistsEPnTxRx( USB_MODULE_ID index )

  Summary:
    Identifies whether the EPnTxRx feature exists on the USB module.

  Description:
    This function identifies whether the EPnTxRx feature is available
    on the USB module. When this function returns true, these functions are 
    supported on the device:
    - PLIB_USB_EPnTxSelect
    - PLIB_USB_EPnRxSelect
    - PLIB_USB_EPnTxRxSelect

  Preconditions:
    None.

  Parameters:
    index           - Identifier for the device instance

  Returns:
    - true   - The EPnTxRx feature is supported on the device
    - false  - The EPnTxRx feature is not supported on the device

  Remarks:
    None.
*/

bool PLIB_USB_ExistsEPnTxRx( USB_MODULE_ID index );


//******************************************************************************
/* Function :  PLIB_USB_ExistsEPnRxEnable( USB_MODULE_ID index )

  Summary:
    Identifies whether the EPnRxEnableEnhanced feature exists on the USB module.

  Description:
    This function identifies whether the EPnRxEnableEnhanced feature is available
    on the USB module. When this function returns true, these functions are 
    supported on the device:
    - PLIB_USB_EPnRxEnable
    - PLIB_USB_EPnRxDisable
    - PLIB_USB_EPnTxEnable
    - PLIB_USB_EPnTxDisable
    - PLIB_USB_EPnHandshakeEnable
    - PLIB_USB_EPnHandshakeDisable
    - PLIB_USB_EPnControlTransferEnable
    - PLIB_USB_EPnControlTransferDisable
    - PLIB_USB_EPnIsStalled
    - PLIB_USB_EPnStallClear

  Preconditions:
    None.

  Parameters:
    index           - Identifier for the device instance

  Returns:
    - true   - The EPnRxEnableEnhanced feature is supported on the device
    - false  - The EPnRxEnableEnhanced feature is not supported on the device

  Remarks:
    None.
*/

bool PLIB_USB_ExistsEPnRxEnable( USB_MODULE_ID index );


//******************************************************************************
/* Function :  PLIB_USB_ExistsBDTFunctions( USB_MODULE_ID index )

  Summary:
    Identifies whether the BDTFunctions feature exists on the USB module.

  Description:
    This function identifies whether the BDTFunctions feature is available 
    on the USB module. When this function returns true, these functions are 
    supported on the device:
    - PLIB_USB_BufferAddressGet
    - PLIB_USB_BufferAddressSet
    - PLIB_USB_BufferByteCountGet
    - PLIB_USB_BufferByteCountSet
    - PLIB_USB_BufferCancelReleaseToUSB
    - PLIB_USB_BufferAllCancelReleaseToUSB
    - PLIB_USB_BufferClearAll
    - PLIB_USB_BufferDataToggleGet
    - PLIB_USB_BufferDataToggleSelect
    - PLIB_USB_BufferDataToggleSyncEnable
    - PLIB_USB_BufferDataToggleSyncDisable
    - PLIB_USB_BufferIndexGet
    - PLIB_USB_BufferPIDBitsClear
    - PLIB_USB_BufferPIDGet
    - PLIB_USB_BufferReleasedToSW
    - PLIB_USB_BufferReleaseToUSB
    - PLIB_USB_BufferSchedule
    - PLIB_USB_BufferStallDisable
    - PLIB_USB_BufferStallEnable
    - PLIB_USB_BufferStallGet
    - PLIB_USB_BufferEP0RxStatusInitialize
    - PLIB_USB_BufferClearAllDTSEnable

  Preconditions:
    None.

  Parameters:
    index           - Identifier for the device instance

  Returns:
    - true   - The BDTFunctions feature is supported on the device
    - false  - The BDTFunctions feature is not supported on the device

  Remarks:
    None.
*/

bool PLIB_USB_ExistsBDTFunctions( USB_MODULE_ID index );

//DOM-IGNORE-BEGIN
#ifdef __cplusplus
}
#endif
//DOM-IGNORE-END

// ****************************************************************************
// ****************************************************************************
// Section: Included Files (continued)
// ****************************************************************************
// ****************************************************************************
/*  The file included below  maps the interface definitions above to appropriate
    implementations defined in the implementation (imp) file(s).
*/

// DOM-IGNORE-BEGIN
//#include other_stuff.h
// DOM-IGNORE-END

// Note: usb_processor.h is not included here.  It is included above to
// provide processor-specific definitions of the Buffer Descriptor Table.

#endif//ndef _PLIB_USB_H

/*******************************************************************************
 End of File
*/
